{
    "site_url": "https://eastcroydoncool.co.uk/",
    "site_title": "EAST CROYDON COOL",
    "site_description": "A Curated Guide to all things Cool in The Cronx",
    "AllContent": [
        {
            "Title": "East Croydon Cool talks…Graffiti",
            "postTimeDate": "May 11, 2018",
            "Text": [
                "East Croydon Cool talks… is a new blog series that explores topics of cultural interest via local area experts.",
                "This month we spoke to Croydon artist Hazoe to learn a little more about the world of graffiti.",
                "Born in Sorrento off the Amalfi Coast, Haz came to the UK aged 5 and grew up in Croydon within a loud Italian family. Recognising his son’s artistic ability at an early age, his father, who is a chef, always said “if you can draw then you can cook” and vice versa. Growing up, Haz found both sketching and cooking therapeutic, so he took cookery and art as part of his GCSE subjects and they turned out to be his best grades. The way he got into graffiti is both a sad but positive story and highlights why some doors need to close before new ones can open. He has been ‘graffiting’ for 4 years now, and knows he will do it forever. Direct quote; “even if you cut my hands off I will find a way to paint!”",
                "1) When/Where did Graffiti start?The word Graffiti actually comes from the Italian word ‘Graffiato’ which means “Scratched”. If you want to go deep into it, you could take it as far back as theCaveman days!Then there were the Greeks and Romans who used to engrave pictures and words with sharp objects onto stone walls to keep records of events and calendars.  In today’s modern world, Graffiti came from New York around the 1970’s, and refers to the painting of full coloured pieces, done top to bottom on trains. The original New York writers inspired others around the world with, what is now referred to as, their “New York Style”.",
                "2) Who were the key artists in the early days?Depends what generation you grew up in! I grew up in the 90’s and so the key writers for me were guys like Mef, Zoned, Zomby, Cosa, Zonk and Take. These were the ones who you spotted on the way to school by the tracks or at big mainline stations. Most of these writers were All City (known for their graffiti throughout a city) and some still are to this day. Consistency and regularity in putting up work to show what it means to have graffiti as part of your life is what makes a true writer.",
                "3) How did Graffiti make the transition from the USA to the UK?There was a writer from New York calledFutura2000who started painting trains in the 70’s. He came over to the UK in the early 80’s and did a trackside piece in West London. I think this helped inspire and influence UK writers and also contributed in shaping what graffiti is today. Nowadays, we can define writers and where they are from by their style of painting. For example, London style, European Style and New York style are all different but all play a big part in graffiti culture.",
                "4) What are the different graffiti techniques?There are so many techniques! You learn as you go along and mostly pick up new ways of painting from fellow writers or by just experimenting. Some writers devise their own techniques to create their own style and to get certain shapes and clean lines. For example, one writer I know uses blocked nozzle caps to get the effect he wants. It’s all about practice and patience and, most importantly, remembering to have fun!",
                "5) Who have been the biggest influences in taking Graffiti mainstream?There are so many big writers all over the world who have helped take the art form mainstream. You had the likes ofKing Robbo, who felt very strongly about politics and referenced this in his work. He was also one of the first London graffiti artists to paint a whole car train. There are still writers putting his name up and pulling off banging pieces in tribute to him. RIP Robbo! Of course, you then haveBanksy, originally from Bristol. But to most writers, Banksy is regarded as a street artist and not a graffiti writer (ironic considering that’s how he started!) Banksy also promotes political messages and views in a comical way which has helped him draw more attention from the general public. There isCope 2from Queens, New York who has been consistent for years and is still painting today for fun. Cope 2 is highly respected by his peers from all around the world. Even I’m a fan of Cope! Google him!! Then you haveBen Einefrom the UK who is famous for his circus style lettering. You can find his work mostly in the Shoreditch butCroydonalso has some. Having made a name for himself within the art community, it was whenDavid Cameron gifted one of his prints to Barack Obamathat Ben gained global recognition. All thanks to Samantha Cameron being a fan of his work!",
                "6) What’s the difference between graffiti and street art?I hate answering this question haha! Everyone has their own opinion on this topic. For me, it depends on what it means to the individual. A graffiti writer wouldn’t call themselves a street artist as it defines a different interpretation. A graffiti writer watches over his location, timing and effort like a lion watches his dinner! A street artist on the other hand has more freedom (and time!) within his domain to paint and is more than likely to have been commissioned.",
                "7) Where are the best places in London to see graffiti?The UK is one of the biggest homes of graffiti fans! We have lots of places where it’s actually legal to paint.Leake Street Tunnelis one of them. Sometimes referred to as the Banksy Tunnel after he organised theCans Festivalthere in 2008, the tunnel is London’s largest legal wall and open to the public 24/7. Stockwell also has a legal wall where Sundays are most popular for local writers to flock to and paint. Last but not least is Croydon which in addition to having a legal wall is also home to theArts Quarter. All of these places make great outdoor galleries and they are free!",
                "8) What do you think of the graffiti/street art scene in Croydon?I think it’s awesome that Croydon is starting to become the new capital of street art and graffiti and I am chuffed to be part of it! What more can I say? When you have a passion for something that you can share for free with others, it’s a gift that is priceless! Croydon has a good mixture of both street art and graffiti writers just like in Shoreditch. You can find work here from the likes of Rich Simmons, David Hollier and Dotmasters. The mix of local and internationally recognised artists is what is helping Croydon evolve into the new capital!",
                "9) How did you get into Graffiti?I have liked drawing characters from a young age. I remember copying Disney characters from my video cassette cases (Sword in the Stone was my favourite!) I have always had a subconscious interest in graffiti, spotting the graff and tags on commutes. When I got into doing graffiti myself, I was sketching my tag but I felt my letters didn’t come out as well as I thought I could do. That led to frustration and so I tried something else and painted the character Bomber Man. This came out well and so I carried on painting other characters. The way my Popeye design came about was when I decided to do a memorial piece for my Grandad. Rest in peace! He actually looked like Popeye…just without the tats! The Croydon legal wall (which was situated in St Georges Walk at the time) was a busy pedestrian walkway but also busy with writers practicing and expressing themselves freely so I did the piece there. It lived a long time and even though well known local writers were painting there everyday, they didn’t go over or touch my Pops! This was a major compliment for me and meant people liked it. So I did a few more Popeyes in different poses and places and then, all of a sudden, people started calling me the Popeye geezer and so I embraced it! My most famous Popeye must be the one that has been living down at West Croydon bus station for a few years. This became a collaboration with a screen print artist calledMiles Khanafter he placed his confidence pill piece, popping out of my Popeye’s spinach can.",
                "10) How would you describe your style?I would class myself as a Character writer, which is quite rare because most writers paint their name and even if they did do a character they would probably just do it next to their piece. I just like to paint characters! But I can piece better these days which I do occasionally and I do like a good throw-up now and again. Haha!",
                "For more information about Hazoe, check out hisInstagramandFacebook Page. Hisonline shop, selling clothes and artwork, will open later this year.To learn more about the street art and graffiti scene in Croydon, take aRise Gallery street art tour."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Yoga",
            "postTimeDate": "April 16, 2018",
            "Text": [
                "East Croydon Cool talks… is a new blog series that explores topics of cultural interest via local area experts.",
                "Yoga may be an ancient practice but it’s popularity has soared in recent years (and last year it became one of themost popular wordsin the UK!) According to a 2016 Yoga Journal report, the yoga and pilates business brings in £812m a year in the UK and globally is now worth over £74 billion.",
                "This month we spoke to Samantha Kruger, Founder and ‘Chief Energy Officer’ atCroydon Power Yoga, to learn a little more about the world of yoga.",
                "Sam originally worked within the financial sector in the City, but six years ago, found herself a little stressed out and decided to try yoga. She never looked back. Not only did a regular practice help her overcome her daily stresses from city work-life but it also helped her overcome anxiety and ultimately become a happier person. She toned up, became physically stronger and no longer suffers from regular colds. Having personally witnessed the life-changing effects of yoga she decided she wanted to share this experience with others.",
                "In 2016, she trained withHot Power Yogafounded by Dylan Ayaloo and now holds a 200-hour Power Vinyasa Yoga teacher training certificate (accredited byYoga Alliance). She continues her personal practice, mentoring regularly with Dylan at Hot Power Yoga.",
                "1) How did you get into Yoga?",
                "10 years ago I did my first class and was instantly hooked. It gave me space to connect to my breath, body and heart in a way I’d never been able to before. I suffered from stress and anxiety at the time and through regular practice I found a way to manage it. It has truly changed my life for the better.",
                "2) What are the different types of yoga?",
                "The style I teach is Power Vinyasa. Vinyasa is the most athletic yoga style. In these classes, movement is coordinated with your breath and movement to flow from one pose to another. Ashtanga and Bikram are also challenging styles. Hatha, Yin and Restorative yoga are slower paced. Kundalini and Jivamukti are the more spiritual styles of yoga. Iyengar yoga focuses on alignment, and poses are held for longer.",
                "3) What are the main benefits of the practice?",
                "Increased flexibility, mental focus, cardiovascular conditioning and muscle development. More importantly, it improves sleep, reduces stress, and relieves anxiety. Power Vinyasa classes are active, which helps the majority of Londoners who sit for long periods of time, which makes your joints stiff and contributes to weight gain and chronic disease. Yoga calms the mind, through focussing entirely on the breath, movement and pose sequences, ultimately the practise forms as part of a moving meditation.",
                "4) Yoga appears to attract more women than men, why do you think this is?",
                "I think guys see mostly girls in yoga classes and so believe it’s just for girls. But this is changing thankfully, as I have had many guys join my classes. Many think they’re not flexible enough to practice and that it’s not a real workout. But ultimately, the health benefits you get from yoga are particularly relevant for men, the lower blood pressure, relief from depression and the effects of stress and improved flexibility. Additionally, the strength and endurance that can be gained from Power Vinyasa Yoga are hard to come by, by any other means.",
                "5) Is yoga replacing religion?",
                "I’ve never thought of yoga as a religion. But as eloquently captured from the New Indian Express from November 2017:”Yoga is not a religion, a belief system or a philosophy. It is a technology for inner evolution, to hasten human evolution to its ultimate possibility.” Through my yoga practice I have developed a higher level of self-awareness and self-love along with having undergone huge personal transformation.",
                "6) Why do you think yoga has seen such an increase in popularity in recent years?",
                "I believe there are a few factors that have contributed to this. Stress is on the rise, and mental health issues such as anxiety, chronic stress and depression affects more and more people in the western world today. Yoga provides a fun and easy way to combat stress and chill you out. It is an easy, and enjoyable way to boost those brain chemicals that are responsible for fighting stress and helping you sleep better. After each session, students feel calmer, more positive and ready to overcome whatever life throws at them.",
                "7) Can anyone do yoga? (pregnant/injured/overweight?)",
                "Yes absolutely, anyone can practice yoga. For pregnant ladies, there are specific prenatal and postnatal yoga classes that have been formulated for them as the body goes through a lot of changes pre and post birth. With students with certain injuries, it’s best to consult with a physician (physio/osteopath/GP) to understand if yoga would help alleviate their injury or worsen it. Once the go-ahead has been provided, if attending classes, for certain injuries, modifications can be provided by your yoga teacher. Yoga can most definitely be performed by overweight people. It saddens me that there is this preconception out there that anyone who practices yoga should be slim and bendy, and this simply isn’t the case. Given overweight people can have trouble with joint pain; yoga can help by improving the body’s alignment to reduce strain on joints by allowing the frame to bear more of the body’s weight. A regular yoga practice can also help to improve self-image and acceptance of one’s body. But ultimately it helps you feel better by improving your physical fitness and elevating your mood.",
                "8) What’s the biggest misconception about yoga?",
                "I think a lot of people believe that yoga is just a regular exercise class. But the yoga practice involves the mind, body and spirit. Through a regular practice you learn to become at peace with who you are, where you are currently at in your life and with those around you.",
                "9) How long have you been teaching in Croydon and when do you teach?",
                "I have been teaching in Croydon since February last year. Currently I teach every Tuesday evening at 18:30 and 20:00 atMatthews Yard. But due to popular demand, I will soon be teaching additional classes each Thursday night at 18:30, and Saturday morning from 11:30 atLimitless VR, starting from the beginning of May.",
                "10) Your classes are currently aimed at all levels, but do you have a beginner focused class?",
                "I will start teaching beginner focused classes from May onwards, every Tuesday at 18:30. Here I will focus on teaching students’ basic alignment and breathing. These classes will help to form a good level of basics, enabling them to then attend all other classes at Croydon Power Yoga.",
                "Click Hereto learn more or sign up for a Croydon Power Yoga class."
            ],
            "Media": []
        },
        {
            "Title": "#CroydonIsCool Tweet Chat",
            "postTimeDate": "June 10, 2018",
            "Text": [
                "On Tuesday 19th June, East Croydon Cool is hosting a Tweet Chat to help spread the word that #CroydonIsCool !",
                "What’s a Tweet Chat?A Tweet chat is where a group of Twitter users discuss a certain topic, using a designated hashtag, at a pre-determined time.The host will pose questions (using Q1, Q2 etc) to prompt responses from participants (who will reply using A1, A2 etc) and encourage interaction among the group. Chats typically last one hour.",
                "Why are we doing it?Because we want to use the knowledge and experience of local residents and businesses to help spread the word that Croydon is cool. Our aim is to get #CroydonIsCool trending on Twitter that morning.",
                "Why should you get involved?1) To grow your network and increase your engagement2) To learn more about Croydon3) To help spread the word that Croydon is Cool (because a win for Croydon is a win for us all!)",
                "How does it work?At 10am we will ask our first question using Q1 at the start and the hashtag at the end.",
                "For example;“Q1 where’s the best place for a pint in Croydon? #CroydonIsCool”Participants will then answer using A1 at the start and the hashtag at the end. For example;“A2 @DogandBullCR0 because beers always taste better in a beer garden #CroydonIsCool”.",
                "We will continue to post questions (at 5 minute intervals) until all 10 questions are answered. By working together and using the same hashtag in a short period of time, we all have more influence than if we were working alone.",
                "What questions will be asked?Tweet Chats can move fast (!) so we want participants to be prepped and ready with their answers. So below is a head’s up on the questions we’ll be asking:",
                "Q1: Where’s the best place to enjoy a drink in Croydon? #CroydonIsCoolQ2: Where’s the best place to eat in Croydon? #CroydonIsCoolQ3: Where do you go for a caffeine hit in Croydon? #CroydonIsCoolQ4: Where’s great to hangout in Croydon? #CroydonIsCoolQ5: Who’s your Croydon hero? #CroydonIsCoolQ6: Where’s the best place to get fit in Croydon? #CroydonIsCoolQ7: Where do you go for live music in Croydon? #CroydonIsCoolQ8: What’s good to do on a rainy day in Croydon? #CroydonIsCoolQ9: What’s the best way to relax in Croydon? #CroydonIsCoolQ10: What’s the coolest thing about Croydon? #CroydonIsCool",
                "Once you’ve posted your answer, feel free to comment/reply to other people’s answers.",
                "What do you need to do to take part?1) Confirm that you will be taking part by tweeting (before 19th June)“I’m taking part in the #CroydonIsCool Tweet Chat. Are you? https://bit.ly/2MdSE9t”2) Prepare your answers (it’s much easier to have them typed up and ready with any handles you want to include)3) Follow @EastCroydonCool on Twitter from 10am on Tuesday 19th June",
                "See you then!",
                "UPDATE: The Results are in!",
                "Thank you to the 48 contributors who took part in this morning’s tweet chat.Whilst we didn’t (quite!) get the hashtag trending, the 184 tweets posted during this time meant our #CroydonIsCool message reached an impressive 89,053 accounts with a reach of 231,583!",
                "We look forward to hosting more tweet chats surrounding some of the topics we touched on in the near future."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2018/06/tweet-chat-screen-shot-2.jpg?w=420&h=298"
            ]
        },
        {
            "Title": "East Croydon Cool talks…Hip Hop",
            "postTimeDate": "July 4, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts.",
                "This month we chatted to Sumit Rehal, the Editor in Chief ofHighlight Nationto learn a little more about the world of Hip Hop.",
                "Highlight Nation was founded in 2014 as an entertainment website to promote under-represented talent. The site has gained a strong cult following of thousands worldwide who appreciate the viewpoints and creativity of the journalists. In addition to interviews, articles and video content, Highlight Nation also run a range of events including the hugely popular2Pac Changes exhibitionheld in Croydon last year.",
                "Alongside his role at Highlight Nation, Sumit is also a music and art journalist. He started writing out of frustration and dissatisfaction with what is regarded as popular culture. He was fed up with media executives telling people what to believe and so decided that “in a world where the mainstream is dictated by advertising and money hungry corporations”, he would “seek to celebrate true talent by creating content that highlights passion and supports local industry.”",
                "Sumit’s three vices are hip hop, travelling and wrestling, all of which he has written about extensively.",
                "1) When did Hip Hop start? Who were it’s founders?Hip hop started to popularise in the late 1970s in the Bronx, New York. It is argued that DJ Kool Herc put on the first ever hip hop parties at 1520 Sedgwick Avenue and this is where pioneering artists such as Grandmaster Caz, Grandmaster Flash, Busy Bee, Afrika Bambaataa, Sheri Sher, Mean Gene, Kool DJ Red Alert, and KRS-One started to get involved. The roots of hip hop culture such as the rapping and the instrumentation traces its way back to jazz and even the African sounds of centuries before.",
                "2) Why/How did it get the name Hip Hop?The early hip hop sounds were very different to what we hear now. Keith “Cowboy” Wiggins, who was an MC in the pionerring rap group The Furious Five, is often credited to coining the term due to him teasing a friend who was in the army by chanting “hip/hop, hip/hop” while preparing to rap on the microphone. He later worked this routine in his performances and the phrase caught on.",
                "3) How did Hip Hop make the transition from the USA to the rest of the world?Hip hop in its purest form is a great way to cultivate a message, especially towards the youth. Movements around the world caught on to social missions of revolutionary hip hop artists such as Public Enemy, NWA, KRS One and 2Pac. Alongside this the non pure form that we hear on the radio is very marketable with its earworms and simplicity. Altogether though, hip hop is the punk rock of today with countless artists using their music to spread a social or unique message.",
                "4) Who have been the biggest influences in taking Hip Hop mainstream?In terms of rappers – 2Pac and Eminem were behemoths when it came to controversy and making waves into the mainstream. However there are those behind the boards such as Dr Dre and Kanye West who have been geniuses when it comes to business and production deals.",
                "5) Why so much homophobia and misogyny?At its very core, hip hop is unfiltered social commentary. If a rapper is being genuine, they are commenting on what they really feel or what they see and it is actually all they know. If a rapper feels love, he will rap about it. If a rapper feels hate, he will rap about it. However the balance of this is dangerous as many business executives prefer to market the more mysogynistic side of things because that is what they feel the audience prefers to hear. If that is the case then it appeals to what people also resonate with.",
                "The way I see it though is that hip hop is a broad term for one topic. When you think of restaurants, you mostly get restaurants that are bad for you and filled with junk such as McDonalds or you will get restaurants that sell high end, healthy food but they are less common. The same thing goes with music, the junk is what is mostly available as it is easy to process but there are still thousands of positive artists that you just have to put a bit more of effort in to find. The only way we will hear something different is if we change our listening habits.",
                "Modern rappers such as J Cole and Kendrick Lamar are the most popular music artists in the world right now but most of their messages are very supportive of different communities.",
                "6) What impact has Hip Hop had on UK culture?Early hip hop has had an impact on UK movements such as Garage and Grime but those genres are also inspired from other genres such as Jungle and Drum N bass. However artistry such as Graffiti and breakdancing are also part of the hip hop family and this has played a huge part of UK culture of the last few decades.",
                "7) What are the best Hip Hop events/gigs around the world?Hip Hop Kemp near Prague is one of the most popular pure hip hop festivals with old school and new school rappers on all day in one stage. You even get to travel to the festival by steam train!",
                "8) Has tension between artists been an integral part of Hip Hop culture?Many treat hip hop as a sport as there is limited space for competition. However a lot of the time the tension is fueled by the media and it is blown out of proportion. A lot of tension between UK rappers is thankfully just banter at the end of the day.",
                "9) What does the future of hip hop in South London hold?There have been a huge breakthrough of rappers and producers from South London come through recently. Mainstream artists such as Stormzy and Krept & Konan are from Croydon itself and others such as Giggs are from around the area too. In the near future,  we will see a variety within underground social rappers such as Vividree breaking through.",
                "10) How can we keep up to date with what’s to come?Keep it locked in at Highlight Nation, check out thewebsiteand follow us on Instagram@Highlight.Nationfor interviews for the next wave of artists coming through!"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Personal Training",
            "postTimeDate": "May 29, 2018",
            "Text": [
                "East Croydon Cool talks… is a new blog series that explores topics of cultural interest via local area experts.",
                "This month we spoke to Tom Riddick, co-owner ofMYPT Studio, to learn a little more about the world of personal training.",
                "As a qualified Personal Trainer, with over 10 years’ experience helping clients achieve fat loss and body transformations, Tom co-created Croydon’s leading Personal Training studio, MYPT Studio, with the objective to help as many local men and women achieve a fitter, healthier lifestyle.",
                "MYPT Studio specialise in Personal Training, with a team of over 20 Health Professionals coming together to offer 1:1 PT, therapy, Yoga and Indoor Cycle, together with Croydon’s first Group Personal Training Programme. All MYPT members follow a targeted training and nutrition programme, along with support from their own coach, to ensure they’re doing everything possible to achieve their goals.",
                "1) Where/when did personal training become popular?",
                "Personal Training dates back thousands of years to the ancient Greeks, who used Personal Trainers to train athletes for Olympic Games, Gladiator events and such like. Working with a coach has always been a staple part of most athletes and sports professionals training routines over the years, but I’d say it’s been steadily moving into mainstream society within the last 10-15 years or so. The UK Personal Training industry is now booming, with more and more people recognising the benefits of working with a Personal Trainer, over going at it alone.",
                "2) Why do you think there has been such a growth within the UK personal training industry?",
                "Personal Training was once seen as an expensive luxury, afforded only by the rich and famous or sports athletes. But now, to many of the clients we work with at MYPT Studio, the idea of working with a Personal Trainer is much like hiring a mechanic to fix your car or going to a solicitor for legal advice.",
                "People are starting to realise more than ever that they may need help from an expert in their field. We can’t all be experts at everything, after all. Working with a good, experienced PT is an extremely effective way to almost guarantee you reach your goals, with nutrition advice, training programmes and support alongside your sessions.",
                "While some people are ditching their expensive gym membership for a budget “no frills” option, others are realising that they can’t (or don’t want to) go it alone and are instead using their resources to pay for the extra support, education and effective training that a Personal Trainer can provide.",
                "3) What are the main benefits of PT over a normal gym?",
                "At MYPT, our clients have the luxury of working with a Personal Trainer at every session.",
                "For those starting out with exercise, this can be a great way of making sure you’re doing the right exercises to achieve your goals, whilst reducing risk of injury and generally “doing things wrong”. Our Personal Trainers are always on hand to offer advice and alternative exercises where necessary.",
                "Setting out on a fitness journey can also be a daunting, often lonely experience. Working with a Personal Trainer means you’ll always have somebody to lean on for advice, support and encouragement. A good Personal Trainer will always provide much more than the hour they are with their client, with training programmes, nutrition advice and plenty of support whenever you need it most.",
                "Lastly, we realise that the vast majority of our clients see exercise as a chore and something they “have” to do. As Personal Trainers, our goal is help our clients enjoy the experience and (as much as possible, anyway!) help turn exercise into an enjoyable thing to do. If we achieve this, we’ll go a long way towards making it part of their lifestyle but guaranteeing their results!",
                "4) Is PT worth the extra money?",
                "I’m biased of course, but I truly believe that a good Personal Trainer (such as my team at MYPT Studio) is worth their weight in gold! (* See question 9 for caveat!)",
                "We all want to look, feel, move and perform as good as we possibly can, don’t we? I think it’s common knowledge now that exercise, good nutrition and recovery (along with enjoying life of course!) are necessary for us to perform at our absolute best and live long, happy lives. So if working with a Personal Trainer guarantees us all these things – why wouldn’t we all want to be doing it?",
                "Obviously, it needs to be affordable and fit in with our clients’ lifestyle. This is exactly why we created our Group Personal Training programme; to give more people the opportunity to experience the benefits of working with a Personal Trainer at a more affordable rate.",
                "Many of our clients work with a PT on a 1:1 basis, with Group PT alongside, as they truly value the idea of working safely and effectively with our team of PT’s and they typically see amazing results from it.",
                "5) Does nutrition form part of a PT programme?",
                "Nutrition forms a huge part of what we do at MYPT. We have a variety of different nutrition programmes available to our clients, all are included for free as part of their training with us.",
                "We aim to match the nutrition programme to the client and work with them to adapt and make this suit their lifestyle. We also try to educate our members on the “what’s”, “why’s” and “how’s” of it all, to ensure they are learning from the process and guided towards achieving results for themselves. This makes it an extremely empowering experience and one that ensures their results continue far longer than any fad diet plan they may have followed in the past.",
                "6) How did you get into PT?",
                "I’ve always loved sport and participated in as many as I could as a youngster (and still try to!) After University, I found my way into a series of office jobs which I found mundane, stressful and unfulfilling, so I soon looked into getting back into the exercise side of things.",
                "I’ve always enjoyed being around people and building relationships, so I felt Personal Training was a perfect way for me to do this – whilst helping people find their own love of exercise.",
                "After qualifying in 2009, I started working at Virgin Active as a Personal Trainer. I absolutely loved it, even more than I ever imagined, and quickly decided this was the career for me. In 2012, I left Virgin Active and set out to make it on my own; creating MYPT Studio in the process. I’ve never looked back since! We’ve quickly become known as the go-to place for Personal Training in Croydon, even winning the Croydon Business of the Year Award for Customer Service in 2017; something I’m extremely proud of.",
                "7) What PT’s / PT companies are you most inspired by?",
                "There’s some really great Personal Trainers out there doing amazing things with people.",
                "Personally, I take more of a holistic approach to health and try to keep a broad perspective in treating people as unique individuals. Therefore, I like the work of Personal Trainers with a similar approach to this.",
                "I like what I see ofSix3ninein London,Mark Coles at M10, while a good friend of mine,Daniel Laciofanois doing great things closer to home down in Caterham with his company SSP.",
                "8) What do you think of celebrity PTs (both the ones that train them and the celebrities who become them)?",
                "To be honest, my belief is that – as long as they are qualified – then the work these guys do in helping their clients (or ‘fans’ in many cases) can only be a good thing. Many are breaking down the negative barriers often associated with exercise and are encouraging people to move more, eat smarter and generally take care of their health. I often hear people slateJoe Wicksfor his methodology and approach, but I can see his efforts are rooted towards helping people achieve their best. If he makes tonnes of money and becomes a celebrity as a result, then it’s well deserved in my opinion.",
                "Personal Training is an amazing career and one that I’ve certainly enjoyed building a business around… So if celebrity trainers want to find their way into the industry, and popularise exercise as a result, then this will also lead to good things for all of us. There’s millions of people out there wanting to get fit, healthy and invigorated. There’s also millions who unfortunately aren’t quite as motivated, but probably still need to exercise and live healthier lives. These people need positive role models to look up to in order to achieve this – so if that’s celebrity trainers then great!",
                "8) What would be your advice to anyone looking to work with a Personal Trainer?",
                "Do your homework! As I said previously, a good Personal Trainer can be worth their weight in gold, but the wrong one can also be an expensive way to burn though your cash, with very little reward. There are over 14,000 registered Personal Trainers currently working within the UK, each with differing skills, backgrounds and approaches. It’s important that you find the right PT for you. Someone who you feel you can work closely with and lean on for support and encouragement.",
                "I’m often surprised by the number of people we meet who have worked with a Personal Trainer in the past yet haven’t reached their goals. This can be down to a number of reasons; poor programming, little (often no) nutrition advice, lack of goal setting – or simply down to a clash of personalities.",
                "Make sure you ask for a consultation too. Most should do this for free for you as part of the service. This shouldn’t just be a chance for them to sell to you either; instead, they should listen to you speak about your goals and desires and in return they should be able to clearly communicate their recommendations to you. Be sure to leave the consultation feeling totally understood and 100% confident with their approach.",
                "9) What would be your number one piece of advice to anybody looking to get started (or get back into) exercise?",
                "My advice would be to find something you enjoy!",
                "Granted, it may not quite be as enjoyable as a night in with Netflix and a tub of Ben & Jerry’s, but it should at least be slightly bearable. If you enjoy dancing, then find a Zumba class, take up dancing with a friend or your partner, look into pole dance fitness sessions even. This will help ensure fitness and health are a part of your lifestyle for years to come.",
                "Weight loss is simple really… It doesn’t really matter what you do, as long as you’re burning more calories than you’re eating over a consistent period of time. It needn’t be complicated!",
                "Saying that, full body resistance training 3-4 times per week, alongside an active lifestyle (8-10,000 steps per day, for example) would always be my recommendation for those looking to drop fat, tone muscle and change their body-shape in the quickest time possible. This will not only burn the calories required for you to lose weight but will also aid fat loss (and improve ‘tone’) through muscle tissue development.",
                "But, if you’re after long-term results then finding something you can still see yourself doing this time next year would always be the winner for me.",
                "10) What’s the secret to MYPT’s success?",
                "We help our clients enjoy exercise! We offer fun, varied, effective workouts – with a Personal Trainer with you at every session. We make sure our members are not just a number but are greeted on first name terms and treated as individuals. This has been key to creating the community we have at MYPT Studio, and the sense of belonging that our members feel each time they walk into the studio. Our clients enjoy their workouts with us – which is why they will continue to achieve long-lasting results through our programmes."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Virtual Reality",
            "postTimeDate": "September 11, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. This month we spoke to Simon Jones, Co-Founder of Limitless VR to learn more about the world of Virtual Reality.",
                "In layman’s terms, how would you explain Virtual Reality?It’s an interactive computer-generated experience that gives you the ability to be inside a game in either single player, multi-player or online with others.",
                "What made you want to set up a VR café?It all started a few Christmas’s ago when I was looking for presents for my daughters. I’d tried VR experiences out in London and was totally hooked on the possibilities so bought a couple of tech items so my family could give it a try. Within a month, both myself and Mike had a collection of gaming pc’s and HTC Vive headsets at home. After a year of us both using it at home and talking about its huge potential and how it would impact all business sectors we decided that a VR & gaming experience centre would a great way for us to enter the virtual reality business.",
                "What VR experiences can you enjoy at Limitless VR? Is it all about gaming?There is a big misconception that VR is all about gaming but we have a huge variety of experiences on offer. Everything from simple shooters to trying out new realities or giving something a go that you’ve always wanted to try in real life….like wingsuit jumping off a cliff! You can even dive into the ocean or experience being in the art of Dali or Van Gogh. We have something for everyone age 10 to 100 and cater for single, multi-player/groups, birthday parties and corporate events.",
                "What brands/businesses have adopted VR well?It really is impacting all business sectors. Here at Limitless-VR, we recently hosted some demos for a New York based company who wanted to use VR to model their client’s architectural ideas. Companies like IKEA are using it for visualising their furniture in your own home. It is also starting to be used for training purposes and as a collaborative medium especially during the concept and design process.",
                "Who helped bring VR into the mainstream?The main players are HTC and Oculus but other niche companies are now using the technology for warehouse experiences using gaming laptops in back packs so you can freely roam around e.g. Star Wars experience at Westfield. Nintendo have just opened a Mario Kart VR experience at the O2.",
                "Is VR good/healthy for people (both physically and mentally?)Definitely because a lot of the experiences are room-scale and require you to move around and interact with your surroundings. Everything is very immersive and visually stimulating. At a wider level, in America, the medical profession has used it to help war veterans with pain relief.",
                "What is the future of VR?VR is best out of the home at the moment. Like all new technologies it’s difficult to tell what direction it will take but for now making it more accessible to the general public is key to its success. We are trying to develop a new form of out of home entertainment mixing traditional activities with new technology.",
                "What is the most popular single player game at Limitless-VR?Probably the most popular game at the moment is Beat Saber – you have a light saber in each hand and have to cut blocks, avoid obstacles in time to the music – people of all ages seem to love this game!",
                "What is the most popular multi-player game at Limitless-VR?Arizona Sunshine is a firm favourite as up to 4 people can shoot zombies at the same time. Players see a graphical representation of each other and can hear each other through the headset…all in the Arizona sunshine (which means the game is actually not that scary to play!)"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Counselling",
            "postTimeDate": "October 10, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. This month we spoke to Tom Smithson fromNew Horizon Counsellingto find out more about this type of therapy.",
                "What made you want to become a counsellor?Like many people I got to a point in my life where I didn’t think I couldn’t cope with it, I was confused about my sexuality, about who I was, who I wanted to be and what I wanted to do. I eventually went to the GP who referred me to Cognitive Behavioural Therapy (CBT), it opened my mind to my mental health and started me on a journey of self discovery then I thought, wow this is good, this helps, how can I do this?",
                "How did you train?I started with an Open University Psychology course to dip my toe into the world of the mind. I then started a Level 2 course in Counselling skills, at the end of each course I wanted to know more. I kept continuing and now I have completed my Level 4 Counselling Diploma.",
                "Who is counselling for?I honestly believe it can be for anyone and everyone. Many people think it’s for people who have a diagnosed mental health problems such as depression, bi-polar etc, however most of the people I have worked with this hasn’t been the case. We, as humans, are living in a world that our brains aren`t necessarily used to yet and sometimes it can feel too much. Counselling can be for anyone looking to speak to someone in a confidential environment, who is going to be non judgmental about what is going on in their world and how they might be struggling.",
                "What’s the difference between counselling, therapy, CBT, NLP, Psychology and Psychiatry?Counselling and therapy can go hand in hand and can often mean similar things, some counsellors such as myself might refer to themselves as “Integrative counsellors” meaning they integrate more than one theoretical approach to their work. For example, I work to a person centred therapy meaning the focus is on the client in the room, what’s happening for them, how they feel, how they might see themselves etc. I also work to a Psychodynamic theory that looks more at the clients past, and how that might have shaped who they are in the present.",
                "CBT stands for Cognitive Behavioural Therapy, the type of therapy I first had. It’s very much focused around solutions and is an excellent tool for Anxiety and other common mental health problems. The therapy might include looking at trying to change the way you think by encouraging you to look at how you react and why you might react that way.",
                "There are many other counselling approaches that can help different people in different ways such as addiction counselling, couples counselling, family counselling many using different approaches so it depends on what you need.",
                "What can people expect from the counselling experience?Most counsellors will be part of a governing body, for me I am a member of the BACP (British Association for Counselling and Psychotherapy).  The BACP has an in depth Ethical Framework meaning that the counsellors that are members of the BACP are required to work to the Ethical Framework including working to several ethical principles. These are:",
                "*To be trustworthy: Being trustworthy so the client can trust the counsellor enough to share their thoughts.*Autonomy: Respecting the clients right to be self governing, to make their own decisions.*Beneficence: A commitment to promoting the clients wellbeing.*Non – Maleficence: A commitment to avoiding harm to the client.*Justice: The fair and impartial treatment of all clients and the provision of adequate services.*Self-respect: Fostering the practitioners self knowledge, integrity and care for self.",
                "What’s the best way for someone to choose a counsellor?The BACP website has a full list of counsellors that you can search by a number of categories. There are several other sites including the Counselling Directory where you can select the area you live in and what you are looking for help with. It will then give you a list of counsellors where you can read their pages in more detail. Also have a look at my website and if you like the sound of me as a counsellor and the work I do please get in touch!",
                "Why did you set up in Croydon?Croydon is changing and with more and more people moving here, there will be a greater requirement for counselling support, especially support for clients that might want to discuss aspects of their sexuality or sexual identity. The NHS and several charities can provide free counselling services, and that is fantastic but there are sometimes waiting lists and clients may only get a small amount of allocated sessions. My service might be smaller but clients will be able to choose to have ongoing counselling should they wish.",
                "What are the most common problems you deal with?Counselling can be useful for so many things and I have worked with a variety of clients. General depression and anxiety is very common with people who are struggling with everyday life, this might be issues at work, family problems, childhood trauma, bulling, weight management, suicidal thoughts, diagnosis of an illness (for example HIV) and many more.",
                "I have spent a lot of time working with clients going through a bereavement, many people feel not able to speak about a loss however when we lose someone it can often feel like we have lost a part of ourselves. I work with clients to help them come to terms with the loss and explore what life was like with the one they lost and how life has now changed without them, good or bad.",
                "I also specialise in areas such as counselling for sexuality and sexual identity, for clients looking to explore their understanding of their own sexuality, how that might have changed or be changing. I see clients who understand their sexuality but want to discuss some of the trauma that they, like so many others in the LGBT community have gone through.",
                "Is there a need for more counselling services for people with HIV?Absolutely, although there are several charities and counsellors that provide this counselling support I feel there can be more done and that`s why I am focusing some of my work in this area. HIV has so many social stereotypes and taboos attached to it and people can feel they can’t talk about it. Even though those with the virus can live a full and happy life many people who have the virus can struggle with a diagnoses and don`t know who to talk to. That`s where I hope the counselling that I offer and other organisations offer can not only help more people to speak about the virus but also try and help stop the stigma around it.",
                "What do you do to help your own mental health?In a busy world it’s easy for anyone to lose track of their own mental health so for me I try and give myself the space and time to focus on me. That can be anything from starting a new book to sitting in a coffee shop and just enjoying the moment, not thinking about what I have done or will do, but just being there. I believe giving time to yourself is the best self care and there is nothing wrong with spoiling yourself every now and then.",
                "For more information on New Horizon Counselling,click here.",
                "Croydon is home to a range of organisations and charities helping to address the community’s mental health needs. Links to a few of those organisations are below:",
                "Croydon Talking TherapiesA free NHS service for anyone 17 years or over who is registered with a Croydon GP. Croydon Talking Therapies offer lots of different support options for anyone experiencing common difficulties like stress, worry, feeling low in mood, trouble sleeping, OCD, social anxiety and panic attacks. Croydon Talking Therapies have a wide range of therapy options including online therapy, workshops, groups and individual therapy. They offer both Cognitive Behavioural Therapy (CBT) and counselling, as well as employment support.",
                "It is quick and simple to access the service and they accept self-referrals. You can simply call 020 3228 4040 or complete an online formhere.You can also ask your GP to refer you. Croydon Talking Therapies have bases across the entire borough and can offer evening appointments from Monday-Thursday. There is no waiting list for assessment or for their first step treatment options (online, workshops, guided self-help).",
                "MIND in CroydonMIND in Croydon is a mental health charity founded in 1967 and since then has developed into a significant provider of mental health services in Croydon. It seeks to empower people to lead a full life as part of their local community. For World Mental Health Day, MIND in Croydon is holding aCatwalk Fashion Showat Boxpark to raise vital funds.",
                "Happy HeadsHappy Heads is an organisation which coordinates events that promote positive mental health by educating people on a balanced lifestyle and creativity.",
                "EvolveEvolve is a charity providing a range of services to homeless and vulnerable people within Croydon and the wider London area. They provide much more than just a roof -Evolve is a place of positive change and growth, enabling people to move on and lead independent lives. Their 1-1 counselling service aims to promote good mental health and wellbeing by providing a high quality and professional service in a confidential and safe setting. The service is free of charge for all customers of Evolve Housing + Support. Counselling is based on the building of a close and trusting relationship between the counsellor and the client by regular weekly meetings. These meetings are for 50 minutes and are offered on the same day, at the same time and with the same counsellor each week.",
                "Off The RecordOff the Record (OTR) Youth Counselling Croydon was founded in 1994 to provide free, independent and professional counselling for 14 – 25 year olds in the Croydon area. Since then the charity has expanded to include further areas of work including BME mental health work; a young carers service offering support to young people under 26 who are caring for a parent or sibling; a specialist counselling service for young refugees; online counselling and workshops; and a young people’s counselling service in the boroughs of Sutton and Merton."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Jewellery Design",
            "postTimeDate": "August 6, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. This month we chatted to Leora (Leo) Moreno, the owner ofLeo with Loveto learn a little more about the world of Jewellery Design.",
                "Leo With Love is a handmade jewellery company founded by Leora in 2016. All the pieces are inspired by and named after the women in her life. The line is designed to accessorise women’s confidence, and future plans for the business include hosting talks and events to inspire more women to take the plunge into business.",
                "1) How did you get into Jewellery design?My background is actually in marketing, but I made jewellery as a hobby – more as gifts for friends and family. I started taking classes a few years ago to brush up on my skills and really enjoyed making a wearable piece of art that can be used to enhance an ensemble.",
                "2) What made you start your own jewellery business?I knew I always wanted to start a business, so made a pinky promise with my sister that we would start our respective businesses together when she recovered from a near-terminal illness. It really put into perspective what was important and what I wanted to do with my one certain chance in life. Thus, Leo With Love was born!",
                "3) What were your biggest concerns when starting out on your own?Totally had imposter syndrome and fear of failure. I think when you’re first starting your own business it’s easy to make comparisons to others, even if it’s not actually comparable. It’s such a big leap to be your own boss – suddenly wearing all the hats, doing your own taxes, working more hours than you would at a typical 9-5. But the sense of pride and fulfilment I’ve felt from watching my business grow from all the work I’ve put in is what keeps me motivated.",
                "4) Why do you think so many independents are doing better than the high street?Part of it is that people are shopping for investment pieces – not only are they willing to spend a bit more on something that will last, but they also want something that transcends fads and is a unique part of their individual style. The other part of it is having easy access to the story and person behind the label, their passion – you’re not just buying from a large, faceless company.",
                "5) How important is social media to your business?It is super important! So many people find me through Instagram and Pinterest. I recently did my first pop up store in Covent Garden and I met a girl from France there who follows Leo With Love on IG. She came to the store to meet me and see the jewellery IRL because she saw my posts on social media – that blew my mind! That is the power of social media in action. Part of LWL is to use my brand as an example to others that if you have confidence in yourself, are willing to put in the hours and constantly be learning – you can reach your goals too! I often post quotes from females from every facet of life, from astrophysicists to legendary designers, that I use to stay motivated in hopes that it keeps other motivated too!",
                "6) Which independent designers do you admire?Katherine Brunacci from KAB Jewellery in London, her style is very different to mine but she really knows what she’s doing! All designs are wax-carved first, then she adds precious stones to the intricate pieces she’s designed. Another designer is Vanessa Arthur from VLM Jewelry (yes, we spell it differently in the US lol) in LA, her aesthetic has that perfect balance between statement and minimalist looks, using precious metals and pearls. There’s really so many though! You can see the passion and love for what they do- it’s extremely motivating.",
                "7) Where do you get your inspiration?Each piece in my collection is inspired by the person it’s named after. These women have inspired me or influenced me in a positive way and I wanted to say thanks, what better way than to create jewellery based on their style and personality? I literally look at the type of jewellery they wear, what their style is, and see how I can couple that with my brand’s aesthetic. Haven’t gotten it wrong yet!",
                "8) What materials do you work with?I mostly work with brass, it’s light and great for those with sensitive skin because there’s no nickel in it. I have rose gold and silver plated versions for most of my collections, all have a super thick plating! It’s great because it keeps the more statement-like pieces as light-weight as the brass versions but you still get all the luxury.",
                "9) How did an LA girl end up calling Croydon home?I moved to England in 2007 to go to Oxford Brookes University, met my SO while there and we moved to East Croydon after graduating. Although Croydon is very different from LA, there’s something about this place that puts me at ease in the way a hometown would. It’s not perfect and the sun doesn’t have a permanent residence here – but it’s got all the salt, pepper, and spices of life that make it interesting (as my mom would say).",
                "10) What does the future hold for Leo With Love?LWL is an all-encompassing brand inspired by empowered females, for empowered females- from showing appreciation to the incredible women who inspired my collections to using quotes on social to feel confident. My jewellery is meant to be metaphorical armour to make things happen today, a little boost to be bold and finish off your outfit! But, I also want LWL to be a working example of what happens when you have confidence in yourself to step out of your comfort zone. That said, I’m going to be regularly posting IGTV videos about how to build confidence and want to start hosting talks in Croydon doing the same thing – helping those that want to step out of their comfort zone to move onto bigger things, but maybe need a little pep talk first."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Homelessness",
            "postTimeDate": "June 25, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts.",
                "This month we spoke to Jasmine Jappy, the Community and Challenge Events Fundraising Officer atEvolveto learn a little more about homelessness and why it is an issue in Croydon.",
                "1) Why is homelessness on the increase in the UK?There is a severe lack of social housing within the UK and with less support being given to those currently housed and less housing available for those needing homes, the increase of those rough sleeping is inevitably rising. There has also been a marked increase in the amount of the population suffering from mental health problems living on the street which – without the correct support – is likely to make the steps for homeless people to get off the street, even harder to obtain. This often prolongs the time homeless people are spending on the streets which again increases the day to day volume of homeless people. Someone with severe mental health issues will find it very hard to gain the confidence to speak to those who may be able to support them gain access to social housing and support for their mental health due to a lack of confidence and other hindering issues.",
                "2) Why is it such a big issue in Croydon?Croydon is the 7th worst borough for rough sleeping. This is partly because of the immigration office being in Croydon and partly because it is such a large borough. It’s also because of the complexity of the people who are rough sleeping and because of the lack of affordable move-on accommodation in the borough. This means supported accommodation and hostels are full up, and without people having somewhere to move on to, we can’t get more people in to them, so they spend longer on the street.",
                "3) Are there different types of homelessness?There are several different types of homelessness. Firstly, there arechronicrough sleepers; those that have been sleeping on the streets for a long period of time. Secondly, there aretransitionalhomeless people who stay in a shelter for a short amount of time and then gain their own living accommodation – often they have become homeless due to trauma. This tends to be the most common. Thirdly, there areepisodichomeless people, who go in and out of being homeless due to several challenges they may face throughout their lives. Finally, there areunseenhomeless people – for example those living on friends or family members sofa’s, not having their own place to call home, but being housed in the short term.",
                "4) How do people become homeless?People can become homeless for a whole host of different reasons. The most frequently heard of factor is relationship/family breakdown, as well as factors such as trauma, debt, poor physical/mental health and also a lack of qualifications making it harder for people to gain paid employment. There can be a number of different factors resulting in one person becoming homeless, which often makes getting that person back into independent living, even harder.",
                "5) How does Evolve seek to address the issue?On a day to day basis, Evolve house 700 homeless people and encourage them to engage with programmes put in place to assist them through their journey from homelessness, to independent living. These programmes include; a Health + Wellbeing programme, which mostly consists of an in-house counselling service and other complementary therapies, a Work + Learning programme which seeks to gain customers access to training, qualifications, work placements and also CV/IT support as well as other programmes/workshops that support customers in other areas of their lives.",
                "6) Should people give food/money to help?Yes – to an established charity that works with those resources effectively. Evolve has a success rate of 78% of customers that come to us and move on and live happily and independently. Every penny we receive goes towards our work. Our currentHurt to Homeless fundraising campaignfocuses on breaking the cycle of trauma through our in-house counselling programme. We need to raise £110,000 to continue our counselling services and help more homeless people rebuild their lives.",
                "7) What can others do to help?1. Fundraise to support a charity that is set up to work with homeless people and use your fundraising most effectively.2. Even better, ask your corporation if they support a charity and nominate a homeless charity. .3. Raise awareness of the issues faced and the work organisations are doing to try and combat them as well as the impact those in the wider community can do to support.4. Take part in a challenge event for a charity supporting the homeless to do both 1 and 2 – raise money and also raise awareness!5. Volunteer",
                "8) What is the biggest misconception about homelessness?The biggest misconception about homelessness in my opinion, is that all homeless people are drug and alcohol users and not interested in work. In fact, the issue is much more complex than that. More often than not it is traumatic events and lack of a good support network that has resulted in that person ending up on the streets and a complete solution is needed to help people rebuild their lives.",
                "9) How is Evolve’s work different to other, better known homelessness charities?Evolve aims to provide an entire 360 degree solution to homelessness. They provide housing as a basis yes, but also provide so much more than that to those they support. They offer all residents living within their services, access to the Health + Wellbeing and the Work + Learning programmes and also provide each person with a key worker who they meet with on a weekly basis to discuss the past week, how they are feeling and talk through any struggles they may have faced that past week. It’s because of this all encompassing approach that Evolve are able to celebrate a 78% positive move on rate of customers moving into services from the streets, and later going on to live independent lives.",
                "10) Where can people learn more about the work Evolve are doing?In June, Evolve publisheda reporton the cycle of trauma. Pulling together personal accounts as well as statistics and data, this report gives insight as to how people can help Evolve in their mission to break the cycle of homelessness."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Theatre",
            "postTimeDate": "April 5, 2018",
            "Text": [
                "East Croydon Cool talks… is a new blog series that explores topics of cultural interest via local area experts.",
                "This month we spoke to Anna Arthur, Director ofCroydonites, to learn a little more about the world of theatre.",
                "Croydonites is a festival of new theatre and performance for Croydon. Its mission is to showcase local theatre makers, and bring some of the best contemporary performance work from around the UK to our neighbourhood. The inaugural event took place in November 2015 when four companies presented work at two venues. The second edition took place in March/April 2017 with eight companies presenting work in six venues.",
                "In 2018, the festival will take place from 27th April to 20th May and will incorporate ten companies presenting work in seven venues. The festival is supported by both the Arts Council England (Grants for the Arts) and Croydon Council through their Cultural Partnership Fund.",
                "In addition to running Croydonites, local resident Anna regularly travels all over London and beyond to see the work of experimental and alternative theatre makers…and so is the perfect person to offer some insight to life behind the curtains 😉",
                "1) How did you get into the theatre world?I always loved theatre and wanted to go to RADA and become an actress, but ended up at art college in Totnes, Devon studying experimental performance. I kind of fell into production work, then producing.",
                "2) What’s the best performance you’ve ever seen?Cloud Street byB Belvoir, a company from Sydney, Australia. It’s 5 hours long but the time flies by, alsoAndrew Schneider youarenowhere– half way through the show a curtain which you think is hiding a back wall, is dropped to reveal a mirror, only it’s not a mirror, it’s another audience who’ve been sat there the whole time. It was completely disorientating.",
                "3) What do you think of the UK theatre scene?It’s the best in the world –Edinburghcomes in for a lot of flak, but it’s still my favourite week of the year.",
                "4) What do you think of the theatre scene in Croydon?It’s developing a new found confidence. We are venue poor, but that will improve when Fairfield opens up. There’s plenty of talent here but there hasn’t been a context like Croydonites before now to showcase it. People are always looking for something a bit different and that’s what Croydonites is trying to offer, so the future is bright.",
                "5) Who do you think can be most credited with pushing the UK theatre scene forward in recent years?Battersea Arts Centre,Camden Peoples Theatre,The Yardin Hackney – they all nurture and develop young artists.",
                "6) Whats the best theatre festival you’ve been to (outside of Croydonites!)LIFTit only happens every 2 years and this is an ‘on’ year – get your tickets!",
                "7) Which theatre companies are pushing the boundaries of theatre internationally?Forced Entertainmentdo a lot of work internationally, and productions from the National Theatre and Royal Court are regularly restaged abroad. However, we really excel when it comes to dance with artists like Hofesh Shechter, Wayne McGregor and Akram Khan doing big business!",
                "8) What is the future of theatre?There will always be a future for good quality work but right now immersive theatre is very current. Generally I think audiences want to participate more, sometimes that means they are literally part of the action, which they can be if they come and seeLand of Nod by Parabolic Theatre Companyas part of the Croydonites Festival. Or inGlitch by Vinicius Salles, they can interact digitally and drive the narrative. I think we have to think more than ever about our audience, engaging them in lots of different ways. Croydonites hastwo projects where people can get involved, a critical writing programme mentored by Tom Black from The Croydon Citizen and a commissioned film. We are looking for actors and crew to create the film (a low-budget extract of American Assassin), it’s part of Richard DeDomenici’s Redux Project.",
                "9) What direction is Croydonites heading?Croydonites will always champion local artists, but I’d very much like to have an international element. Especially next year when we Brexit I plan to have some European work. I could see it becoming a month long international festival or it could morph into something more like a fringe festival (or maybe we should have both). I think it will depend in part on what local artists and audiences want – they usually vote pretty well with their feet!",
                "10) Are you concerned about regeneration affecting the ability of artists to work in Croydon?It’s a well known fact that artists often move into areas that could do with some improvement (because they are usually cheaper), help regenerate them by attracting businesses and developers and then get priced out. I know that the authorities in Croydon are aware of this, and are thinking about strategies to prevent it. But to be honest it happens everywhere and it’s not just artists that get priced out, it’s teachers and medical staff who you could argue play a more vital role (I wouldn’t necessary go along with that…but hey), so something fundamental has to change in our tax system in relation to land. I’m very interested in the principles of natural economics, or economics with justice, but that’s another topic.",
                "To learn more about the Croydonites festival or book tickets seewww.croydonites.com."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Photography",
            "postTimeDate": "June 10, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts.",
                "This month we spoke to Croydon photographerGlenn Fosterto learn a little more about the world of photography.",
                "Having first developed (sorry!) an interest in photography as a child (after his parents gave him a disposable Kodak camera) Glenn is now a self-employed freelance photographer. Although based in Croydon, he loves to travel and shoots all over the world in both a personal and professional capacity.",
                "For more information about Glenn, visit hiswebsite.Keen to learn more about photography or meet like minded photography fans?Lenses of Croydonis a connector group for models, make up artists and photographers based in Croydon. Meet Ups are themed and normally focus on a specific task. They also run the monthly Croydon Photography Forum which features talks from inspirational photographers."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Croydon Literary Festival",
            "postTimeDate": "October 23, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts.",
                "This month we chatted to Cassie Whittell, the Head of Croydon Literary Festival 2018, to learn a little more about the event.",
                "How did the idea for the Croydon Literary Festival come about?Back in January 2017, Jonny Rose put a shoutout in the Croydon Citizen (RIP) for volunteers looking to set up a literary festival. In a fit of madness, I put my hand up. It all went from there – we met in Matthews Yard in March 2017 and the first Croydon Literary Festival took place in September 2017. So it was Jonny’s idea and we took it and ran with it. The festival committee is made up of me, Clair Woodward and Brad Merrett, and we’re supported by a wonderful raft of volunteers and helpers, whom we can’t thank enough for their support.",
                "Does Croydon have a strong Literary background/association?Yes, it does – and that’s something we wanted to promote. Arthur Conan Doyle, Henry James, Emile Zola, Kingsley Amis… all of them have connections to Croydon. One of my favourites is murder-mystery novel The 12.30 From Croydon by Freeman Wills Crofts, which was published in 1934. The titular ‘12.30’ is actually a plane, which makes the whole thing even more thrilling and glamorous.",
                "What type of sessions are there?We’ve expanded this year and really tried to give people a choice of sessions to attend. Whether you’re interested in rock’n’roll, modern romance, erotic literature, Brutalism, food blogging, punk rock, historical crime novels, poetry, local authors… we’ve got something for everyone. A veritable smorgasbord (to quote a cliche) to choose from, and we hope everyone who comes finds something that whets their appetite.",
                "Is there anything for children to take part in?Yes – and this is a new addition to this year’s festival. As we’re holding it in half term, we decided to add in three events for younger readers. So we have the wonderful Robin Stevens, author of the Murder Most Unladylike series, talking about her books in the Braithwaite Hall; then in the Croydon Children’s Library, we have Sylvia Bishop (author of Erica’s Elephant) and her interactive storytelling, which should be a lot of fun. And we also have local poet Paul Point and The Chocolate Poetry Club running a session for young poets. These are for children aged seven and up, and we hope these younger readers will be just as inspired!",
                "Would you recommend any of the events for people who say they’re not into reading?If people aren’t sure what to come to, then try the sessions that we’re running with the Reader charity. These are interactive sessions where you can listen to a poem being read aloud, discuss it, think about it, and hopefully come away wanting to learn more about the author, or reading in general. We have two of these sessions on the day, and they’re inspirational… and only cost £1.50 each (which is to cover off the Reader’s expenses).",
                "How can budding writers make the most of the festival?My old English teacher once told me that the only way to become a writer is to read – as often as you can, as much as you can, as widely as you can. I think that’s true. So budding writers can come along, hear their favourite authors speak, and get inspired! We also encourage our sessions to be as interactive as possible, so authors can ask questions and get involved. Plus, Croydonist is running a short story competition, which is a great platform to get your voice heard – the closing date is Saturday 27 October, so there’s still time to enter your literary work!",
                "In a tech dominated world, how can books/literature keep holding peoples attention?You dive into a book and it’s another world, one that’s often totally different from your own. So it’s escapism of the best kind. Or maybe it’s a book that speaks to you – reflects your truth and your life back at you, makes you think about who you are. Those perennial truths – love, friendship, family, the pressure of the outside world – are what keep people coming back to books written centuries ago. Books make you think in a way very few other forms of media do. I think that’s the reason why we’ll never stop reading.",
                "What’s your vision for the Festival’s future?At the moment, I can’t see past Saturday 27 October and making sure this year’s festival runs smoothly! Next year… I think that’s something we’ll start to think about in December. Probably over a glass of wine at Clair’s flat. But we hope that as long as people are interested, we’ll keep putting the festival on. How it looks in 2019 and beyond… we’ll have to wait and see!",
                "For more information about the Croydon Literary Festival (taking place on Saturday 27th October) or to book your tickets,click here."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…illustration",
            "postTimeDate": "October 6, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. This month we spoke to Croydon artist,Anthony Walker, to learn more about the world of illustration.",
                "Like many creatives, Anthony hasn’t had the most obvious route into the industry. Although he had a clear talent for art, he became disillusioned at school, fell into the wrong crowd and ended up in prison at 17. Despite using art both as therapy and for financial gain (he would sell his portraits to cellmates for snacks and tobacco!) he didn’t continue with it when he left. On release, he got himself sorted with a job and a new place to live but it was only a few years later, when a friend found him doodling at work, that he began thinking about art again.",
                "Boosted by his friend’s comments, he set up an Instagram account to showcase his work, and began contacting social media influencers to ask to draw their portraits. His precision and attention to detail secured him a large and loyal following and allowed him to do art full time. This month he has collaborated withYour Shores, the online platform that works with artists to create limited edition leather jackets showcasing original designs.",
                "We caught up with Anthony to chat more about his work…",
                "When did you first realise you had a talent for illustration?I first realised at a young age, probably about 5 when my teachers at school saw some of my work that I brought in from home, and they were amazed. They started entering me in small school art competitions with the older year kids. I remember it was a nice feeling being good at something not many others where good at, but I never really thought about it anymore than that as it was just a hobby and I was just a kid.",
                "What made you want to specialise in portraits?From a very young age I focused on still life drawing such as plants vases and anything else I could see around me but no matter how confident I got doing that, whenever I tried drawing faces I really struggled. It didn’t help the fact that I am perfectionist. So I made it my goal to learn to draw faces as I saw it as the pinnacle of art due to the difficulty of it. So over the next few years I drew face after face learning through trial and error.",
                "What does a typical working day look like?A typical day for me is I wake up about 9am, make breakfast while contemplating my day ahead and prioritising my workload. After breakfast ill usually go to the gym which is only a 2min walk so I have no excuses. After gym I come back and make a start or carry on with my next piece in line. I will draw usually a min of 10hours but this can vary depending on how inspired I feel that day. If its a particularly bad day and I am really not in the mood, I find a look through instagram at all the other amazing art work on there can sometimes be enough to get the creative juices flowing again.",
                "How do you decide who to draw (personal choice versus commissions)?When it comes to commissioned work I recommend people send me a high resolution digital image so I am able to zoom in without distortion. This helps me pick out all the fine detail in an image. Other than that I leave it to the client to pick the photo they want as they usually know what they are looking for.",
                "When It comes to personal choice drawings this is a whole other thing as I pick images that spark that inspiration in me. It’s usually high contrast photos as good shadows really help bring a drawing to life. I love drawing or painting things of my choice as that’s when I enjoy myself the most and I am in my element, hence why I’m loving working with Your Shores as they give full control and freedom when painting the jackets.",
                "How long does it take to draw a portrait?It’s hard to say really as it depends on the detail, size, amount of faces etc but usually a A3 sized drawing with good detail can take about 20 plus hours from start to finish.",
                "Who (dead or alive) would you most like to draw and why?I would have to say the great Albert Einstein, other than my love of art I have a huge interest in science but I doubt much work would get done as I would have so many questions to ask. Haha!",
                "How did art help you in prison?For a few years before going to jail I had never imagined making money from drawing it was just a hobby of mine, especially because social media wasn’t around like it is now so I had given up on it due to my teenage social life which was spiralling out of control. Due to the life I was living and moving with the wrong crowed I ended up in jail for robbery at 17.",
                "While I was in there I picked up a pencil and paper again and started drawing from some photos I had and my sell mate saw and was impressed so he told everyone on the wing so before I knew it I had other inmates coming to me asking for personal drawings in exchange for tobacco, snacks and drinks from the canteen orders. I got a good reputation and a lot of respect in jail for being the top artist.",
                "I moved around a few times from HMP Highdown to HMP Feltham then finally on HMP Rochester where I joined an art class. During my time in the art class I painted a couple murals on the walls in the corridors and was introduced to tortillions which is an instrument used for smudging graphite or charcoal on paper. It’s essentially a piece of cardboard twisted very tightly into a point. This dramatically changed the way I draw as previously I used my fingers but with the small point of the tortillion I had much better control over the finer detail and was able to create much smoother blends which made my drawings a lot more life-like.",
                "So drawing definitely helped me through jail in many ways.",
                "How did you decide what to create for the Your Shores collaboration?This was easy as I just went for what I love, and that’s tattoos. I have quite a lot of tattoos that cover my arms and chest and the odd ones on my back and neck, so I got my inspiration from my own tattoos really as I have a blue rose on the front of each shoulder and a skull in the centre of my chest so I combined both images in my own style.",
                "What do you think of the creative scene in Croydon?I am constantly impressed by the amount of creative talent in Croydon from the likes of Krept and Konan, Stormzy, Adel, AJ Tracey and so much more – it’s inspiring. This is definitely the era for creative minds in Croydon.",
                "What are your plans for the future?Well I hope to build an even stronger relationship with the team at Your Shores to see where this journey takes us as it’s been very exciting so far. Also I am starting to transition more over to large scale paintings which I will hopefully be starting my first collection soon. These will be for sale online and from selected art sellers.",
                "Click Hereto watch a video of Anthony created a piece of wearable art forYour Shores.Click Hereto learn more about his journeyClick Hereto follow Anthony on Instagram"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2018/10/img_0929.jpg?w=300&h=200",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2018/10/img_0942.jpg?w=300&h=200",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2018/10/img_0946.jpg?w=300&h=200",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2018/10/img_0947.jpg?w=300&h=200"
            ]
        },
        {
            "Title": "East Croydon Cool Talks…Performance Art and Noise",
            "postTimeDate": "July 16, 2018",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. This month we spoke toHelen Burrough, a performance artist and Associate Produce ofTempting Failureto learn more about the world of performance art and noise.",
                "Tempting Failure is London’s Biennial of International Performance Art and Noise that showcases under-represented artwork that may interrogate risk or challenge preconceptions.",
                "Founded in 2011 by Croydon local,Thomas John Bacon, the festival was initially put together as part of his PhD at University of Bristol to examine specific phenomenological concerns around body art. It subsequently expanded to become an annual event and arts organisation.",
                "Using local artists, alongside national and international practices, Tempting Failure never hides behind obtuse overly academic contexts. Artwork, whilst certainly intellectual, remains accessible and open to all.",
                "Held in Croydon, the 2018 Tempting Failure festival offers a showcase of over 70 artists representing 20 different countries, each responding to the provocation of fractured bodies. The multitude of events, performances, talks and more take place from 9th to 22nd July in a host of venues including Matthews Yard, The Front Room, Turf Projects, The Spread Eagle Theatre, Braithwaite Hall, David Lean Cinema and the Croydon Council Chamber.",
                "What is performance art and how does it differ to theatre/immersive theatre?My preferred explanation of the difference between performance art and theatre comes from problematic fave, Marina Ambramovic; “Theatre is fake… The knife is not real, the blood is not real, and the emotions are not real. Performance is just the opposite: the knife is real, the blood is real, and the emotions are real.” Performance art can be beautiful, gentle, intimate or shocking, disturbing and transgressive, the real joy is that you’re there in the moment of creation and something real and vulnerable is shared between artist and audience.",
                "What is sound/noise art?To some people it’s probably a very specific genre that I’m about to trample all over, but at TF we’re looking for live sound work that experiments with the form and blows apart what music ‘should’ sound like. It can be gentle ambient soundscapes that calm and envelope you, or harsh screaming feedback that fills a room (and blows the amps) We’re just interested in doing the unexpected with sound, and ways of combining it with exciting live moments. No guys standing behind laptops, please!",
                "How did you get into the performance art world?I was pretty involved in the body modification scene, experimenting with the more ritual side of things like suspensions and flesh hooks and this led to a fascination in artists that worked with their bodies like Franko B and Stelarc. I just said yes to every opportunity to get closer to this world that came my way, learned a lot about what my body can do, collaborated with others, performed in clubs and eventually felt ready to begin creating my own work. I performed at the first TF in 2012, which eventually led to me joining the team and becoming a producer.",
                "How important is a formal education for people working in this discipline?I’m probably unusual in that I have no formal education in this or any other artistic discipline, but that doesn’t mean I don’t think it can be helpful. I do truly think performance art can be for anyone – you just need an openness to witness new things and letting them move you. One thing that drew me to TF when it started was that it took performance art out of an overly academic context, one that I’d often found alienating, and made it way more accessible. The only things I think I’ve really missed out on by not coming through a more traditional route is the time and space for experimentation that comes from being a student, and the feedback from peers and tutors that can really strengthen your practice.",
                "What was the motivation for starting up Tempting Failure?Thomas started Tempting Failure for many artistic, academic and personal reasons, but I think the thing that’s kept us working on this so hard for so long is the need to make a space for the kind of work we make and we want to see in the world. TF is, at its heart, a place that embraces artists that have been told they’re too loud, too risky, too extreme – or just too different. We want to embrace the underground and support artists in making the things that other people won’t allow.",
                "What is the concept behind Tempting Failure?We get asked a lot of questions about our choice to embrace failure in the festival name, and really all it means is that we want to see the results of your exploration and experimentation. We want you to push yourselves, try something new, and find out what happens when things don’t go to plan. And this all applies just as much to our audiences as it does the artists we programme.",
                "As a producer, does your job involve day to day?Lots and lots of coffee and emails. At this point, 1 week before the festival, I’m handling lots of emails from artists who are arriving in London from across the world and want to know what to expect when they reach Croydon. I’m planning our first ever closing party, so emailing DJs and venues and trying to come up with a great name. I’m talking about tech and risk assessments and writing out a very strange shopping list. All whilst fielding an endless stream of phone calls and WhatsApps. During the festival my role shifts slightly away from this kind of admin and focusses more on making sure we support our programmed artists to do the best possible version of their work, seeing as many performances as I physically can and demonstrating, loudly and enthusiastically, that although performance art and noise and failure and everything might sound a bit intense and intimidating, TF is a caring, supportive and fun family to be involved with.",
                "What contribution does performance art offer to society as a whole?I think my answer to this question would depend on how optimistic I’m feeling about the world. Unfortunately for the past year, things have felt pre-apocalyptic, and whilst I love the fiction I’m not sure I actually want to live in a dystopia. That said, our provocation or theme for TF18 is Fractured Bodies and a part of that is finding hope in these desperate times. I’m obsessed with the idea of things reborn from crisis, things broken down and reformed into something new. Scar tissue and kintsukuroi. So maybe if we all come together and acknowledge our fragility and talk about the places where we, as bodies, individuals and societies, are broken, we can start to find ways to survive and repair the ruptures all around us. Maybe performance art makes space for the personal, intimate connections, the visceral real moments, that our digital lives, digital bubbles and divisive rhetoric don’t allow us. I’m too cynical to think that any art can change the world, but it can start conversations and it can make people feel less alone and it can give us beautiful shared moments full of meaning.",
                "For more information on Tempting Failure or to book a ticketclick here."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…RISEfestival",
            "postTimeDate": "August 24, 2018",
            "Text": [
                "It’s no secret that interest in ‘Urban Art’ has grown exponentially in recent years.",
                "Describing a style of art that relates to cities and which is often done by artists who have a passion for city life, it encompasses both graffiti and street art as well other visual art found in urban areas, often inspired by the architecture.",
                "Whilst the art form may have started at a neighbourhood level, it is now an international movement, with many artists travelling from city to city working in collaboration with contacts from across the world.",
                "Urban art is now (for the most part!) well respected and embraced by the traditional art world. In many senses, it has come full circle. By taking art to the streets, artists liberated it from the confinement of gallery walls and subsequently transformed the public’s understanding of where and how to view art. However, the surge in interest and popularity this created means many urban artists now show their work in formal gallery spaces and create work that can be sold for vast amounts.",
                "Here in the UK, East London has long been considered a mecca for urban artists and fans, with Brick Lane and the surrounding areas covered in large scale murals. In Waterloo,Leake Streethas offered a legal wall for artists of all levels to practice and showcase their skills.",
                "But over the past few years, our borough has been making a name for itself as the new destination for urban art. Set up in 2014, in the wake of the London riots and during a period of economic decline in Croydon,RISEgallery, has been the catalyst for the borough’s growing urban art scene.",
                "Specialising in contemporary, urban contemporary and post war-pop art, it is far more than just an art gallery and plays a key role in London’s creative and cultural landscape. RISEgallery is committed to pioneering projects in which art plays a pivotal role; ultimately helping to create positive changes that benefit the community. The gallery delivers a diverse range of programmes including public realm art projects, workshops, talks and tours.",
                "Their latest project isRISEfestival, set to be London’s largest International Urban Art Festival. Taking place from 5thto 15thSeptember, the festival will see the arrival of 60 new murals and installations by artists from around the world. The festival will also include a ground-breaking programme offering over 30 free events for the public to enjoy.",
                "We caught up with Kevin Zuchowski-Morrison, Founder and Owner of RISEgallery to learn more about the event.",
                "How has Croydon become such a popular destination for urban art?Without wanting to take too much credit, because it really has been a huge team effort with so many people involved, I believe RISEgallery has played a huge role. We set up the Arts Quarter a few years ago as a Public Realm project to bring art to people who might not typically engage with it. By gaining permission from landowners and businesses across the town centre, we were able to offer walls to artists which they could utilise to showcase their work in the streets of Croydon. The project has gone from strength to strength and we now have over 60 spaces across the borough. The public have responded so well to the art, that many pieces, such as those by David Hollier, Lauren Baker and Otto Schade have become permanent. From September onwards, the universal new title for all permanent murals and artworks in the borough will be the ‘Croydon Collection’. Giving this growing assortment its own identity, will enable it to continue to grow and be protected for the future.",
                "How did the idea for RISEfestival come about?Having worked with both local and international artists on smaller projects across the borough over the past four years, I’ve been keen to find a project to bring them all together for a while now. Last year, we ranWarhol Croydon, a hugely successful month long programme of events that paid tribute to the life and work of Andy Warhol. Off the back of that success, and with Croydon’s £5.25 billion regeneration programme continuing to provide significant investment and interest in the area, we felt now was the perfect time to step up our game and take things to the next level.",
                "Which artists will be taking part?Over 75 artists from across the world are taking part including some huge names like Dotmaster, Conor Harrington, BK Foxx, Doudou’Style, Phlegm, Lovepusher and Cityzen Kane.",
                "Dotmasteris a UK artist who started painting on the streets of Brighton in the early ’90s. He takes a sideways look at a populist media with a typically English sense of humour. His work is impeccably detailed; his half-tone, stark black and white street pieces and unique, photo-real colour stencils all create street-based illusions that fool the eye. Then you have the likes ofConor Harrington, an Irish painter living and working in London. As a former graffiti artist, his work draws a fine line between classical and contemporary art. Still a fan of painting huge murals, he utilizes realistic images of people in his pieces, incorporating abstract elements to accompany his painted subjects. Joining us from across the pond isBK Foxx, a New York-based artist who likes to create large-scale murals, working freehand with spray paint. As a passionate animal enthusiast, she focuses on social awareness of animals and often depicts them in her murals, which are largely found around New York City.",
                "We are releasing details of other artists every day onsocial media, so keep your eyes peeled!",
                "What type of events can the public take part in?The events programme is the real highlight of the festival, as this is all about encouraging the public to take part. It’s truly touching to think that for some people, this may be the first time they have connected with art in anyway.",
                "TheOfficial Urban Art Tourswill give people the opportunity to be guided through the town to look at the new pieces of festival art as well as some permanent pieces from the Croydon Collection.  TheGraffiti Workshopswill enable guests to learn about the different styles of graffiti and the techniques used to create them before being given the opportunity to take to the streets and create their own masterpieces.  TheGlobal RISE of Urban Artevent will see artists, curators and other super interesting folk, come together for an afternoon of panel discussions and a Q&A.",
                "Tickets are free and will be released on Tuesday 28th so keep an eye on the websitehere!",
                "How are you making sure it’s open to all?From kids to pensioners, it is a privilege to think that RISEfestival will offer so many inspiring and exciting experiences that will allow all members of the community to engage.",
                "A series of activities designed for children are being led by child art vlogger, Amaya (aka my daughter!)Amaya LIVEis a mini art conference for children, where they will learn more about the urban art world from big name artists. Having buffed up their art skills, children can also take part in a Kid’s Graffiti Workshop led by a local street artist or go on a Kid’s Street Art Tour around Croydon.",
                "For older visitors, we have theGraffiti Granniesworkshop which will teach the over 60’s all they need to know to start a new career in street art! Workshops will consist of a quick history lesson about graffiti and some practice on paper before heading to the streets to showcase their new skills.",
                "We hear there’s a few big parties too, tell us more!There certainly are! The largest event will be a hugeBlock Partyon Saturday 8th. Run in partnership with FUNK ME parties, this evening event will see the closure of St Georges Walk as international DJs take over the block with a party that people will be talking about for years! Pioneering Croydon’s underground house music scene since 2002, FUNK ME has organised and hosted some of the best parties in London with legendary DJs such as Brandon Block and Grant Nelson so we’re excited to be working with the experts!",
                "Anything else we should know about the festival?We are also going to be launching a pop up shop during the festival which will run until the 25thSeptember. In my best marketing language….the ‘Concrete Boutique’ will be more than a pop up art store, it will be an experience! However, as we’ve totally blown our budget on the Festival, the experience you’ll encounter will be ‘stripped back’ ‘raw’ and ‘truly unpretentious’. The phrase we are using for curation is ‘purposely organic’. Which directly translates as ‘we have no idea what is coming in until the day of opening’. What we do know is that we’ll be selling truly affordable art and gifts (from £10 to £500) from an array of talented artists. It may look like utterly bonkers or work like a dream…so come check it out and let us know!",
                "Why do you think urban art has gained such popularity around the world?That’s a pretty big topic, and I’d recommend joining our panel discussion on Sunday 9thwhere we’ll be debating this in full! There are a number of factors, but there’s no doubt that the internet has played a massive role. From social media making it easier for both artists and fans to share photos of work to websites dramatically altering the traditional route to market for artists, it has also given artists the ability to take control of their work.",
                "Who is your favourite urban artist?That is a very controversial question to ask an art gallery owner / urban art festival founder! I have huge respect for so many artists on the scene today but to keep myself out of hot water, I will refer only to those who have passed! I’ve always been a big fan of Keith Haring, a New York based artist who grew to prominence in the 80s. I really like his distinct pop-graffiti aesthetic and how he used this to explore exploitation, drug abuse, and rising fears of nuclear holocaust, which became increasingly apocalyptic after his AIDS diagnosis.",
                "What’s next for RISEgallery?We’ve always got a fair few projects on the go! Our next exhibition is with Dotmaster, our headline artist for RISEfestival and we’re also working on building our presence in Lebanon and Washington DC ahead of launching sister galleries in both cities. There’s plenty of other stuff, but I’ll have to keep that under wraps for now… 😉",
                "For more information onRISEfestival, click here."
            ],
            "Media": []
        }
    ]
}