{
    "site_url": "https://eastcroydoncool.co.uk/",
    "site_title": "EAST CROYDON COOL",
    "site_description": "A Curated Guide to all things Cool in The Cronx",
    "AllContent": [
        {
            "Title": "Newsflash: The #CronxBoutique announces Cronxmas Crafting sessions",
            "postTimeDate": "November 11, 2019",
            "Text": [
                "Last week it was announced that December will see the launch of the Cronx Boutique’s first Christmas Pop-Up.",
                "The Cronx Boutique is a collaboration of three local brands, all passionate about Croydon. The Croydon Photographer, East Croydon Cool and IvyRose London all create community-inspired artwork and merchandise to enhance local pride.",
                "The stylish new space on Caithness Walk (located at the Ruskin Square exit of East Croydon Station) will offer Croydoners an alternative festive shopping experience alongside a series of small craft events run by Art Club Croydon.",
                "These sociable Thursday night sessions will bring Croydoners together to offer a moment of creative calm amongst the festive chaos!",
                "The 6pm to 7pm sessions are focused on creating a series of Cronx inspired gift tags and tree decorations while the 7.30pm to 8.30pm slots will see participants design their own range of ‘Cronxmas Cards’.",
                "Sessions are limited to 8 people and include all materials.",
                "To book your ticket to Cronxmas Crafting (Gift Tags)CLICK HERETo book your ticket to Cronxmas Crafting (Cards)CLICK HERE"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Interior Design",
            "postTimeDate": "December 18, 2019",
            "Text": [
                "Since opening the#CronxBoutiquewith theCroydon PhotographerandIvyRose London, we’ve had a lot of questions (and admiring glances!) about the interior styling of the space. We (sadly!) can’t take the credit for this, as the vision was very much led by local Art Director and Creative Stylist,Laura Sawyer. (*although, we did put in a fair amount of muscle power bringing the vision to life!)",
                "Fresh off the cover of one ofIreland’s biggest interior design magazines(!), we caught up with Laura, to get her to talk through the various tips and tricks she used to transform a shipping container into the #CronxBoutique.",
                "1. SurprisesDid you notice any little hidden gems dotted around the #CronxBoutique? This little bunny paste up is just one of the little surprises hidden on the walls. Surprise details are a great way to add depth to your space – they add intrigue to those who spot them, and also help frame spaces or finish them off. Next time you’re in, see if you can spot the other treats we’ve hidden…",
                "2. Crittal trendCrittal is a material used to make black window frames and is very much on trend at the moment. In the #CronxBoutique container, there was a very boring white framed office window with odd frosted dots on the glass. We covered the whole frame in matt black vinyl and added horizontal lines on the glass to cover the dots and create this awesome feature wall. It highlights the Club Room brilliantly.",
                "3. PropsAdd props to your space to add character and depth. However, be careful that the props don’t compete with the product you’re actually trying to sell, but rather highlight it. At the #CronxBoutique we added vintage props that compliment the artists work. Such as vintage cameras and this typewriter (which has been a HUGE hit with younger customers!)",
                "4. LightingLighting is arguably the most important element in any design. We were lucky to have good directional lighting in the container, but multi-level and decorative lighting is what gives the space real warmth and entices people into a shop. We added this neon heart, a wall light, Christmas fairy lights and a table lamp to achieve this. If you don’t already have more than one light source in your room, get sourcing!",
                "5. Paste up wallOn the other side of our newly created crittal wall was a very dull office room which needed to have the personality to inspire creativity at our@artclubcroydonevents. So we added this paste up wall, with artwork from IvyRose London. Highlighting one of our designers as well as adding a unique feature wall; this was a great and low cost way to add colour and creativity. Top Tip: size the wall first then paste with wallpaper paste!",
                "6. HeightAdd height to a table to draw the eye. It isn’t an interesting experience for the eye if everything is on the same level. These box shelves work on the table top, as well as on the wall (as plinths) to make the mugs feel precious.",
                "7. BrandingOne of the most important parts of your design. Be proud. Let people know who you are. That doesn’t have to be a huge sign like we went for, it could be something more chic and subtle, but make sure you make a feature of it. The table light draws the eye and of course it’s the first thing you see when you walk in. Bam!",
                "8. FurnitureIncorporate your furniture into your wall display. You can see that we built the gallery wall around the rail, which not only makes it cohesive, but it also makes the t-shirts feel like part of the display; it heros the products.",
                "9. Don’t ClutterHow to create a concept store 101; make the products feel precious. Don’t stack them to the rafters. Let visitors fall in love with the feel of the space and want to live in it. They will inevitably buy a little something to take home and try to recreate the feeling. It can be as simple as opening a magazine and using it as a back drop for your product. Here@miumiudoes all the work for us…",
                "10. Instagrammable MomentsWhen showcasing different products it’s important to think how you can bring them all together. Here we have prints, mugs and Christmas cards with occasional lighting to draw the eye. The lamp is from@madedotcomthe box shelf from@hmhomeand the picture shelf from@ikeaand of course a little touch of vintage and foliage. Vignettes like this create “Instagrammable moments” for people to capture and share on their social channels (thereby promoting your business!)",
                "For more information about Laura, the styling services she offers and her location house in South Croydon, check outwww.laura-sawyer.com."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/suprose.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/crittal-1.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/props.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/lighting.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/paste-up.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/707920bf-29a9-4913-a264-e1150428c04b.jpg?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/bf4f31b4-0824-4a9f-aa5b-5dd985ca801e.jpg?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/629bcb4b-d88d-40b5-97ed-6c5f0e6422ed.jpg?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/e3575fa8-f380-4b5f-ace7-3b070dda558b.jpg?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/641c5d9d-bb09-4240-83f8-893ea54eb54c.jpg?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/cover.jpg?w=244&h=346"
            ]
        },
        {
            "Title": "East Croydon Cool talks…Windrush",
            "postTimeDate": "September 19, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up withJim Grover, the award-winning social documentary photographer who is behind ‘Windrush: Portrait of a Generation’, the exhibition that will be on show atFairfield Hallsfrom 19th September to January 2020. The stunning photo-story, which received widespread acclaim when it was first exhibited for a limited time at the Oxo Gallery on the South Bank last year, documents the lives and traditions of the ‘Windrushers’ who settled in South London.",
                "How did the idea for Windrush: Portrait of a Generation come about?My passion as a photographer is to tell stories…about people and everyday lives in my local community, here in south London.  I am always on the look out for potential stories, particularly stories that haven’t been told before.  So when I heard about a dominoes club for West Indians in Clapham, which I had no idea existed even though I have lived here for 30 years, I just had to go along.  As I got to know this wonderful community I realised that there was a much bigger story to be told…about the very distinctive lives, traditions, and culture of the first generation Caribbean migrants who came here in the 1950s and 60s.  And it seemed a wonderful story to tell as part of celebrating the 70th anniversary of the arrival of SS Windrush in June 1948.",
                "The exhibition focuses on South Londoners, are any Croydoners included in that?Not directly.  But the exhibition is all about how the Caribbean community live their lives in South London and Croydon has a very large Caribbean community,  The last census shows that, after Birmingham, Croydon is the borough with the largest Caribbean community in this country, and almost 9% of the Croydon population are of Caribbean heritage.  So at another level, this is all about Croydon!",
                "How much time did you spend getting to know your subjects before you shot them?I photographed this project over 11 months.  In a project of this type one needs to spend time getting to know people, listening to them, and earning their trust.  This community is so warm-hearted and kind; once they understood what I was seeking to do…to tell and celebrate their stories, which they have so much to be proud of…then doors kept opening.",
                "What was the most memorable moment of the project?There are so so many; it’s been such a joy working on this project, full of unexpected discoveries.  But if I had to choose just one, it would be spending a Friday evening in the company of four generations of a lovely Jamaican family in a Brixton home as part their ‘Open House’, a tradition whereby Caribbean families regularly come together to share a meal, chat, and to just catch up as a family…sometimes on a weekly basis.  It’s very beautiful and moving to see a family be ‘as one’ in this way.",
                "Have you kept in touch with any of the people you photographed?Yes, just about all of them.  And I am going along to that Clapham dominoes club this evening!",
                "What were the biggest differences you noticed between the Windrush generation and their younger counterparts?For the first generation Caribbean migrants traditions like dominoes, nine night, ‘the mother country’, going to church every Sunday, ‘rice and peas’, ‘pardner’, are rooted in many of their lives, it’s their culture and what they have grown up with.  For the subsequent generations these traditions are, unsurprisingly, less prevalent.  As I immersed myself in this project I realised that I was documenting living history; some of these distinctive Caribbean ways of life are likely to weaken, and even disappear with time.  The second and third generations, for example, don’t typically see dominoes as part of their lives in the way that their fathers or grandfathers do and some of the dominoes clubs have already disappeared.",
                "How did the collaboration with Fairfield Halls come about?Neil Chandler, the artistic and venue director of the fabulous newly-refurbished Fairfield Halls, happened to come along to the exhibition when it was launched last year on London’s south bank…and it all went from there. Its been a pleasure working with Neil and his team on bringing the exhibition to Croydon.",
                "What do you hope visitors will take away from the exhibition?For the large Caribbean community in Croydon, I’d love them to come along and feel huge pride for what they have brought and given to this country.  This is their story…and it’s a wonderful story…a story to celebrate. And I’d love everyone who visits to be engaged and moved by the traditions and stories of this remarkable generation.",
                "What are your next plans?I currently have three or four ideas for new photo-stories, so watch this space!",
                "What else can people find at the exhibition?A feature of my story-telling is that I like to blend imagery with stories.  So as part of this project I recorded the stories of 12 of this community.  You can read these inspiring stories at the exhibition. And also, the wonderful Alford Gardner, who is 93 years old and one of the first ‘Windrushers’ to have travelled across on the Empire Windrush in 1948, will be at Fairfield Hall meeting and greeting visitors coming to see the exhibition on the 26th October. He is also featured in this photo-essay. All are welcome to come on down and meet him in person!",
                "How can people find out more?Visit the website…www.windrushportraitofageneration.com…where you can also buy the book that contain the complete exhibition if you can’t make it to the Halls.",
                "Windrush: Portrait of a Generation is on display at Fairfield Halls from 19th September until January 2020. For more information,CLICK HERE."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Ecommerce",
            "postTimeDate": "May 4, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with Ronan Kelly who alongside his Croydon based business partners runsToyshades; a British eyewear brand specialising in selling affordable, design-led sunglasses online.",
                "How did the idea for Toyshades come about?British Sunglasses might sound like the dumbest idea you ever heard, given our British climate.  But, some of the best inventions started out as crazy ideas! Toyshades British Sunglasses are an alternative and affordable brand. We offer high quality sunglasses at an amazing price point. Nobody is offering a product as good as ours at a price point anywhere close to ours.",
                "How much experience did you have in ecommerce/online selling?We are just three mates running Toyshades; an Englishman, An Irishman and a Nigerian. That might sound like the start of a bad joke, but we think we know what we’re doing. The three of us came from diverse backgrounds and each bring different skills. My wife (who was born in Croydon) is a maths teacher…so she is the brains of the operation.",
                "What was the first step in setting up?From the start we wanted to show that despite our affordable price point, our products are of the highest quality. Our sunglasses come with our own, trademarked PENTOPTIC® lenses. Made with five layers of polycarbonate, our lenses are as good as you’ll find in the more expensive brands. As soon as the UK government granted us our PENTOPTIC® trademark, we were ready to go.",
                "How did you go about building your brand story?We really want Toyshades Brand to have a South London feel. Nowhere has a better community spirit than Croydon. We want Toyshades to reflect some of that spirit. Some of our images are shot on location in and around Croydon and we’re always proud to tag the location as Croydon, Sarf London or The Cronx.Toyshades does it’s best to reflect and celebrate London’s diversity. We try not to use professional models. Our models are real members of our community , we want real people with real lives and real achievements. We also work with the community as much as possible; for example, we recently partnered with Croydon Harriers by providing Toyshades as prizes for the Croydon 10k.",
                "How do you physically sell and ship the products?Shopping at Toyshades.com is very simple, safe and secure. We use a Shopify template for our ecommerce platform. It’s actually really easy to individualise the template and adapt it to your specific needs. For payments we use Shopify’s own encrypted payment systems – which are fully integrated with the Shopify template. Whenever technical issues get too tough for us, we call on a small firm of consultants in Brighton. Like us, Innervaters are a small business. So they really understand our needs.",
                "What other tools and apps do you use to run your store?I am only going to list a couple because they are vital to a business like ours. First, an app that links social media to our webstore. There are a few of them to choose from, but the main one is the Instafeedapp, which creates a link from Instagram to your store and keep images fresh on the homepage. The other useful one we use is Mailchimp for Shopify. A great way of integrating your website and your mailing list.",
                "What’s been the biggest challenge so far?Getting exposure for your brand is really the toughest part. Expanding – not just our social media footprint, but also our day to day engagement with followers – has been key to our growth.",
                "What’s the best thing about having your own ecommerce business?The best thing is that we can decide our own direction. Our own branding and our own imagery. There are no shareholders or committees to answer to. It’s just us.",
                "Would you like to have a bricks and mortar store?We used to sell in TopShop on Oxford Circus and some other high profile retailers. However, with the retailer’s margin, it was impossible to deliver such good value to our customers. By cutting out the retailer and running our own supply chain, we are able to deliver our sunglasses at a great price.",
                "How important has influencer marketing been for your business?We are all bombarded with “influencers”. Most of whom are just giving positive feedback in return for cash! The public are not stupid and are beginning to see through this sham. I think the next 12 to 18 months will see a backlash against this sort of “paid influencing”. The important thing for brands like us is to find influencers and ambassadors who gel with the brand. People who feel the brand and not just someone who will sell their opinion to the highest bidder.We have been very lucky to find our current ambassadors.Maddy Smithis a world class winter athlete. She not only wears Toyshades while representing our country at Skeleton, she also gives us invaluable insight when she tests our new products. Toyshades look great, but that’s not enough for us. We want Toyshades to perform well in the absolute harshest of environments. Maddy takes Toyshades to some of the world’s toughest winter sports destinations and pushes our products to their limits. Likewise, our relationship with the South London Punk band Katalina Kicks is very important. British punk is back andKatalina Kicksare at the forefront of that revival. The fact they’re bringing Toyshades to the centre of the UK new music scene is a great honour for us.",
                "Who inspires you in the world of business?Theme park owners are a bit out of fashion these days, however, I am inspired by Roland Mack. Ignoring expert advice, he opened a rollercoaster park in his home town in Germany, many miles from any real tourist infrastructure. Mr Mack’sEuropa Parkis now the biggest theme park in Europe, second only to Disneyland Paris in terms of visitors. All from a crazy idea. A bit like the crazy idea that is British sunglasses!",
                "For more information about Toyshades seewww.toyshades.com.East Croydon Cool followers get a 20% discount off all shades when usingCROYDON20on check out."
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: The ‘Cronx Boutique’ to open their first Christmas Pop-Up and provide an alternative festive shopping experience for Croydoners",
            "postTimeDate": "October 29, 2019",
            "Text": [
                "This December will see the launch of the Cronx Boutique’s first Christmas Pop-Up. This stylish new space will offer Croydoners an alternative festive shopping experience which will include a series of small craft events.",
                "TheCronx Boutiqueis a collaboration of three local brands, all passionate about Croydon. TheCroydon Photographer,East Croydon CoolandIvyRose Londonall create community-inspired artwork and merchandise to enhance local pride.",
                "Having previously collaborated together atMade in Croydonmarkets atBoxpark, December 2019 will see the Cronx Boutique open their very own store on Caithness Walk (located at the Ruskin Square exit of East Croydon Station).",
                "The Cronx Boutique will be the perfect place to buy Christmas gifts for Croydon based colleagues and clients or for friends and family who live in the Borough. With items priced from just £3, it will be the ideal spot for picking up stocking fillers and Secret Santa gifts. Framed artwork and clothing will also be available for those looking for larger presents.",
                "TheCroydon Photographer(akaGlenn Foster Photography) will be selling framed and unframed signed giclée prints from his Croydon architecture collection and screen-print style giclées from his ‘Iconic Croydon’ series. He will also be stocking a range of Christmas cards and coasters featuring his recently released Croydon skull designs.",
                "East Croydon Coolmerchandise will include their range ofmugsand magnets featuring tongue-in-cheek statements such as ‘New York, Paris, Milan, Croydon’ and ‘Croydon is Always a Good Idea’.",
                "IvyRose Londonwill be selling theirethical streetwearincluding their much loved ‘Cronx Life’, ‘Cronx Gal’ and ‘Pouvoir des Filles’(Girl Power) tees alongside their prints, tote bags and newly launched canvas pouches and ‘Fight Like a Woman’ tee.",
                "With interior design direction from local Style Consultant,Laura Sawyer, the Cronx Boutique will not be your typical Christmas pop-up! Taking influence from Croydon’s brutalist architecture, the Cronx Boutique will celebrate ‘Minimalist Industrial Chic’ as a welcome relief from over-decorated high street shops.",
                "In addition to selling gifts, the Cronx Boutique will be partnering withArt Club Croydonto hold a number of small craft events that will bring local residents together over the holiday period. These one hour festive sessions will focus on creating personalised gift tags, wrapping and cards.",
                "Further Info:",
                "Following a private view on Tuesday 3rdDecember, the Cronx Boutique will run from Wednesday 4thto Tuesday 24thDecember as follows:Tuesdays, Wednesdays, Thursdays and Fridays: 12pm to 9pmSaturdays and Sundays: 11am to 4pm*Christmas Eve will close at 2pmCraft Workshops will run every Thursday evening",
                "Please note, the Cronx Boutique operates a CARD ONLY payment system.For more information about the Cronx Boutique, check out the Instagram hashtag:#CronxBoutique",
                "About the Croydon PhotographerGlenn Foster is a born and bred Croydon boy. As a photographer, he has worked worldwide but has a strong passion for all things Croydon and has worked with many local businesses providing imagery for websites, brochures and adverts. Whilst he’s been a photographer for a long time, over the past couple of years he has begun to venture more into the art world. Watching Croydon change so visually over recent years has inspired him to construct Croydon based art. His knowledge and hands-on experience combined with progressive new editing techniques have enabled him to become more inventive with his designs.www.glenn-foster.squarespace.com",
                "About East Croydon CoolSet up in 2016 to show newcomers why Croydon and Cool belong together, the website, social media channels and social event programme help residents make the most of the range of bars, cafes, pubs, restaurants, galleries, shops and events the area has to offer while a merchandise line (including mugs and magnets) fosters a sense of local pride. Ultimately, East Croydon Cool encourages newcomers to become active and engaged local citizens to ensure the community continues to shine as bright as the new buildings do.www.eastcroydoncool.co.ukAboutIvyRose LondonFounded in 2017, IvyRose London designs ethical streetwear, accessories and art prints.Their Croydon-inspired range includes their ‘Cronx Life’ and ‘Cronx Gal’ tees, which are a celebration of the community spirit of long-term residents and newcomers who are working together to breathe new life into the area. The Cronx Life design is inspired by the Borough’s rich aviation history and uses sharp lines to represent the brutalist architecture. IvyRose London’s ‘Pouvoir des Filles’ (Girl Power) and ‘Fight Like a Woman’ tees were created to encourage women’s empowerment, independence and confidence.www.ivyrose.london",
                "About Laura SawyerCroydon resident, Laura Sawyer has over 18 year’s experience in the fashion, photographic and creative industries. Delivering beautiful and stylised creative direction, art direction and set design, Laura’s previous experience in fashion buying adds a commercial understanding to her inspiring creative vision. Previous clients have included; Google, Jimmy Choo, John Lewis and The Dorchester. Laura also ownsThe South Wing, a newly renovated Victorian apartment in Croydon that provides a versatile and on-trend back drop for fashion, interiors, still life and food photography shoots.www.laura-sawyer.com",
                "About Art Club CroydonArt Club started with a small group of friends wanting to initiate a creative space for themselves to work in. What began a few years ago in a front room as a get together one evening a month to produce art, inspire each other and critique each other’s work, soon grew. Art Club Croydon opened to the public in January 2019 and now holds regular art clubs as well as social get togethers.www.instagram.com/artclubcroydon",
                "About Croydon Urban EdgeCroydon Urban Edge is a dedicated Inward Investment service to help businesses to start, grow, locate, expand & invest in Croydon. Croydon Urban Edge supported the Cronx Boutique in finding and securing the Caithness Walk location for this festive pop-up.www.croydonurbanedge.com",
                "Photos from Cronx Boutique 2019"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/bf4f31b4-0824-4a9f-aa5b-5dd985ca801e.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/e3575fa8-f380-4b5f-ace7-3b070dda558b.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/707920bf-29a9-4913-a264-e1150428c04b.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/641c5d9d-bb09-4240-83f8-893ea54eb54c.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/629bcb4b-d88d-40b5-97ed-6c5f0e6422ed.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/suprose.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/props.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/paste-up.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/lighting.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/crittal-1.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/12/art-club.png?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/11/facebook-event-pic-e1581545763952.png?w=740"
            ]
        },
        {
            "Title": "East Croydon Cool talks…CGI",
            "postTimeDate": "August 9, 2019",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts.",
                "With the buzz of what is set to be this winter’s cinematic blockbuster (Cats the Movie) in the air, we were keen to learn more about this somewhat mystical art form!",
                "So this month we caught up with two Croydon residents (who are both freelance Motion Graphics designers) to learn more about the world of CGI (Computer Generated Imagery) and visual effects.",
                "Michael Dowdgrew up making short films with his brother and over the last ten years turned his passion into a career. Having worked as a runner at multiple post production companies, he now works for one of the top studios in London, producing content for corporate, TV and online sectors. More information on Michael’s personal work can be found on Instagram accountHERE.",
                "Howard Gardnerfounded his freelance business (Howard Gardner CG) in late 2014 and since then has been involved in a number of advertising projects, short films, music promos, corporate videos and one feature film. Working out of a Croydon garage, he also occasionally finds the time to direct short experimental films of his own. More information about Howard’s work can be found on his websiteHEREand his Instagram accountHERE.",
                "For this post, we’ve also teamed up withCroydon Digital– the voice of Croydon’s tech community. Croydon Digital is led by Neil Williams, who joined the council as its new Chief Digital Officer last autumn. Having previously worked for the GDS (Government Digital Service) with responsibility for the GOV.UK website, Neil returned to his home borough to take charge of the design and delivery of Croydon’s internal technology and digital services, and to continue to champion Croydon as a destination for tech business growth. Croydon Digital builds on the legacy left by Croydon Tech City (the organisation set up by Nigel Dias, Sarah Luxford and Jonny Rose that led the mission to turn Croydon into London’s Silicon Valley) since it ceased operating in March 2018.",
                "Neil says:“Croydon is a fast-growing tech cluster, welcoming digital start-ups and scale-ups into the borough as well as growing many of our own successful tech businesses right here, from our hot bed of digital talent. Part of my role is to shout that from the rooftops and help connect and strengthen our tech community. When I saw Michael and Howard’s respective work on Instagram, of cool CGI animations set against Croydon backdrops, I was keen to find out more and share it with Croydon Digital’s growing audience. I’ve also been keen to collaborate with East Croydon Cool and this seemed like a great opportunity!”",
                "We’ve shared numerous examples of both Michael and Howard’s work on our Instagram channel in the past, (which always get great engagement) so we caught up with them both to learn more about the Visual Effects world.",
                "CGI, visual effects, 3D graphics, motion graphics? That’s a lot of lingo for an already complicated subject; what’s the difference?!MICHAEL:I will try and give the least complicated answer I can! 3D graphics/animation are graphics made with a 3D software package such as Maya, Cinema 4D, Blender, or Houdini. These programs can make anything in 3 dimensions – think Toy Story. CGI is usually associated with 3D graphics, and big blockbuster films like The Avengers, but it more broadly refers to any imagery a computer produces, even something from Photoshop or Paint is considered CGI. Visual effects are where there is a mix between live action and CGI. Motion graphics are used more for multimedia projects. They are often animated abstract shapes, explainer videos, and logo animations – that type of stuff. My current job has elements of all of these things, but I usually call myself a 3D motion graphics designer, or a 3D generalist, or just … ‘I work with computers’.HOWARD:A complicated field will naturally grow its own terminology. The practices that you’ve mentioned are closely related to each other – and sometimes there’s even some overlap – but I’ll try and summarise:CGI (or computer generated imagery) is a pretty loose umbrella term, covering anything from designing products through to animated films like Shrek or Finding Nemo. It tends to be associated more with three dimensional visuals.3D graphics is kind of the same thing, albeit perhaps a bit more specific to stuff made with Blender, Maya, 3DS Max, rather than say Photoshop which is a flat image. It might also apply to game design and increasingly it might include virtual reality.Visual effects deals with the integration of 3D graphics with live action film. Often this is the most challenging area, as there is pressure for it to look convincing and seamless to an audience.Motion graphics tends to deal less with realism and more with slick, punchy visuals, often seen as titles, logos and other on-screen information. We’re surrounded by these this all the time in news programmes, advertising and other digital media.",
                "How did you get into the digital industry?MICHAEL:As a teenager in the early 2000s, I grew up making some absolutely horrendous comedy videos with my brother using my parents’ old video camera, after that I decided I needed some serious help. I studied media studies in college and then digital film at the SAE Institute in London. I began my first media role as a runner (mostly making teas and coffees) at a post production company in Soho. After making my 5000th coffee, I decided to go freelance. I did everything from filming bands at festivals to creating animated online videos. After three years, I then started at my current company, another post production studio in Soho. I put my coffee making skills to good use again, but worked my way up to become a motion graphics designer within three, somewhat painful years.HOWARD:I started out studying graphics and fine art, first here in Croydon at the BRIT School and later at the Colchester Institute where I took my degree. Technology changed rather rapidly during this time and I found myself drifting towards digital book illustration, which later led me towards animation with Adobe Flash. As Flash began to decline in use I took the decision to get re-trained in the use of visual effects software, which led me to enrol at Escape Studios and then go to my current role as a freelance VFX artist.",
                "What’s your favourite project you’ve worked on to date?MICHAEL:I did some very subtle visual effects for the TV show Made in Chelsea. They were being sponsored by a mobile phone company and had to include a certain number of shots that featured the phone in it in someway. They didn’t manage to film it in enough shots, so I had to digitally create a 3D phone and add it in to certain scenes. They wanted it sitting on desks and tables etc. but these shots were moving, so I had to do something called 3D tracking to match the filmed camera footage with my 3D program. It was a very bizarre job for me, but a rewarding one as no one noticed it was a fake phone and I suppose that was the aim.HOWARD:I relish any chance to be involved with any kind of film project which tells a story. I’ve had some of my best times working on science fiction and fantasy projects, but also some of my worst as the industry can be a bit of a minefield, especially to freelancers who are just starting out and easy to exploit. During quiet spells, over the course of about four years, I shot and edited my own science fiction film called Protein (yes, it’s set here in Croydon). I enjoyed working on that particularly because I got to design everything myself from the ground up!",
                "What do you think of Croydon’s digital landscape?MICHAEL:I have only lived in Croydon for three years, but I have seen many new opportunities through affordable tech coming through, such as the VR café,Limitless VR, and my friends health and safety / fire safety courses using VR,Certified Skills UK, a way of people interacting to certain scenarios but within the safety of an office room. It’s great that this kind of tech is being used not only as entertainment, but also as a practical tool that can be used in the workplace and its great it’s all coming from/to Croydon.HOWARD:I’m probably guilty of under-using it. One of my friends recently took me toTMRWand I was really impressed by what they have. I’ve dabbled a bit in 3D printing and I’d be interested in using some local services to get some objects manufactured based on my design work, but for now my main focus is on my own computer screen at home where I’m getting all the objects and scenes remotely designed. I’ve done some stints working on bigger projects for post-production houses, but these have all been based at offices up in Soho.",
                "What do you like about creating visual effects using Croydon as the backdrop?MICAHEL:I started my Instagram page a few years ago to help inspire me to produce different kinds of content, give myself deadlines and set new challenges. At the start of my commute walking from my flat to East Croydon station, I started filming certain local landmarks and thought I could do something fun and add some visual effects. There are so many areas to film that give a unique vibe in Croydon, I was spoilt for choice. I filmed the background to my scenes on my phone; 3D tracked the footage and then started creating something in my 3D program.HOWARD:Digital landscape aside, Croydon has a great backdrop for filmmaking! While brutalist architecture may not be to everyone’s taste, I happen to think the town has a great (albeit rather gritty) aesthetic and I got very excited in recent years when crews were here filming scenes for The Dark Knight Rises and Black Mirror. When I’ve shot my own films here I’ve purposely focused on some of the grimier concrete areas, several of which have already disappeared since. I guess in years to come this will be replaced by a shiny, ultra-modern look and it will be interesting to see how that looks on the screen!",
                "How long does it take to create a motion graphics video?MICHAEL:For videos I create at my day job in Soho, a three minute animation could take anywhere from two to six weeks full time, depending on the project and how many people are working on it. For the type of videos I upload to my Instagram, because they are normally quite short and around 15 to 30 seconds, they can take four to five days to complete. It is a lot of effort and time for such a short clip, but its very rewarding when they come together, and they definitely don’t always come together.HOWARD:It depends on the complexity of what the client wants, how they want it delivered and – often most crucially – how well the client himself has thought through what he’s asking for. Sometimes the end product might be a five minute long demonstration video for instance, with 3D walkthroughs and whizzy annotations and it’s not unusual for a piece to be re-worked multiple times before all the parties are happy with it. I’d expect something like that to take a minimum of two weeks.",
                "How can Croydon businesses integrate motion graphics into their marketing strategy?MICHAEL:I work on a wide variety of videos, from explainer videos that go online to explain a product or service, still 3D graphics that go into magazines, or videos used on platforms like Facebook or Twitter to create viral content to promote a brand, scheme or charity. Croydon businesses could use all of these avenues if they want to drive more traffic to their websites or to generate more buzz around a product launch etc.HOWARD:Social media’s more important now than ever. Simply explaining an idea can appear quite a dull way of selling it, when you could instead put together an animated musical journey through your products, services, staff and premises. Always make something fun and memorable!",
                "Can anyone start making their own visual effects/motion graphics from home?MICHAEL:A lot of the programs I use are paid for and they can be quite expensive, but there are a lot of good free options out there. Anyone with a PC or Mac can download a 3D program called Blender. This has a bit of a steep learning curve, but there are many online tutorials for it – and it’s free!HOWARD:Sure they can. Powerful computer hardware is always getting better and cheaper, there are no end to all the tutorials on Youtube which you could use to at least ‘get your toes wet’ in 3D graphics. If you don’t want to invest right away in the big industry-standard software packages you can practice with lots of good free programs. The biggest barrier I faced was time though; if you want to learn everything properly, hone your skills and build a portfolio you’ll need patience and be prepared for a few sleepless nights.",
                "What are you most excited for the future of your industry?MICHAEL:I am excited for real time rendering. I recently made a three-minute animation and it took over 80 hours to render, using eight different PC machines at the same time. There are new technologies and hardware always being developed that will make this much quicker and mean less time waiting!HOWARD:Real-time rendering has to be the most exciting prospect for me. Right now I still have to wait hours or even days for my computer to churn out realistic-looking high resolution animations. Graphics cards are getting better and better and various innovations from the gaming world are also bleeding into the animation world and helping to speed the process up. It won’t be long until photo-realistic images can be affordably designed in real time without any sort of hardware lag. I believe that will make the creative process vastly more productive."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Veganism",
            "postTimeDate": "March 13, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with twin sistersKareema and Kaleemawho run theLivity plant-based cuisinefood stall at Surrey Street Market. They also run occasional pop ups, offer a food delivery service and are currentlycrowd fundingto set up Croydon’s first plant-based café.",
                "1) What is Veganism (we’re so confused with all the terminology!)Officially Veganism is defined as “the practice of abstaining from the use of animal products, particularly in a diet, and an associated philosophy that rejects the commodity status of animals”. Since “distinctions may be made between several categories of veganism”, we personally find the terminology a little confusing so prefer to be associated with the term ‘plant-based’ which basically means a diet based on foods derived from plants (including vegetables, whole grains, nuts, seeds, legumes and fruits). A Vegan could technically get by eating processed foods, but a plant-based diet (in our opinion!) ensures a more varied diet.",
                "2) Do you both follow a Plant-Based diet?We both grew up on Caribbean food and ate a lot of Vegetarian food. Health problems a couple of years ago led Kareema to move to a full time plant-based diet and I soon followed.",
                "3) What made you set up a plant-based business?We have been professional chefs for 10 years and always had visions of starting our own business together. This came earlier than we’d originally planned as Kareema’s ill health meant she could no longer work intense and demanding kitchen hours. We set up Livity to showcase our respective skills and diet choices and run a business on our own terms. Kareema ran it initially but as interest (and orders!) grew, it became a full time job for both of us.",
                "4) What do you think about the rise in veganism? Is it a current trend or progressive movement?There’s no doubt that veganism is on the rise. The Vegan Society reported that the number of vegans in the UK between 2014 and 2018 quadrupled! And in 2018, the UK launched more vegan products than any other nation. Whether it’s a trend fuelled by marketing or a genuine movement as a result of education, from our point of view, anything that reduces animal cruelty and encourages a healthy diet can only be a positive.",
                "5) What makes your food stand out?We make traditional Caribbean food vegan friendly which is not readily available (at the moment!) We offer plant-based twists on dishes we grew up around (for example, our signature dish is Curried Jackfruit, which is our take on Curried Goat) as well as comfort food like Mac & Cheese. We are the only people doing what we do commercially in Croydon.",
                "6) What do you think about Vegan influencers on social media?Whilst it’s great to see so many people spreading the word, the influencer ‘scene’ can get a little samey. It’s important to remember that Rastafarians had an ethical plant-based movement way before the term ‘vegan’ was coined in the 40s. We’d both like to see more diversity and cuisine from other cultures better represented.",
                "7) What do you think about the Vegan options in Croydon?Having grown up here, it’s great to see vegan food becoming more readily available. But there is still a long way to go. We really want to be a part of making vegan food more accessible in the area and are currently crowd-funding to open a permanent premises and be the first 100% plant-based Caribbean cafe in Croydon.",
                "8) What’s the biggest misconception surrounding Veganism?For us, one of the biggest misconceptions is that there are not many black vegans/vegans of colour. There seems to be an impression that Veganism is a white, middle class thing. That’s why it’s so great to see @London_Afro_Vegan, @SarahJaneCrawfordand @tishwondersdoing their thing on Instagram.",
                "9) How are you helping to inspire others to try a plant-based diet?We hope to show that vegan food doesn’t have to cost much or be overly complicated. We’re always happy to answer any questions or give advice and meal ideas to our customers; be that through face to face conversations at our stall, via our social media channels or interviews like this! Go on, give it a try 😉",
                "10) Why did you choose to trade in Croydon?We grew up and went to school in Croydon and are trying our best to inspire those around us and make positive change on our doorstep.",
                "To support the twins in their campaign to open Croydon’s first plant based café,click here."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Activism",
            "postTimeDate": "January 8, 2019",
            "Text": [
                "East Croydon Cool talks… is a blog series that explores topics of cultural interest via local area experts. With New Year’s Resolutions high on the agenda (as well as the impending B word), we spoke with local young activist, Georgia Walters.",
                "What does Activism mean to you?To me, activism means doing something. It means trying to change the world in whatever way I can, no matter how big or small my actions are.",
                "At what age and how did you start to get involved?I have always been very loudly feminist in my beliefs, probably since my preteens – so from a young age I’ve been vocal about my beliefs. In terms of political activism, I first got involved with Labour Campaigning a couple of weeks before the 2017 general election. I was newly 17. It may have been the middle of my AS exams, but I felt like I needed to do something tangible to make a proper difference. I signed up to distribute leaflets to commuters at Sandilands tram stop. It was about as grassroots – and soggy – as campaigning gets. Trying to hand leaflets to commuters in a torrential downpour isn’t exactly the best start to being an activist. But it was a start all the same!",
                "During year 13, I devoted free periods and weekends to Labour campaigning. I’ve done two election days (GE 2017 and the 2018 Locals) and they’re so much fun to me! The aching feet after hours of canvassing are well worth it. I also worked on an EPQ – an extended project worth half an A Level, where you’re allowed to research whatever you want. I decided to research LGBT-inclusive learning. Throughout secondary school, my self-esteem was affected by the fact that I couldn’t see myself in what I was being taught. History, sex education, English syllabuses, and the general environment around me was heteronormative. I hardly knew gay people existed. I produced a dissertation exploring why LGBT identities are neglected in the classroom, and how we can continue to improve the situation. I’ve just sent my dissertation to educators and activists of all backgrounds, in the hopes that it’s a good resource to refer to when trying to improve inclusive learning in the future.",
                "And on top of that, I love the odd protest, even if it’s not as much of a direct action. My first one was the NCAFC (National Campaign Against Fees and Cuts) student demonstration. More recently, like half of London, I was waving a placard against Donald Trump in Trafalgar Square…",
                "But activism doesn’t have to be dissertation writing or placard waving! I’d consider small-scale efforts to be activism too – from homeless shelter/library donations, to refusing single-use plastic, and thrifting clothes to combat consumerism.",
                "How is everything you do connected?I do a lot of seemingly fragmented stuff: the odd labour campaign, a dissertation on education, and smaller scale charity stuff. I think it’s all tied together by a contempt for the Tories.",
                "Okay, I want to be funny about it – but seriously! I probably shouldn’t get too party-political here, but everything I do is a response to something that has been caused – or worsened – by the Conservative party.",
                "I started campaigning because I was sick of being too young to vote, when I had opinions that mattered. I wrote my dissertation because LGBT people still aren’t represented in schools – a lasting effect of Section 28 (legislation introduced under Thatcher). And I donate stuff whenever I can because I can see funding cut impacts in schools and in homelessness stats.",
                "Do you think today’s generation are more politically and socially engaged than previous generations?I live in a bubble, working and hanging out with people who are likeminded. So initially, I read this question and instantly thought of friends like Ellen Jones (a previous Stonewall Young Campaigner) and awesome people like Dan who organises Croydon Youth Labour. I know (and follow) so many people in my generation who are doing incredible things.I think young people are becoming increasingly socially engaged, because social media exposes us to inequalities around us, and that drives us to do something. But at the same time, not everyone is a doer. There’s so much apathy.",
                "This generation is definitely aware, but I don’t think we’re fully engaged. We’ll retweet that Blue Planet clip, then buy a plastic-contained takeaway. We’ll give spare change to the homeless, but probably won’t volunteer at a shelter. We’ll express our political views, but won’t go as far as canvassing and campaigning.",
                "Obviously that’s a sweeping generalisation. There are so many amazing young people making meaningful impacts. But rather than simply praise that, I think I’ve got to point out that we could be doing so much more. I could be doing so much more.",
                "What would you say to someone who doesn’t vote? (to persuade them it is worthwhile)Vote for others, as much as you’re voting for yourself. For everyone doing well under this government, there are perhaps dozens who are struggling, or in poverty. Everyone knows that. It’s on the news every day. Free school meals and holiday hunger; homelessness levels; food bank usage. It’s easy to skim read the newspaper, become desensitised, not bother voting because you haven’t seen it with your own eyes. But you really can help to change things like that.",
                "I know you’re tired on your train back from work, on the average election day… but an extra five-minute walk to your polling station is well worth it in the long run. 😊",
                "I think a lot of people don’t vote because they think a single vote won’t make a difference. Croydon Central is such a good example where Labour only lost in the 2015 election by 165 votes. There were undoubtedly more Croydon Labour supporters who decided not to vote that day. If they had, we would’ve had Sarah as our MP for much longer than we already have – and probably wouldn’t have such a dire funding situation in our schools. (Thanks, Gavin).",
                "Also, voting is something we often take for granted. We’re so lucky to be able to peacefully walk to a polling station, let alone cross that ballot.",
                "What do you see as the biggest social issues affecting younger people today?School funding. Over the last four years studying in Croydon, I’ve become hyperaware of cuts to schools. Even what seems like a small issue can have such a devastating ripple affect. A lack of adequate funding for resources can disrupt a child’s education or limit their opportunities to an extent we often don’t realise.",
                "There are struggles to afford senior teachers, or even enough SEN and sanitary staff -something Sarah Jones MP highlighted in her research on school cuts. I definitely experienced the under-staffing issues for myself last year.",
                "Creative subjects have suffered so much. There was always a running joke in my school about there never being any glue sticks in the art department. At times, it was often because we genuinely couldn’t afford them.",
                "And after talking to school libraries in the borough, I’ve learned that many have had their budgets slashed. It’s often difficult to afford new books and keep the library updated and appealing for today’s young people. I’ve tried to combat that as much as I can, donating a few hundred teen novels to my school’s library. If anyone wants to do that, by the way, and doesn’t have a connection with a school – please check out the Book Buddy charity!",
                "Has there been a rise in Community activism?Though most of my Labour campaigning has been in Croydon, I don’t think I’ve been involved long enough to see a rise! But over the last year I’ve definitely been learning about more and more fantastic community projects – such as Croydon Nightwatch.",
                "Do you think the Instagram generation are more keen on being seen as socially conscious than being socially conscious?Mmm. Yes and no.",
                "Thinking about myself, I’m keen on being equally seen and being socially conscious. I big up things on Twitter because as wonderful as it is to do things, I think it’s also important to promote causes. Leading by example n all that!",
                "For instance, every time I donated to my school library, I’d tweet a photo of the books. It’d often generate a few conversations, lots of retweets. Up to a thousand engagements. And in turn, at least a few people have contacted schools to donate some books.",
                "So for me at least, I am keen to be seen as a socially conscious person. I’m cautious about overstepping into bragging about the stuff I do on social media. It does look like I’m desperately trying to paint a good image of myself. But, well, I am doing good things. And if that inspires one person on my social media, then it’s worth it.",
                "As long as you’re not doing it for the likes, or the retweets – POST AWAY! Get involved with your community. And tell people what you’re doing. It does wonders. Whether it’s changing an older person’s perception about young people, or encouraging others to take action – you’re doing good.",
                "To learn more about Georgia, visit herwebsite."
            ],
            "Media": []
        },
        {
            "Title": "50 Reasons why Croydon is Cool",
            "postTimeDate": "March 14, 2019",
            "Text": [
                "The buzz surrounding London’s largest (by population) and most southern borough is getting louder by the day.",
                "As part of an eye-watering £5.25 billion regeneration programme, Croydon has seen (and continues to see) huge changes. Below, in no particular order, we’ve highlighted 50 businesses, events and organisations that are helping transform the neighbourhood into the new place to be…",
                "1)RISE Gallery(because they created theArts Quarterand turned Croydon into an open air modern art gallery)",
                "2)Boxpark(because they bring a huge variety of cuisines under one roof AND run sell out events, including those infamous World Cup screenings that got media attention from around the world)",
                "3)TMRWandNexus(because they’re creating co-working spaces and communities for entrepreneurial talent to shine)",
                "4)Ludoquist Café(because they celebrate geek chic by running South London’s biggest and best board games café)",
                "5)The Ends Festival(because this massive music festival is bringing music heavyweights Nas, Damien Marley and Wizkid to The Cronx. Yep, really)",
                "6)Lost Format Society(because they introduced rooftop cinema to Croydon)",
                "7)Crepes and Cones(because this dessert bar, owned by Croydon grime stars Krept and Konan, welcomes an impressive level of celebrity clientele.)",
                "8)Matthews Yard(because this community arts space provides a welcoming home for a diverse range of creative projects and events)",
                "9)Croydonitestheatre festival (because it brings the best of experimental theatre from around the UK to Croydon’s doorstep)",
                "10)Croydon Literary Festival(because it entices the literati to town with zero pretence).",
                "11)WALK Croydon(because they lead walking tours that help people explore Croydon’s story)",
                "12)Butterfly Effect Festival(because this 2-day music festival celebrates the best of garage, house and afro beats with previous acts including DJ Luck and MC Neat, Shola Ama, Steve Lawler and Darius Syrossian).",
                "13)The Joker(because Croydon’s most Instagrammable pub also serves up an impressive drinks list and has brought ‘Kombucha Martini’ into Croydon vocab).",
                "14)Mr Fox Croydon(because this late night cocktail pub featuring 14 foot Shuffle boards is also bringing Saturday party bottomless brunches into town)",
                "15)SeeOur7(because this Croydon based music collective sweat talent and are definitely ones to watch)",
                "16)Funhouse(because an adult ball pit bar never gets old; nor do the ball related puns to accompany social media pics)",
                "17)Black Mirror Bandersnatch(because this interactive film introduced Croydon’s brutalist architecture to an international Netflix audience).",
                "18)Art and Craft(because in addition to an extensive selection of craft beer, they also gave the people of Croydon their first Prosecco tap)",
                "19)MYPTandF45(because they’re keeping Croydoners buff with their group personal training sessions)",
                "20)Croydon Vs The World,Ivy RoseandCDN(because they’ve created Croydon fashion lines that residents wear with pride)",
                "21)Fairfield Halls(because this iconic building is undergoing a £30 million makeover that will become a state of the art performance venue when it re-opens in Sept 2019)",
                "22)Stormzy,Nadia Rose,Loyle Carner,Krept and Konan,Hardy Caprio,SmokeboysandRaye) (because home-grown music talent is inspiring a new generation)",
                "23)David Lean Cinema(because independent and world cinema just isn’t the same in a multiplex)",
                "24)Croydon Food Festival(because each summer it brings together 12,000 people for an afternoon of alfresco dining in the Restaurant Quarter)",
                "25)The South Wing(because this beautiful location house encourages creatives to Croydon)",
                "26)Love Atomica(because they provide a treasure trove of vintage and retro goodies)",
                "27)Saffron Tower(because it adds a vertical rainbow to Croydon’s skyline)",
                "28)More Yoga(because these classes are bringing zen into Croydoners lives)",
                "29)Limitless VR(because they provide a virtual world to escape to)",
                "30)Turf ProjectsandASC Studios(because they continually champion and support local artists)",
                "31)The Cronx BreweryandSignal Brewery(because they’ve given Croydon it’s own local craft beer)",
                "32)CroywallandOxygen Freejumping(because they’re keeping locals fit without a treadmill in sight)",
                "33)Well Versed Ink(because this spoken word poetry group draws in a serious crowd)",
                "34)East Croydon Train Station(because it gets residents to Victoria in 18 mins and London Bridge in 14 mins andThe Trambecause it gets residents to Wimbledon in 30 mins. Most of the time.",
                "35)Ikea(because it ensures residents can get scandi-chic on a budget….and meatballs all year round)",
                "36)Art Club Croydon(because this welcoming community art group provides a creative home whatever your artistic ability)",
                "37)   TheCroydon Comedy Festival(because it ensures people are laughing WITH not AT Croydon)",
                "38)   New Builds likeInnovaandLeon House(because they have created stylish and affordable apartments that are helping first time buyers get on the property ladder)",
                "39)Croydon Airport Tours(because they provide a dose of girl power teaching Croydoners about Amy Johnson, the record-breaking pilot operating from the London airport).",
                "40)Crushed Bean,Coffee Shotter,Byte Café,Mr Tinto,Smooth BeanandTriple Two(because they’re keeping residents fully caffeinated all day long)",
                "41)Croydon FM(because they stream urban entertainment to the community 24/7)",
                "42)London Mozart Players(because the UK’s longest established chamber orchestra is helping secure some incredible local collaborations)",
                "43)The BRIT school(because they continually churn out globally recognised talent such as Adele, Ella Eyre, FKA Twigs, Jessie J, Leona Lewis and Kate Nash)",
                "44)The Barber Club(because they provide Croydon’s menfolk with the finest of barbering experiences)",
                "45)ZooCo(because they created Theatre on the High Street that plays lightly with things that matter deeply)",
                "46)One Landsdowne(because it’s set to be the second tallest building in the UK, incorporating a rooftop bar, restaurant and public viewing gallery offering panoramic views across the capital and Surrey)",
                "47)101 George Street(because this site is being transformed into the world’s tallest modular buildings)",
                "48)Pirate Studios(because they provide 24/7 self-service music studios for DJs, musicians and producers)",
                "49)Westfield(because this ‘on again, off again’ £1.4 billion shopping centre has kept everyone talking 😉",
                "50)East Croydon Cool(because what is life if you can’t champion your own project on your own website?! ;).",
                "We can’t wait to see what the next year has in store and look forward to adding to this list in due course. Got any other recommendations we should check out? Comment on our Instagram posthere.",
                "(Photo courtesy ofThe Croydon Photographer)"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Co-Working",
            "postTimeDate": "September 23, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we chatted with several key players from Croydon’s Co-Working scene to learn more about the buildings which are fast replacing traditional meeting places to become the heart of both the local business and social community.",
                "With the increase in start-ups and more entrepreneurial driven careers, co-working spaces are now a common site along the high street. Providing an inspiring space for people to meet, learn and do business with other like-minded individuals, these hubs are a lifeline for those who have gone against the grain of traditional employment. Here in Croydon, we’re spoilt for choice withBusiness Xchange Hub,Matthews Yard,NEXUS,Sussex Innovation CentreandTMRWto name just a few.",
                "Additionally, the number of people taking on side-hustles (passion projects people work on to earn an additional income stream) has increased massively (a recent survey of adults in full time employment found that 1 in 4 are working ‘5 to 9’ after returning from their ’9 to 5’).",
                "This has had a big impact of café culture, with many local coffee shops openly welcoming ‘lap-toppers’ with free wifi, easy to access plugs and refills (The Storein South Croydon recently introduced a ‘£5 Bottomless Coffee’ deal which runs from Tues to Fri from 12pm to 5pm).",
                "So should you be signing up for membership at a much coveted co-working space or is hot desking at coffee shops across the Borough more appropriate? We spoke to representatives at Sussex Innovation Centre, TMRW and NEXUS to better understand the benefits of working within a co-working space.",
                "How would you explain a Co-Working space/community?",
                "Saffron from Sussex Innovation Centre:“There are various different co-working space models, but our hub is a bit of a hybrid; we have offices with full-time tenants, ‘virtual’ members who drop in most days to use their laptop in a hot-desking room, and people who use our open plan space more casually, just for the occasional meeting or to get a few hours of work done in between appointments. Good co-working spaces should offer that kind of flexibility, and community is the other really important factor. When you’re working alongside people of a similar mindset who work in a different field, it creates a great environment for ideas and creativity to flourish”.",
                "Marcela from TMRW“By definition co-working spaces are shared office spaces, but the concept is much bigger than that. I see co-working (and TMRW) as a place of possibilities, where professionals and entrepreneurs can leverage a network, a collective mindset and set of experiences (good and bad) that is greater than their own. Yes, it’s true that dozens or hundreds of people can share an office and never talk or help each other, there’s plenty of that in the industry, but it’s also true that a certain kind of magic can happen if you nurture a culture of collaboration and ownership under that same roof. The first (ever) co-working spaces were not created as a business model, they were created in someone’s living room, out of the human need for connection, shared experiences and community. Community and co-working are intrinsically connected, and if they are not, then we’re just talking about serviced offices”.",
                "Mark from NEXUS:“The great thing about Croydon is that there are different models, each with their own unique look and feel to appeal to a person(s) need. A co-working space like NEXUS is beyond the bricks and mortar. We incubate talent and support our community to help them grow. Support may be through having a considerate professional set up so they can use the space to focus on ‘getting work done’ but beyond this we aim to make our community stakeholders in the NEXUS proposition. This sort of approach is beyond that what you will get if you work out of say Starbucks. Notwithstanding this, the coffee shop set up definitely has a place and offer. The conversations had within our walls, the access to events, knowledge and other talent, mean a co-working community can thrive and work off each other’s skill sets.”",
                "What do you think has driven the increase in demand for co-working spaces?",
                "Saffron from Sussex Innovation Centre:“The idea of working from home is so attractive but the reality can be isolating and incredibly distracting. Someone recently told me working from home was bad for his waistline as he spent most of the day in the fridge! Working alongside other people helps you keep focus and separate your work and home life. Even if you’re always going to be prone to procrastination, having other freelancers and start-ups around helps you to get more value out of stepping away from your screen. Being part of a community brings all sorts of organic opportunities, from invitations to events you may not otherwise have heard about, to introductions to potential clients or collaborators”.",
                "Marcela from TMRW:“The demand has been powered mostly by economic changes. Like most other industries, if it can be rented instead of purchased, people will opt and even pay more for flexibility. Think bike sharing, car sharing, Fat Llama, etc. Same goes for offices. Why pay a fixed hard set 5 year contract for an office you don’t know for sure you’ll need, if you can pay as you go (and grow)? The way we work is also dramatically changing. Technology and the gig economy have made it easier for people to start their own businesses and to work flexibly and/or remotely. There’s a lot of us now working outside of a conventional office and job setup, seeking autonomy and better quality of life. Co-working spaces offer that support and flexibility that freelancers, remote workers and entrepreneurs need to be able to focus on their businesses”.",
                "Mark from NEXUS:“Various factors have instigated the increase in demand for co-working spaces. Large operators like WeWork have become attractive for other large corporates who wish to have staff working in smaller teams but across different locations without having to manage the overheads. For smaller businesses or start-ups, there have been good success stories from people who have worked within such communities. Through word of mouth this has encouraged others to realise the benefits of doing so. One of our NEXUS members recently said to us that she was grateful to have had the opportunity and courage to take the leap of faith and work from NEXUS having previously worked out of her home office. Whilst at home, she found the distractions there were always present. Getting up in the morning and ‘going to work’ from a spot like ours, puts one in a mindset geared towards productivity. It’s also important to remember that working at home or in a coffee shop can be a lonely experience. There are many challenges one might face as a small business and having the ability to share these experiences with likeminded people who are living the same life can be a welcome relief, helping to reduce stress / anxiety.”",
                "Why is the interior design of the space so important?",
                "Saffron from Sussex Innovation Centre:“Again, it’s about flexibility. It needs to be suitable for a range of different requirements; you might have a FinTech founder meeting with a corporate client, web designers having a few coffees and brainstorming ideas, a salesperson needing a quiet zone to make some phone calls. We try to design our space with areas for people to interact in different-sized groups, and other areas to provide some privacy when it’s needed. People are also looking for somewhere that’s stylish and welcoming, but still a place where they can get some work done. We’re under new management at Sussex Innovation, and our new Chief Exec wants to eliminate white walls – so our space may be getting a facelift soon!”",
                "Marcela from TMRW“It’s more than proven that the environment you work from will affect your health, your productivity and your creativity. We built TMRW to be spacious, full of natural light, stylish and functional. And we also made sure to include a little chaos in our design, so if you visit the space, you’ll notice we don’t have straight walls or regular squared offices. That was intentional, as we know the brain thrives from unexpected visual disruptions. It’s also important to have a space that is functional enough to accommodate different needs and styles of work, while also being conducive for collaboration.”",
                "Mark from NEXUS:Farouk, co-founder of NEXUS and I have spent time working in the city and know how important it is to posture, in particular, to have excellent furniture that is ergonomically designed. We’ve sought to invest in the surroundings so that our community feel comfortable, especially when working long hours sometimes into the early hours of the morning editing pics or video content etc. We have bespoke signature pieces throughout the venue such as our Rosen bridge inspired pendant lighting fixture that overlooks the main space designed by British designer Timothy Oulton as well unique pieces that acts as functional art such as our velvet soft seating with ecologically recycled canvas on the back adorned with artwork and spitfire riveted boardroom chairs, swan seats and egg pods. We created NEXUS to be a space where people can walk into and experience the same level of fit out that one would expect from the very top establishments in the West End or the city. We didn’t want to go for the cliché WeWork/Scandinavian inspired look that we have often come across but rather have a space that is functional with the attention to detail that inspire creatives and people who hold these efforts in high value. The walls were kept clean of adornments as NEXUS is designed to be a true ‘working’ gallery. We are delighted to have hosted a number of exhibitions with our current show being curated by one of our members BetterShared.",
                "If you could highlight one thing that makes your space stand out from others, what would it be?",
                "Saffron from Sussex Innovation Centre:“Support – we are not just a space with WiFi full of desks, we have a team of experienced staff who get to know members and offer them strategic advice to help them grow, and a new cohort of graduates every year, who we hire out to work on projects. It’s an affordable way of getting jobs done and talent spotting for growing companies, also giving the grads an amazing experience working with all sorts of different innovators in so many different sectors that they may not even have heard of. We’ve seen a few co-workers move into their own offices creating more jobs recently – it’s wonderful to be part of”.",
                "Marcela from TMRW:“Combined, our management team has built 18 companies and has 1 startup to IPO, four successful exits and a bunch of failures in the bag. We help our members and startups with their challenges (big and small) because each of us has been there, tracing that same path they are on right now. We’ve helped them raise several million Pounds in investment (from big-name VC funds that had never invested south of the river before), we’ve helped them staff their teams, we’ve helped them fix broken business models and we’ve been there to support them on their day to day experience of running a business. Together we have created an environment that is conducive for collaboration and has in one year generated over £250k in revenues between members.”",
                "Mark from NEXUS:Our group, Cellar Door, our main bread and butter activity remains in creative event management. We’ve lived and continue to live the life of a creative so we understand the our creative community first hand. This authenticity is both invaluable and rare. We created NEXUS because of the absence of somewhere (local) that really nailed what our needs were. We wanted to create a home for creatives that they would be proud to see as their own space. By the nature of what creatives do, people may only drop in a couple of times a week and some of our members work on international campaigns. However they know that on returning to London, NEXUS is their home and that the NEXUS network is global.",
                "How do you foster a sense of community?",
                "Saffron from Sussex Innovation Centre:“We use Slack to communicate with members and for them to communicate with each other, and we try to create opportunities to socialise, from more formal events through to ‘Friday win’ drinks (where we have a quick drink on a Friday afternoon and share the achievements we’re most proud of from the week). We have an amazing team of people who really care and get to know our members, make introductions and help people feel like they’re not going it alone”.",
                "Marcela from TMRW:“Community starts with a sense of ownership. When members join TMRW they are invited to a conversation about where our community is going and where they believe it should go. Everything we do is co-created by our members and I make sure they understand there’s no community if they don’t show up, if they don’t share their time, their experiences, their networks, their feedback and ideas. I take the onboarding of a new member as an opportunity to plant a seed in their minds; I want them to see beyond desks and Wifi, I want them to see that there’s more value to get (and offer to others) if they give back and understand they have a level of responsibility with that community. Everything else sorts of fall into place from there. We have a welcoming environment and plenty of opportunities for connections to happen and for members to influence and shape the ecosystem around them, but I like to always remind myself and the team that, at the end of the day, events and software are just tools. The spark will start in much smaller and subtle things.”",
                "Mark from NEXUS:“We foster a sense of community by first making sure that everyone feels welcome, regardless of whether one is an experienced high flying business or just starting out. We also very much event led, given our expertise, where we curate events to nurture members and the wider community meeting. An example of this was a music industry networking night where local resident and NEXUS member Swiss from So Solid Crew Dj’ed. This was extremely well received, and we will be broadening this out with more events of this nature from November. We are also welcoming leadership accelerator Reena Dayal to talk about how our members can master the art and science of effortless leadership and learn to unlock their hidden creative potential. Listening to member feedback means we can deliver activities that they need / want, whilst at the same time bringing them together.”",
                "How do you encourage members to work together?",
                "Saffron from Sussex Innovation Centre:“Again, through introductions, networking and signposting. We sometimes put on themed events, gathering a group of people together who are looking for a co-founder, or trying to sell their technology into local government, for example. You never know where the connection is going to come from, you just have to listen out for it and make the introduction when you spot it”.",
                "Marcela from TMRW:“It starts from the moment they join, like I said. If they have that seed in their minds, if they realise the infinite connections and possibilities, they will look inside the community before going anywhere else. And because we’re constantly encouraging them to meet and to nurture their relationships with other members, there’s also a level of trust in the community that is hard to find anywhere else. Hiring a service from Tom who sits at the desk next to yours, has two kids and is allergic to peanuts is completely different than hiring a service from a faceless company, and our members understand and value that. Most collaboration in our space will start as it should, through relationship building, in what could be perceived as a silly conversation over a kettle boiling or a Community Lunch. If they voice their needs they will inevitably be put in the direction of someone that can help, either by one of us in the management team or by another member. No point of contact can be taken for granted in a coworking space. A ping pong competition and a bake off are not just designed for fun, they are opportunities to connect the dots. I say to members all the time: someone in this space has the answer to the question keeping you awake at night; your job is to find them”.",
                "Mark from NEXUS:“Nexus is a space where the best creatives work alongside each other, sharing knowledge and ideas. We are pretty old school so are active in speaking to our members over and above using apps. Whilst apps are great, conversations held face to face are so much more productive. We make it our business to understand what different people both within the NEXUS members and out, might be working on and never hesitate to make introductions where skill/projects / ideas may have synergy”.",
                "What type of people does your space tend to attract?",
                "Saffron from Sussex Innovation Centre:“We have one main criterion we look for – that is being innovative, a disruptive business idea that could help create new jobs. So anyone ambitious to create a business bigger than just themselves should be working from our space, as we offer so much more than just a desk for amazing value”.",
                "Marcela from TMRW:“We have a mix of tech, creative and digital companies, from one (wo)man bands to teams of 20, so it’s a healthy blend of people, but they all have this restlessness in common, which, as a result, keeps us always pushing to be better. Unlike all other spaces in Croydon, we’re purely for digital companies, big and small, and don’t accept lawyers, accountants, etc, which, we believe, makes for a better ecosystem for our members.”",
                "Mark from NEXUS:“We founded NEXUS for people just like us: a space for creatives by creatives. At NEXUS we come together as a community of like-minded people, from the creative industries, including but not limited to music, fashion, dance, art, events, copyrighting, film, marketing, PR, social media and design. We’ve been open for about ten months and thus far the growth has been organic. The natural footfall that we have attracted has first and foremost been reflective of our values – good people. There are no egos walking around just genuine passionate creatives eager to get work done and make a success of their talent. Our membership is very much reflective of the people of Croydon all doing great things”.",
                "What should members do to ensure they get the most from their membership?",
                "Saffron from Sussex Innovation Centre:“Just come in – we have different levels of membership but those that make the most of membership are those that give lots themselves. We have speaking slots at events, and resources through our connection with The University of Sussex and those that make the most noise get the most oil”!",
                "Marcela from TMRW:“They have to show up. For events, for each other, for the conversations about where TMRW and our community is going. It’s fine if you’re just looking for a space to work from, you will get a great one, but the biggest value will always come from people.”",
                "Mark from NEXUS:“Share. Share content and what one might be working on since through our events in other areas within the group (Cellar Door) and also our promotional channels coupled with that of our member base, NEXUS has the capacity to really help take your business to the next level. Also sharing experiences will help a member learn quickly from the pitfalls others in the NEXUS community may have faced in their respective creative industries. We will also be announcing an exciting new initiative that is launching here at NEXUS from January 2020 so watch this space!”",
                "Huge thanks to Saffron Saunders (Croydon Centre Manager atSussex Innovation Centre), Marcela Donatello (Community & Programme Director atTMRW) and Mark Sarfo-Kantanka (Co-Founder ofNEXUS) for their contributions."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool Talks…Selhurst Street Art Gallery",
            "postTimeDate": "September 3, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts.",
                "Intrigued by the growing collection of street art underneath Selhurst station, this month we spoke to Hannah Sayers from CASSA (Community Action for Selhurst and Surrounding Areas) to find out how it’s come about.",
                "First of all, what is CASSA Selhurst?CASSA was set up in 2017 by three mum’s living in Selhurst. Our aim is to help improve the area and try to give the people of Selhurst a voice. Over the last two years we have worked hard to develop ideas and fundraise for community improvements. To date, our most successful projects have been the piano in Selhurst Station, community mural painting sessions, street art at the Dagnall Park underpass and a community consultation day. Our small community group is now made up of 5 local residents who all have jobs and families, but still somehow find time to volunteer! We also run a Facebook group (CASSA_Selhurst) where local people can share concerns or promote local activities. There’s lots more to come so we’re always on the lookout for new ideas and any local people who want to help out!",
                "How did the idea for the street art gallery come about?An underpass on Dagnall Park Road (under Selhurst station) had been repeatedly identified by residents as somewhere that needed improving. It was constantly fly-tipped and left many people feeling threatened when walking through. After some consultation with the community, CASSA took the initiative to improve the area. We’d seen the success of outdoor artwork in other urban locations and from the consultation were confident it would be well received by locals.",
                "How did you make the idea a reality?Firstly, we spoke with Steve atLondon Calling Blog. This is a non-funded and non-profit group (made up of volunteers) who have been documenting street art around London since 2015. In 2016, they started organising legal paintings in a number of towns around South London and beyond. To date, they have orchestrated over 500 pieces! Having got the support of London Calling Blog, Network Rail kindly granted permission for artists to legally paint the wall under the bridge in Dagnall Park. CASSA successfully fundraised for some paint for London Calling artists and also to commission a local artist (Natalie Barrett) to complete a separate community mural on the opposite wall.",
                "How did the project develop from there?Members of the community were encouraged to come down to add to the community mural and watch the street artists work their magic. The project was so successful, that Network Rail then teamed up with London Calling Blog directly to continue painting into Newhaven Road. This has led to bringing the wider area to life with creativity and expression that everyone can enjoy.",
                "What’s next?!",
                "For London Calling Blog and the Street art:Selhurst now has the potential to offer one of the single best concentrations of large scale murals in the whole of London! London Calling Blog have so far facilitated 17 murals from 23 artists who have all painted for free using their own materials. Selhurst now hosts a range of styles; from realism and illustration to abstract and letter works. This array of styles and subjects hopefully offers something for everyone in the local community. London Calling Blog are hoping (with the continued support of the local community and Network Rail) that the project can expand the entire length of Newhaven Road, making it the largest single public legal wall painted in London! This would most likely be the first time an entire street would be painted from one end to the other in its entirety in London.",
                "For CASSA:We are currently digesting information from our consultation day, and have a few projects in the pipeline so watch this space!",
                "Can you tell us a bit more about some of the pieces?The artworks change over time because there are always artists looking for spaces to showcase their work and despite much progression in the number of legal walls in London over recent years, there still is no-where enough walls for the number of artists this city is fortunate to host. Changing the walls also keeps things fresh and interesting for the locals! It also means that the walls are continuously monitored and maintained for free, keeping them looking good as new! A few favourites are:",
                "‘The Breach’ by Airborne Mark: Depicting an original origami Blue Whale design that the artist folded himself. He actually spent a similar amount of time on the origami as on painting the design! Airborne Mark set the whale as it ‘breaches’ the waterline just above the pavement – something it is believed Whales do in the wild to communicate with other members of their species – and a moment captured so perfectly, you really can sense the movement in the work as this massive entity is set to come down on the surface of the water, leaving an almighty splash and travelling ‘slap’ sound.",
                "‘Asiatic Leopard’ by Jane Mutiny: keeping to her themed subjects of endangered and extinct species from around the globe, this is striking depiction. Not only does her artwork feature subjects which are environmentally focused, the tools with which Jane constructs her artworks are all created using ecologically sound paints and brushes to generate that rich textured effect prevalent in her output.",
                "Also, visiting French Street Artist, Darry Perier, made exemplary use of the space on his visit through London. His abstract piece leaves a rich and vibrant array of colours fusing geometry and portraiture in to the captivating sight one sees when confronted with the work.",
                "How much were you influenced by the street art scene in central Croydon?It was definitely a factor. The ever changing art scene really brings vibrancy to the area and has changed the feel of central Croydon. I also love the street art in Penge which is why we contacted Steve from London Calling Blog as he was responsible for coordinating the art work there.",
                "If you could invite any artist (dead or alive!) to come and paint at Selhurst Street Art Gallery, who would it be?I personally love the work of Japanese street artist Aito Kitazaki and the awesome vintage typewriter quotes from WRDSMTH but there are so many great artists it’s really hard to choose. It would be cool to get something Croydon themed up there, likeGlenn Foster’srecent ‘Croydon Pride’ piece made up of Croydon Buildings!",
                "What other arts projects have you been involved in/would like to be involved in to help improve Selhurst?Our first project was to put a piano in Selhurst Station. We found a local person who kindly donated their piano and then another local person who volunteered their time to design and then paint the piano you see today! There really is a lot of love and talent in the Selhurst community!",
                "We were also involved with the colour design of the ‘Selhurst’ artwork by Lionel Stanhope on the main Selhurst Road railway bridge. It was fantastic help get such a great statement piece on the main road. There so much potential for other artwork/improvements to the area so we are always keen to hear from local people and their ideas.",
                "How can the local community help/get involved?We are always on the lookout for passionate people with ideas, you can contact us via our social media channels, or we do have an email: cassatrustee@gmail.com. We ask that people who want to volunteer have some time to commit, it’s not much but we do need people to at least attend our monthly meetings.",
                "More simple things can be supporting London Calling Blog and sharing/liking their posts on social media and joining the CASSA Facebook group and sharing/liking our posts too. Also we have asurveyto collect local people’s views and opinions: tell us what you LOVE about Selhurst!",
                "CASSA would like to thank Croydon Council, Croydon Seventh – Day Adventist Church, Homesdale road residents association, The Brits School, Steve at London Calling Blog and all the artists for their donations to the community mural.",
                "For more information on CASSA, follow their Instagram account HERE.For more information on London Calling Blog click HERE."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/09/the-breach.jpg?w=300&h=225",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/09/asiatic.jpg?w=300&h=225",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/09/darry.jpg?w=300&h=225",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/09/piano.jpg?w=300&h=401",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/09/selhurst.jpg?w=300&h=296"
            ]
        },
        {
            "Title": "East Croydon Cool talks…Urban Music Culture",
            "postTimeDate": "March 19, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up withSeeOur7, a Croydon collective that brings together the vocal, dance and creative talents of 7 local artists and performers. SeeOur7 also provides a platform to showcase music and arts from other musicians and artists in the area.",
                "What is SeeOur7 and how did it come about?SeeOur7 is an artist collective who run events in the local area. We are built from a network of artists and friends in Croydon, and organise shows/parties that specifically focus on nurturing homegrown creative talent as well as providing a platform for artists to perform. Both in terms of events and our own talents/skills, we do a lot!",
                "We runTheSeeOur7 Show(our main showcase of local culture and music), theSeeOurSession(a bi-weekly party at Limitless VR) andThe Study(a weekly dance study group)…in addition to performing and vibing together whenever we get the chance.",
                "The collective started forming in its current state after an EP launch show by Locks, which other local artists (including Haz, Wolf and Sly) attended and performed at. With everyone hanging out after the show, the potential for building a local creative scene felt long overdue and underdeveloped – and so SeeOur7 was born.",
                "Who is in the Collective and what do they each bring to the table?The extended family is fairly large and involves all kinds of dancers, rappers, illustrators, filmmakers, etc. But the core group is composed ofHazman,Dio,Vociferous Sly,Locks,EssenceandInspiritive– we all have several crafts, primarily surrounding dance, rapping, producing, beatboxing and DJ’ing – but most of us do them all!",
                "How would you define urban music culture?Urban music is the musical expression of life in urban environments. All the energy of the streets, the sound of the streets, its beauty, its ugliness – so urban music culture is the celebration and creation of this music, and all the different forms it can take in movement, sound and visuals.",
                "Where did you all develop your skills? Self-Taught/Trained?It’s a mixture. Some of us are educated in what we do, especially the dancers. But many of the other skills we share: like beatbox, rap and DJ’ing – are self-taught skills that we gained through growing up in an urban environment and always being creatively restless people who want to learn how to do all the cool things we were being exposed to!",
                "How do you work together as a group? What is the process when putting a collaborative creative project together?We meet weekly. Whether that is to perform and/or collaborate. For example, when hosting The Study (a dance group session for all) we can  practice routines, freestyle and learn from each other but we also meet to plan and develop other events. Regardless; constant communication is key. Everyone has different roles and luckily we have a big network of talented people! So things get done… just about.",
                "Do you all work on your own individual projects too?Yes, although these projects are definitely delayed or slowed down by what we do as SeeOur7. Some of us run our own businesses, some of us are music educators, and many of us are solo artists/musicians. Some do all of those things. We all have our solo projects though – and it often fits into what we do as a collective.",
                "What do you think of the music/creative scene in Croydon?It’s…fragmented. That much can be said. There are little things going on here and there, but nothing compared to the heyday of the 80’s and 90’s (according to our parents), or even the early 2000’s with the growth of dubstep and Black Sheep Bar/Bad Apple Records.",
                "The stagnation of nightlife has definitely happened alongside the closure of several venues (including Black Sheep, Tiger Tiger, Yates etc.) and it has meant many locals have to turn to central London for events and nightlife instead, for the past several years at least. It just adds to the bad reputation the area already suffers.",
                "That being said, we think the creative energy of our area is special. It is fierce, restless, dangerous, wacky and weird, and we believe this is proved by the amount of talented young artists in the area. The problem has been chronic underfunding, the lack of venues and the various social problems…all these things mean there have not been enough resources to provide enough platforms (or enough quality platforms) – to showcase this talent. We are hoping to be part of that change.",
                "How do you feel about the current redevelopment/regeneration of Croydon?Very interesting question. We believe in regeneration without gentrification. I think definitely a big part of what we are doing as SeeOur7 is trying to assert our identity and our culture – before things begin changing. We want to be a part of a positive change in the area that does not compromise on its roots – or end up betraying its communities.",
                "We want to draw attention to the fact that the police tried to ban bashment and other forms of urban music in Croydon only a few years ago. But now that there is investment and regeneration, suddenly urban music is the new cool thing – and all the politicians who voted for that ban are now taking photos and smiling with Krept and Konan.",
                "As one of the poorest boroughs in London, there is no doubt that the area has been deeply neglected by the government and needs regeneration, but communities have to be involved in that process. Urban music culture and grassroots organising is an important way of achieving that, and that’s where we see our role.",
                "The idea is to bring people together and celebrate what it means to be from Croydon. That includes building a new culture and nightlife as well as providing a network for all the talented people who live here – and have already lived here – through the hard, dark and boring times the area has suffered. And to have a seriously fun time doing it….we deserve that at least.",
                "Does money kill culture/creativity or help it flourish?Hmm…well human creativity existed before money did, and if anything, money is just a human creation of value. But we have to acknowledge that creativity is now an industry. It is definitely about striking the right balance between doing what we do for the love of it, as well as ensuring we can run sustainably and have enough to reinvest so that we grow and keep building together for our community and our area.",
                "Where would you like SeeOur7 to be a year from now?Producing bigger and better events and performing at a few more festivals (we are in talks with a few festivals for this summer.) Other than that, just getting better as artists and ensuring our network and our community keeps growing!"
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: Opportunity to work with London Mozart Players",
            "postTimeDate": "May 14, 2019",
            "Text": [
                "A very exciting opportunity has arisen for Croydon musicians and composers to work with theLondon Mozart Players. The selected artist/act will have their work orchestrated by the amazingFiona Briceand perform atCroydon Pride 2019.",
                "London Mozart Players (LMP) is a British chamber orchestra founded in 1949. The LMP is the longest-established chamber orchestra in the UK. ‘LMP on the Move‘ is a concert series held with the philosophy that classical music and performance is for everyone and not just for the concert hall. Each year the LMP have reached out directly into the Croydon community to demonstrate this, widening and diversifying their audiences and participants, and collaborating with numerous dynamic and exciting partners operating in the borough.",
                "Highlights have included LMP’s 2017 debut at Boxpark where the string section supported up and coming producer/DJShiftK3Y. In 2018, Croydon Mela saw the strings bring an extra dimension to British Sri Lankan popstarArjun’sset on the mainstage, an event that was repeated at Southall Park for the flagship Mela event. Central to both collaborations sits Fiona Brice, orchestrator, composer and performer, who’s impressive CV includes collaborations with artists such as Beyonce, Placebo and Ed Sheeran.",
                "Croydon Prideis London’s second largest Pride Festival. Now in its fourth year, it has become firmly marked in South London’s LGBTQ+ calendar of events. The festival’s ethos is to provide a platform for every part of Croydon’s LGBT+ community to be visible, to raise awareness of LGBT+ issues and campaign for freedoms that will allow Croydon’s LGBT+ community to lead genuinely equal lives in the borough.",
                "Applications are now open for Croydon musicians to submit their compositions or interpretations, which will then be orchestrated by Fiona Brice, rehearsed, and performed on the main stage at Croydon Pride to an audience of thousands. Your music doesn’t have to sit within the classical genre and you don’t have to be a professional musician. The aim is to platform and celebrate the best of Croydon’s emerging talent through this unique opportunity.",
                "CRITERIASolo artists/groups who:1) are from Croydon2) are performance-ready to embrace a high profile platform3) are keen to collaborate with a world-class orchestra and a stellar orchestrator",
                "And since Croydon Pride is a celebratory festival full of joy and positivity –  ideally an artist/act with an uplifting vibe for the performance.",
                "For further information or to apply, complete the application formHERE."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Croydon Pride (Part 2)",
            "postTimeDate": "July 11, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up withSILVASTONE, one of three performers taking to the Main Stage at this year’sCroydon PrideFest, for a collaboration withLondon Mozart Players.",
                "Having started in 2016, Croydon PrideFest is now London’s second largest Pride Festival and has become firmly marked in south London’s LGBTQ+ calendar of events.",
                "Croydon Pride strives for LGBT+ tolerance and equality within Croydon’s diverse communities by staging inclusive events. The organisation receives no core government funding and funds are instead raised in a variety of ways including donations, sponsorship and fundraising events.",
                "Croydon Pride 2019 is taking place on Saturday 13th July and incorporates a Parade through the town centre, PrideFest and an after-party.",
                "Croydon PrideFest 2019 is the biggest and most exciting yet with not one, but two stages. The new cabaret stage will host smaller, more intimate performances. 2019 will also offer the biggest and best line-up to date, includingLady Leshurr(British grime and hip hop rapper),David McAlmont(Croydon born vocalist who has supported Morrissey on tour),SOJU(from RuPaul’s Drag Race Season 11),Danny Beard(winner of Drag Idol UK),Batty Mama(the UK’s largest organisers of black queer club nights) andAsifa Lahore(Britain’s first publicly out Muslim drag queen).",
                "Also on the Main Stage this year is a partnership between London Mozart Players and three Croydon based artists (SILVASTONE,Graver EkowandMee and The Band). This will be orchestrated by the amazingFiona Brice(who’s impressive CV includes collaborations with artists such as Beyonce, Placebo and Ed Sheeran). London Mozart Players is the UK’s longest established chamber orchestra. Known for its unmistakable British roots, the orchestra has developed an outstanding reputation for adventurous, ambitious programming.",
                "Born and raised in Croydon, we caught up with Silvastone in the lead up to his Croydon PrideFest performance. SILVASTONE is one of the UK’s most active Afrobeats artists/producers/songwriters. He is very active in his local community; in addition to running his own professional studiosWhite Hut Studios, he delivers a music workshop programme in local schools that engages young people in discovering and harnessing their creative talents. He also runs the successfulAfroboxnight at BoxPark.",
                "How did you get into the music industry?I grew up around music and discovered a natural gift of playing instruments from as young as 5 years old. I later pursued a career in the industry (influenced by my elder brothers – one was a DJ and the other a renowned video set designer/stylist for a lot of famous pop videos in the 90’s). I also have extended family members who were well known musicians including an uncle who wrote the Sierra Leone national anthem. I initially started as a DJ but one night all my vinyls were stolen from the back of my car so I took that as a sign to utilise my gift and get into music production. From there I developed my song writing skills by writing for numerous artists I was producing. In time, I decided to start keeping some of these songs for myself and soon transitioned into an artist too.",
                "Tell us more about your style of musicMy style is a combination of my  strong West African heritage coupled with my UK upbringing and international travels. African Beats, UK Streets Sounds plus Global Melodies.",
                "Afrobeats has risen in popularity in the UK in recent years. Why do you think that is?I think it’s due to many different reasons. The internet has certainly brought Africa closer to UK. We now have easier access to African content and other media outlets have jumped onboard. The second and third generation Africans born out here have also contributed. Many of them are embracing their African roots and proudly showing off their culture through music, fashion and travelling there. In turn – and vice-versa, their friends and other major influential celebrities have also been tapping into this new African cool and thus further amplified the movement.",
                "Who do you regard as the big players in the Afrobeats scene?The obvious names that spring to mind are Wizkid, Davido, Burnaboy, Sarkodie, Tiwa Savage, Mr Eazi, Yemi Alade, Fuse ODG etc who are all flying the flag globally and doing fantastic things. But, there are many others like me who might be just below that radar who are also breaking barriers, opening new opportunities and taking the sound and culture to new spaces.",
                "We hear you’re also responsible for the incredibly successful Afrobox nights at Boxpark Croydon. How did that partnership come about?Me and the team identified that despite the large multi-African community in Croydon and rest of South London there was absolutely nowhere for us to go to enjoy African music and vibes. And, when you consider many of the UK Afrobeats and related genres artists are from this area we were compelled to do something about it. Afrobox is very much about contributing to the culture and providing a platform for artists, DJs and those who want to attend a vibeful place and express themselves in great company.",
                "Can you tell us more about your Croydon PrideFest performance?I am soooooo looking forward to this one. It’s something I haven’t done before. The London Mozart Players approached me with the idea of orchestrating some of my music for this performance. I’ll have a 10 piece orchestra alongside my full live band of 5 and I can’t wait to share the vibe we’ve been working on. To my knowledge, no Afrobeats artist has done this before so it’s gonna be extra special.",
                "What are you most looking forward to about performing at Croydon Pride?As a Croydon boy myself I love performing in my hometown. I’ve never attended the festival before but I’ve heard great things. I look forward to seeing and vibing with the various members of the LGBTQ community.",
                "Who are you most looking forward to seeing at Croydon PrideFest?I think it’s a very exciting line-up of talent this year and am proud to be a part of it. I will try catch most of them but I am definitely excited about seeing my incredibly talented friend and former collaborator, Lady Leshurr, on stage. I love her energy. I haven’t seen her in Croydon since we worked together at my studio few years ago.",
                "Apart from preparing for Croydon Pride, tell us what else you’ve been up to lately?I’ve released my third EP, ‘Affirmation’ and it’s a 7 track celebration of my journey to date. It’s stories of love, tribulations and celebrations. Collaborators across the project include Fuse ODG, Ghana’s Sarkodie, Kwesi Arthur and Bisa Kdei. Nigeria is represented by London-based Ayo Beats and we travelled to Kenya to feature rising star Steph Kapella. I have a video for every song on there so please check it out and subscribe to my YouTube channel to see them all. In addition, I’ve composed music featured on a few films including title-theme music for a major US Box Office No.1 and most recently the Netflix Original series “Chilling Adventures of Sabrina”. I’ve also been busy taking my studio, White Hut Studios, into the local Croydon communities via various workshops aimed at young people. I’m proud of my Croydon roots and have shot a couple of my music videos here includingthis one.",
                "And what else can we expect from SILVASTONE for the rest of the year?I’m currently putting finishing touches to my next EP which I am very excited about. In between that, I am performing all over the place so look out for me on other stages near you soon and internationally. Follow me on the socials for all the latest antics and updates.",
                "For more information on SILVASTONE,click here.To follow SILVASTONE on Instagram,click here.To follow SILVASTONE on Twitter,click here.To follow SILVASTONE on YouTube,click here.For more information on Croydon Pride and PrideFest,click here."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Croydon Mela",
            "postTimeDate": "July 10, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with Anusha Subramanyam, dancer, choreographer, teacher and dance movement therapist to learn more aboutCroydon Mela.",
                "Croydon Mela is a celebration of Croydon’s diverse Asian communities, showcasing a combination of musical talent, dance and performance alongside local community arts groups and an array of food and craft stalls.",
                "Now in it’s third year, Croydon Mela will take place in Wandle Park on Sunday 14th July and is a free event for the whole community to enjoy.",
                "What does Mela mean?Mela is a Sanskrit word meaning ‘gathering’ or ‘to meet’ or a ‘fair’. It is used in the Indian subcontinent for all sizes of gatherings and can be religious, commercial, cultural or sport-related. In recent times “Mela” also popularly refers to shows and exhibitions. It can be theme-based, promoting a particular culture, art or skill. Generally in “melas” people can find eateries, entertainment activities, shops and games.",
                "What is your involvement in the Mela?I am working alongside two other talented (and Croydon based) female programmers (Chetna Kapacee and Malti Patel) which is incredibly rewarding and inspiring. I am programming theDance Dhamakastage, while Chetna is looking after theMain Stageand Malti has theMela Rung Zone.",
                "On the Dance Dhamaka stage, we will be doing a lot around ‘Rowdy Baby’ which became a music and dance hit on YouTube after being featured in Maari 2 (one of the biggest ever grossing Tamil language films). We are recreating the dance so everyone at the Mela can learn it and join in. I will be teaching the dance at various points during the Mela and anyone can join in and be part of the final performance at 5.30pm on the music stage. We have simplified the dance a little and really hope everyone from Croydon (Asian and Non-Asian) will take part.",
                "What else will be happening on the Dance Dhamaka stage?The Dance Dhamaka stage will present a mix of local and national dance companies and schools. The Mela is the perfect place to showcase wonderful local talent.  Local dance schools and teachers have been investing their time creating some really amazing performances. It will represent Croydon’s diversity and is also a great platform to showcase other companies that are presenting South Asian work in the UK. We will have Flamenco, Belly dance, Ghanian, Afro urban and much more to keep everyone moving!",
                "What will be happening on the Main Stage?Themain stagehas been programmed by the incredibly talented (and well connected!) Chetna Kapacee. There will be performances from the likes of Apache Indian (who has recorded with Sean Paul, General Levy, Shaggy, A. R. Rahman, Pras of the Fugees to name just a few and whose hit single “Boomshakalak” is featured in several Hollywood movies, including Dumb and Dumber). Dance music pioneer & trailblazing DJ Ritu, a dance music legend & trailblazing broadcaster, will be doing several sets whilst Project MishraM (a progressive carnatic fusion band from Bangalore) will bring an amalgamation of Indian classical music and western genres of music like rock, metal, jazz, reggae and electronic music to the stage. Also performing will be Najma Akhtar whose unique and distinctive style (fusing jazz with the ghazal, along with traditional bhajans) creates a beautiful marriage between the East and the West that is utterly compelling.",
                "What will be happening in the Mela Rung Zone?This has been programmed and curated by the wonderful Malti Patel. There will be lot of story-telling, activities for children, dance, poetry and music. She has planned such a huge range of things some will be a surprise to me too! All I can say is, it’s going to be an exciting program so come and be inspired on all that is on offer.",
                "How did you come to be involved in Mela?I runBeejawith my partner Vipul Sangoi and we have a long history of creating and  presenting dance in Croydon.  Beeja provides a platform to local dance groups, makes dance visible for local residents and helps make Croydon visible to the outside world. It all started six years ago when we moved to Croydon.  We caught the attention of the Council during Big Dance in 2016. Thanks to Paula and Paul (who have been instrumental supporting culture in Croydon) I have been curating the dance stage at Croydon Mela since 2017.",
                "What food and drink will be available?With so much action and activity, there is going to be a range of delicious food (showcasing Indian and South Asian cuisine) that will satisfy all palates and keep the energy flowing! From Rendang thank you Maam, The Spice Yard and Da Ja Streetfood to En Root, Red Cherry Takeaway and Pizza in Giro, there is something for everyone. The Cronx Brewery, Pimms tent and a slushie and milkshake van will also be there to keep thirst at bay!",
                "Who are you most looking forward to seeing at this year’s Mela?For me, what I’m really looking forward to is getting all of Croydon dancing to Rowdy Baby! It’s a wonderful way to get people moving and for people to share a moment of fun together.  I am really excited to be working with two very special groups (‘Indian women in London’ and the ‘Croydon Carers Group’) who have agreed to dance the Rowdy Baby with me to help teach others.",
                "Who is the Mela aimed at?This is fun event and there is something for everyone. At the Dance Dhamaka stage, we will have a huge amount of group participation. So for people who love dance, it’s definitely for them, but for people who haven’t tried it before then this is a great opportunity to give it a go! The Mela Rung stage will have storytelling, poetry and lots of activities for children and the Main Stage will have some of the best South Asian popular music to get everyone rocking to. With plenty of music, food and people, I would encourage absolutely everyone to come and join the fun at the Croydon Mela!",
                "What other events have you worked on in Croydon?As Beeja we curate and programmeDance Festival Croydonwhich is funded by Arts Council England, Croydon Council and a Dance Umbrella​ partnership. Our next event is on 20th July at Stanley Halls. We have three amazing companies presenting their work: The Urban Play Ground, Jose Agudo ​and Uchenna Dance. You can book your tickethere.",
                "Who are your favourite dancers and dance companies you have worked with?Oh, where to begin?! Jose Agudo, Slide, Upahar Dance Company, Vinicius Salles Dance, Paurnami Arts. But there’s so many more so come to the Mela and Dance Festival Croydon to discover them ! Also worth a mention isDance Umbrella; London’s annual International Dance Festival that celebrates 21st Century choreography across the Capital. They are celebrating their 40th anniversary this year and are partnering with Beeja and Croydon Council.",
                "For more information on Croydon Mela,click here."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Banksy",
            "postTimeDate": "October 1, 2019",
            "Text": [
                "Wow, what a day! For those who haven’t picked up on Twitter’s trending topic… in the early hours of this morning, what appeared to be a Banksy installation, arrived in Croydon.",
                "Yep, that’s right, one of the most influential and divisive artists of our time, had apparently hit up the Cronx. But it was not (just) with one of the stencil art pieces he is arguably most famous for.",
                "Located on the corner of Church Road and Frith Road (below the Pure Gym), the ‘Gross Domestic Product’ homewares store showcased a variety of his art works (seemingly dressed up as items for sale).",
                "By 9.30am, the 5 shop windows, all loosely themed around different topics, were gathering increasing interest from passers-by. All the items were labelled with barcodes and awebsite addressenabling people to buy online. Although at this point in the day, it led to a holding site that simply said ‘hello gdp3’.",
                "Social media feeds of locals highlighted a few of the stand out pieces including:",
                "The VestWhether the real deal or a replica, the vest worn by Croydon artist Stormzy when performing his headline set at Glastonbury this year, was always going to be a popular frame of reference for local residents. The label explained that it was “A version of the John Bull English gents waistcoat updated for modern times” and that it was “worn by Stormzy at Glastonbury (because its very dangerous there)”.",
                "The TombstoneAlways an uplifting site to see on the morning commute (!), the tombstone was annotated with “What do you get for the person who has everything? A 230kg reminder that you can’t take it with you. Hand carved by Banksy in Portland Stone”.",
                "Baby MobileAny sense of innocence at the sight of an infant’s crib was soon eradicated on closer inspection. The baby mobile hanging above it was made out of CCTV cameras, representing “a lifetime of constant scrutiny both state sanctioned and self-imposed”.",
                "Early Learning Counting SetSimilarly, the children’s toy (cleverly positioned at child’s eye level) also took on a more sinister meaning with explanation. “Engage all your child’s learning muscles with this fun counting game. See how many figures they can fit in the truck while it makes a quick stop. Proceeds from the sale of this item are used to support migrant rescue missions in the Mediterranean.”",
                "ClockPossibly the most recognisable of Bansky works, this series of clocks were complemented by a new piece of street art outside the store. “Upcycled from an office supplies store, this timepiece features a trademark Banksy rat and is suitable for home, office or Home Office. The precision mechanism requires 1 x AA battery to accurately mark our relentless and steady ticking towards the great unknown”.",
                "As locals buzzed around outside, questioning what was going on and if it was indeed the real Banksy at work, an onlinearticle in The Independentwas the first to be published to shed some light on the project:",
                "“What appears to be a new Banksy installation has been spotted in South London. The work appeared in a formally derelict site beneath a PureGym in Croydon and displays a number of different “rooms”.",
                "As the afternoon rolled on, with security working out how to best manage the building and the gathering crowds, Banksy confirmed via Instagram (to his 6 million followers) that it was him who was behind the project:",
                "Other National media subsequently jumped on the story quoting Banksy’s official media statement surrounding the reason behind the new ‘store’. “{my motivation for this venture} is possibly the least poetic reason to ever make some art. A greetings card company is contesting the trademark I hold to my art and attempting to take custody of my name so they can sell their fake Banksy merchandise legally. I think they’re banking on the idea I wont show up in court to defend myself.”",
                "Mark Stephens, an arts lawyer and founder of the Design and Artists Copyright Society, has been advising Banksy on what he describes as “frankly ludicrous litigation”. He explained that “Banksy is in a difficult position because he doesn’t produce his own range of shoddy merchandise and the law is quite clear- if the trademark holder is not using the mark, then it can be transferred to someone who will”. As a solution to the issue, Mr Stephens advised Banksy to begin his own range of merchandise and open a shop.",
                "And so Gross Domestic Product was born.",
                "Apparently items will be on sale online “from £10” although “availability will be limited”.",
                "Regardless, art fans will be able to visit the physical store for the next two weeks to see the windows and there’s no doubt this is a massive coup for Croydon that will see thousands of people flock to the neighbourhood. That’s something we can all Bank(sy) on.",
                "To see more photos, follow our Instagram Story on@EastCroydonCool."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/10/img_5561.jpg?w=224&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/10/img_5563.jpg?w=224&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/10/img_5546.jpg?w=224&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/10/img_5560.jpg?w=300&h=225",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2019/10/img_5543.jpg?w=224&h=300"
            ]
        },
        {
            "Title": "East Croydon Cool talks…Sustainability",
            "postTimeDate": "May 23, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with Alex Stewart, Croydon resident and Co-founder ofOneNine5.",
                "With a passion for travel and the warnings of Sir David Attenborough ringing their ears, the founders of OneNine5 are on a mission to design eco-conscious luggage with the style and functionality that matches the needs of the modern traveller.",
                "What is OneNine5?We’re a start-up luggage brand based in East-Croydon, we launched a couple of months back and we’ve given the wash bag (toiletry bag) a much-needed upgrade. The most common question we’re asked – “Why OneNine5?”. We’re named after the 195 countries of the world and want to encourage exploration and adventure. In light of the plastic crisis, we’ve also made it a priority to reduce our environmental impact in our practices.",
                "Sustainability, Eco Conscious, Green, Environmentally Friendly…what’s with all the buzz words?I hear a lot of people referring to sustainability right now. You can think of sustainability in three areas: economic, social and environmental. Of all the terms, we feel most comfortable referring to what we do as ‘Eco-conscious’. Our interpretation of this means we’re trying to do all we can to be aware of how our actions/decisions could impact the environment…but we’re not perfect and we can always explore ways to be better.  I think people are baffled by all these terms and there’s a feeling that this confusion is used for marketing gains by larger brands. It’s called, ‘Greenwashing’ and on social media, I commonly see this word aimed at fast-fashion brands. For example, if a brand is addressing one area of sustainability but at the detriment of another, it’s angering people.",
                "What made you want to set up an eco-conscious brand?Like most who are trying to do their bit right now, we felt compelled as consumers to try and reduce our consumption of single-use plastics after watching Sir David Attenborough’s, Blue Planet II. Interestingly, this call to action has been so impactful it’s now dubbed ‘The Attenborough Effect’. I’d have that sense of guilt as a shopper if I was using a single-use plastic bag at the supermarket or buying a bottle of water.  I then read a book by Lucy Siegle called, ‘Turning The Tide on Plastic’. Lucy suggests that to stem the plastic problem, people need to own a certain industry or area to drive that change. As a passionate traveller, I realised that the grocery industry, FMCGs and cosmetic brands were (rightly) under pressure to reduce their use of single-use plastics, but the travel/ luggage industry didn’t seem to face that same push.",
                "What made you decide to focus on travel luggage?In addition to this sense of responsibility I had to ‘do my bit’, I also had a bit of a light bulb moment when I was stood at airport security. I noticed the crazy proportion of air passengers that still grab single-use plastic liquid bags in the airport. The same people that would feel that guilt of using a 5p bag in a supermarket, didn’t feel that way at airports. In recent years we’ve seen cool luggage brands emerge that have upgraded the suitcase with things like built-in chargers, but I started to research and realised that the wash bags on offer felt outdated and they didn’t really represent the modern traveller. Most options on the market were very gender specific and we want to challenge that concept and build a well-loved unisex brand.",
                "Do you have much experience in the e-commerce world?I’m fortunate that my fellow Co-founder is from an e-commerce/branding background but personally, I spent 6/7 years working in commercial roles at a couple of big US tech companies. Given my experience, I’m forever looking at how to improve the way we work by implementing smart and innovative technology. Rather than write the traditional business plans we built the business in Dropbox Paper to enable remote working. We’re also currently using a cloud-based tool called Sellics to ensure we’re optimising our products on Amazon.",
                "Why are Gen X, Xennials and Millennials more environmentally conscious?The world’s become a smaller place and because of that, we feel a sense of responsibility beyond our own town/city. Historically, an issue faced by a small coastal town in the Philippines would go unreported and our grandparents would be blissfully unaware of this. With social media, a video of plastic polluting waterways can go viral in hours, we’re able to arm ourselves with the information and connect to like-minded individuals to do something about.",
                "The growth and adoption of Instagram by this demographic has also been a big catalyst for a change in travel trends. I can hear Generation Xers tutting in dismay as I type this but an Instagram feed is no longer a collection of images, it’s a reflection of who you are and what you stand for. These demographics want to seek out a new adventure and be the first amongst friends to find that new killer location to Instagram. The social currency of ‘Instagram likes’ and this vanity helps drive this environmental awareness so Instagram’able places remain, Instagram’able.",
                "Instagram heralded the death of the 18-30s type holidays that were stopped in October last year. It’s no longer cool to fly to a resort in southern Europe, drink an unhealthy amount of cheap alcohol and fly back to the UK more pale than when you arrived there. You’d get a load more likes on your Instagram feed if you’re at the top of a mountain with an amazing view or you’re diving with turtles.",
                "How did you go about creating an eco-conscious product?In our case, we asked for lots of help. We started with the idea – we wanted to reimagine the wash bag but had no idea how to actually make this happen. We spent several months contacting and speaking to UK based product designers. With criteria to assess each product design agency, it was immediately obvious that we wanted to work with the team atMorramabased in Shoreditch, East London. We felt confident their team could educate us on environmentally sustainable practices but still design contemporary and functional products that people want to use.",
                "Aside from the product itself, is OneNine5 addressing other eco efforts?We’ve given the packaging the same attention we’ve given the wash bag. Firstly, we’ve tried to keep the packaging to a minimum so we’re not creating excess waste. It’s well reported that local councils are already struggling to actually recycle all the materials they collect. All our packaging is made from either recycled or biodegradable material – and fully recyclable too.",
                "We’ve also implemented a first of its kind recycling scheme in the luggage industry. Our wash bag is built to last and we want our customers to make sure it’s well used. Yet when the time comes for an upgrade, our UK customers can post their OneNine5 wash bag back to us free-of-charge, with our commitment to ensure the materials are reused or recycled. We’ve also partnered withreGAIN Appas another option for our customers to ensure the materials from their old OneNine5 wash bag won’t end up in landfill or our oceans.",
                "What’s the biggest misconception surrounding Sustainability?I really think we’re at a tipping point now where being proactive to tackle the plastic crisis is a view shared by the majority rather than the minority. Thankfully, the perception has changed – historically, this was a concern reserved for people in beige linen and sandals. My big annoyance right now is this sense of ‘guilt marketing’ that some brands or influencers are adopting. Unless you eat a vegan diet, lead a plastic-free lifestyle and don’t do weekly beach cleans, you’re a bad person. People need to be encouraged to make small changes to their lifestyle that are actually achievable to maintain rather than some radical lifestyle change. Doing something is better than doing nothing",
                "What brands are you inspired by?I thinkParleyhave done an incredible job of partnering with brands like Adidas and Corona to ensure the plastic crisis has become a mainstream problem we all care about now. The ‘Wave of Plastic’ they created last year on Old Street was super impactful.From a product perspective, I admire what Australian brand,Bellroyhave done. When they started out, they focused on an update to the wallet both in terms of style and the internal functionality. I think we can learn a lot from their approach and growth.",
                "For more information on OneNine5 check out their websitehere. Or to win one of their wash bags, take a look at our Instagram competition."
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Croydon Pride (Part 1)",
            "postTimeDate": "June 26, 2019",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with Alexandra Sawyer-Hudson fromMee and The Band, one of the performers at this year’s Croydon PrideFest taking place duringCroydon Pride.",
                "Having started in 2016, Croydon PrideFest is now London’s second largest Pride Festival and has become firmly marked in south London’s LGBTQ+ calendar of events. Croydon Pride strives for LGBT+ tolerance and equality within Croydon’s diverse communities by staging inclusive events.",
                "The organisation receives no core government funding and funds are instead raised in a variety of ways including donations, sponsorship and fundraising events. Croydon Pride 2019 is taking place on Saturday 13th July and incorporates a Parade through the town centre, PrideFest and an after-party.",
                "Croydon PrideFest 2019 is the biggest and most exciting yet with not one, but two stages. The new cabaret stage will host smaller, more intimate performances. 2019 will also offer the biggest and best line-up to date, includingLady Leshurr(British grime and hip hop rapper),David McAlmont(Croydon born vocalist who has supported Morrissey on tour),SOJU(from RuPaul’s Drag Race Season 11),Danny Beard(winner of Drag Idol UK),Batty Mama(the UK’s largest organisers of black queer club nights) andAsifa Lahore(Britain’s first publicly out Muslim drag queen).",
                "Also on the Main Stage this year is a partnership between London Mozart Players and three Croydon based artists (Silvastone,Graver EkowandMee and The Band). This will be orchestrated by the amazingFiona Brice(who’s impressive CV includes collaborations with artists such as Beyonce, Placebo and Ed Sheeran). London Mozart Players is the UK’s longest established chamber orchestra. Known for its unmistakable British roots, the orchestra has developed an outstanding reputation for adventurous, ambitious programming.",
                "Born and raised in Croydon, we caught up with Alexandra (the lead singer and creative director of Mee and The Band) in the lead up to their Croydon PrideFest performance.",
                "When did you set up Mee and the Band?In 2011 I was just called ‘Mee’. I won the Live and Unsigned competition (where 100 best acts in unsigned music perform in front of a capacity crowd and a panel of industry judges) and ended up singing at The Proud2 stage in theO2 arena for the finals!",
                "What’s the ethos behind the band?I have had my fair share of trauma and the main thing that got me through it was self love. I’m talking about the kind of kindness you need to bestow on yourself when you are alone or suffering abuse or extreme isolation, depression anxiety. Be your own mother best friend (lover 😉 ) Self love can literally break your interaction and reactions within unhealthy relationships, it has the power to change so much outside of yourself once you change your own patterns of shame, guilt, blame, hate and disempowerment. It is a practise and combination of so many things a holistic view of nurturing the self. Years of self prescribed therapy has proven to me if I do the work, I will get results. I believe in the power of self love – which is why I love me, or rather #ilovemee",
                "Can you tell us more about your Croydon PrideFest performance?If people can be directed toward my social media accounts,  I have some amazing photos of our last show. If you have ever seen us live, you’ll know we are a true spectacle! We come from a theatrical background, and bring a taste of the old school festie vibe with full blown costumes and headdresses! I am even in discussion with the London Mozart Players to see if I can get their 10 piece ensemble to wear my crazy headdresses!",
                "We hear you’re also taking part in London Pride?I am! My friend Teresa Weller has been working with the Pride family in London for years, she told me to enter the #PridesGotTalent2019 competition and I won a place at the finals and performed on the West End stage at The Apollo Theatre in Shaftesbury Ave! @LaytonWilliams (who plays Jamie in the ‘Everybody’s Talking About Jamie’ Apollo show) was judging! Then another friend told me about the Croydon Pride competition to find an artist who had an appropriate anthem or song to orchestrate, and my song WE ARE ONE was chosen so now I find myself working with the incredible London Mozart Players!",
                "Where do you get your inspiration for both your music and music videos?I write songs on Granny Vicky’s piano, when the inspiration hits me it could be in the middle of the night and I have to sneak out of bed to sing into my voice recorder or I can’t go to sleep, or scribble lyrics on a napkin while I’m in a café or on the train. You have to be ready to catch the creative will-o’-the-wisp and act on it! Our music videos (like taking a walk in my brain) are a bit like TeleTubbies on LSD! (Footnote: Mee And The Band do not condone the use of recreational drugs – we ourselves are high on Spirulina!)",
                "Who do you admire in the music/creative industry?Any creative that keeps going regardless! If we are blessed enough to not have war on our doorstep, or natural disasters etc, then live the life you have been given! Who do I admire?…Kate Bush, Katy Perry, Bjork, Erykah Badu, Jill Scott, Emelie Nicholas the list really does go on and on – oh and my favourite new band is SuperOrgansim (I want to tour with them).",
                "What are you most looking forward to about performing at Croydon Pride?Mee AND The Band are looking forward to representing Equality and Kindness. Standing side by side with iconic pillars of our community like Asifa Lahore is huge! I grew up in Waddon Beddington. Wandle Park is where my kids played growing up, so making new memories and gathering all people (not just LGBT+ community) but all those that believe in freedom and human rights is really exciting. Croydon is the centre of the universe and has the potential to become as large as London Pride!",
                "Who are you most looking forward to seeing at Croydon PrideFest?SOJU without a doubt! I need to get her to sign my headdress! And maybe my mother in law (who has no idea what I do!) but it’s all happening on her doorstep so I can’t wait for her to see it all unfold (and see me on stage!)",
                "What is your greatest wish for Croydon Pride?That people read this, go to my link in my Instagram or look up our anthem WE ARE ONE and sing along on the day; it’s proper Eurovision Fun!",
                "For more information on Mee and The Band,click here.For more information on Croydon Pride and Croydon PrideFest,click here."
            ],
            "Media": []
        }
    ]
}