{
    "site_url": "https://eastcroydoncool.co.uk/",
    "site_title": "EAST CROYDON COOL",
    "site_description": "A Curated Guide to all things Cool in The Cronx",
    "AllContent": [
        {
            "Title": "East Croydon Cool talks…Gig Buddies",
            "postTimeDate": "October 19, 2020",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up with Cherilyn Yeates, the Project Manager atGig Buddies Croydon.",
                "Gig Buddies matches adults with learning disabilities to volunteers who have similar interests to go to events, gigs & activities together. Gig Buddies aims to ensure that people with learning disabilities don’t miss out on a social life. The project helps to combat social isolation faced by many people with learning disabilities, by enabling people to make friends who have a similar interest to them.",
                "Gig Buddies Croydon is run by local charity Club Soda and is currently the only organisation in London running Gig Buddies. The Croydon project has attracted around 30 volunteers and buddies but they’re looking for more! We caught up with Chez to find out more about what’s involved.",
                "When did Gig Buddies start?Gig Buddies was started in 2013 by Sussex charity, Stay Up Late. The charity was founded to fight for the rights of people with learning disabilities to ‘stay up late’, have access to gigs and events in their community and not be restricted by support worker shifts when out socialising. Gig Buddies was a practical solution to the inflexible support that many people with learning disabilities face; by matching someone with a volunteer who has similar interests so they could stay out as late as they want and have more freedom, choice and independence. Stay Up Late eventually grew the project by creating a franchise, boxing up the Gig Buddies project and trialing it in different areas of the country (even Sydney Australia!)",
                "How long has it been operating in Croydon?After a pilot year in 2017, Gig Buddies Croydon officially launched in April 2018 and we have just celebrated our first year anniversary!",
                "How does it work?Volunteers and Gig Buddies come find us online or through word of mouth. Volunteers are interviewed, DBS checked and complete volunteer training. Both Volunteers and Gig Buddies attend our social events to meet new people and get to know the community we have built. We will also host smaller socials with potential pairings to see how people get on. We take our time to match people on their shared interests or personalities that vibe well. It’s a careful process and we always make sure the pair have met a few times to ensure they are both comfortable and to create long lasting friendships.",
                "What events have you done in Croydon?Pre-covid – at least once a month, we host a social at a local cultural venue for everyone to meet up, chat, get to know each other and have fun. Venues we have been to include The Oval Tavern, The Ludoquist Cafe, FunHouse, Stanley Halls, Limitless VR and loads of other cool places.",
                "Do Gig Buddies groups from around the country ever get together?We have partner days once a year where all of the projects come together to discuss what they have been doing, share stories, brainstorm and work through any issues. During lockdown we collaborated on a 12 hour online festival where all the projects had a slot to play music, sing, dance or whatever! Minus a few technical hiccups, it was pretty radical!",
                "How did you manage during lockdown?It’s been tough for us, as it has for everyone. Our whole project is based around exploring local nightlife, making connections and having an active social life – so it was hard to see how we could stay connected in a lockdown and keep our community engaged. We started by creating a weekly newsletter to share activities people could do online and keep a conversation going with our Gig Buddies. We then began to run online social events, one bigger event every 3 weeks and a coffee morning catch up on Zoom every 2 weeks. We have been able to build a dedicated group of people who attend and the attendance actually seems to be increasing as time goes on.",
                "It seems like friendships within the wider community have grown stronger through the Zoom events, and we’ve seen some Gig Buddies becoming much more confident. It’s been crucial for us as a team as well, to keep connected with people and have some fun in these strange times. Our online events have included online discos, a pub quiz, dress up guess who game, arts and crafts in collaboration with Collage Club London, karaoke nights and more wild nights! We have been able to start matching new pairs virtually as well, and have matched 2 new pairs of buddies, which is really exciting as we didn’t think this was going to be possible.",
                "What do you look for in a volunteer?Firstly we look for someone who is Croydon based or in the surrounding boroughs and is over 18. You don’t need any particular experience to be a Gig Buddy Volunteer, but we look for people that:",
                "are kind, patient and friendly with a sense of humour",
                "are willing to get to know somebody well",
                "love meeting new people",
                "care about social inclusion",
                "are proactive and reliable",
                "love to have fun!",
                "What has the feedback been from buddies?I think the best way to answer this, is for you to hear it straight from them! Over lockdown we asked some of our buddies to record themselves talking about their matches, what they get up to and the importance of their friendship. You can watch all the videosHERE.",
                "What is the future of Gig Buddies?We have funding secured until 2022 so until then we will be continuing to match new pairs of buddies, host fun socials and connect people with and without learning disabilities in Croydon to create a more diverse and inclusive local nightlife. We will be applying for funding to continue after that time! For now, we are taking it day by day in terms of the lockdown and continuing to deliver online events to keep our buddies engaged and continue to grow the strength of our community.",
                "How does and interested Gig Buddy or Volunteer get in touch with you?If you or someone you know has a learning disability and is based in Croydon, want to meet new people, grow your confidence and independence OR if you are interested in volunteering with Gig Buddies Croydon, are excited by the idea of making a new friend and supporting them to be able to access new opportunities…you can get in touch with us by emailingcherilyn@gigbuddiescroydon.co.ukor find out more atwww.gigbuddiescroydon.co.uk"
            ],
            "Media": [
                "https://www.youtube.com/embed/-DcvQgzc91Q?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3965.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3966.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3967.jpg",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3968.jpg",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3969.jpg?w=740",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3970-e1603115881335.jpg",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/img_3971.jpg?w=740"
            ]
        },
        {
            "Title": "Newsflash: Croydon community comes together to offer #FreeSchoolMeals support",
            "postTimeDate": "October 25, 2020",
            "Text": [
                "After this week’s news that the government will not be offering free school meals support to cover the holidays, we think Nigella Lawson has summed the situation up the best with this line:",
                "“It shouldn’t have to be this way, but it is more important to feed a hungry child than argue about how it’s done”.",
                "In what is an economically difficult time for everyone, it’s been incredible to see so many Croydon businesses and organisations rally together to offer support to parents struggling to feed their children at this time.",
                "Below is a list of places who are offering help. Let us know (via social media or email) if you hear of any others, and we’ll be sure to include.",
                "Ayat LoungeFrom Mon 26th to Sat 31st October, Ayat Lounge, a Lebanese Mediterranean restaurant in Croydon’s South End, will be giving children meals for free between 1pm and 3pm.For more info about Ayat Lounge,CLICK HERE",
                "Bella’s Tea StoreSpecialising in picnic style boxes (including Grazing, Afternoon Tea and Vegan boxes), Bella’s Tea Store in Coulsdon has been running a coffee ‘Pay It Forward’ scheme since opening. They have extended this so people can now buy a children’s lunch box (and Bella’s will then include a free adult lunch with it).For more info about Bella’s Tea Store,CLICK HERE",
                "BombayliciousThis Indian take away which has only been open for 6 months, is also stepping in to offer support. They’ll be offering free meals of rice and curry to children who normally receive free school meals. To ensure socially distanced pick ups, parents are advised to place orders for collection between 4pm and 6pm on Tuesday to Friday.For more info about Bombaylicious,CLICK HERE",
                "Boxpark CroydonHome to a huge variety of innovative street food traders, Boxpark will be providing 200 free meals to school children over half term.For more info about Boxpark Croydon,CLICK HERE",
                "Brown and Green CafeDuring half term, this group of brunch cafes (including their Crystal Palace branch) are offering one free kids meal with every adult meal purchased (but if your child receives free school meals, no purchase will be required).For more info on Brown and Green Cafes,CLICK HERE",
                "CommuniteaThis independent cafe on a social mission is serving nutritious hot meals to children this week. If you want to help them, you can donate via this link:www.communitea.co.uk/donate.For more info on Communitea,CLICK HERE",
                "Coughlans BakeryThis artisan bakery with a huge vegan range is selling post it notes for £5. People buying the post its then leave them on the shop windows for families in need to collect. The person who redeems the post it is then given a free family meal (and Couglans will also gift them a free plant based sausage roll).For more info on Coughlans,CLICK HERE",
                "Crushed BeanHaving initiated this offer in the Summer holidays, Pam and the team are continuing to serve up free hot breakfasts to children every weekday until 11am during school holidays.For more info on Crushed Bean,CLICK HERE",
                "Curry on NaanstopThe Mumbai Street Food experts (who live in Croydon!) are stepping in to feed hungry children with their takeaways this half term. Contact Swati via direct message for details of how to arrange.For more info on Curry on Naanstop,CLICK HERE",
                "Dirty CrunchBased out of the Royal Standard Pub, the sisters who own Dirty Crunch are offering free re-heatable school meals to anyone who needs them during half term and the festive season (including weekends). Simply let them know in advance (by telling them via email or direct message on social media your name and number of children you’re supporting).For more info about Dirty Crunch,CLICK HERE",
                "Karis with LoveKaris Anderson, who specialises in vegan food, is delivering free meals to Croydon/Beckenham based families in need during half term. Send her an email or DM on socials for plant based, nutritious meals.For more info about Karis with Love,CLICK HERE",
                "Matthew’s YardFrom their new West Croydon premises, owners Saif and Leonie are offering up to 250 free meals (eat in or take away) for local children who need them as well as 50% discount for parents or child carers for their own food if they eat in.Eat In: Kid’s burger and fries with a glass of apple or orange juiceEat In or Take Away: Cheese and tomato sandwich, banana and packet of crisps with a glass of apple or orange juiceFor more info about Matthew’s Yard,CLICK HERE",
                "Light Bar CaffeThis cafe come cocktail bar in Coulsdon is serving free meals to ALL children from Tuesday to Sunday during half term.For more info about Light Bar Cafe,CLICK HERE",
                "South Norwood Community KitchenHaving started in 2016, the team use the unloved food to bring the community together in a variety of ways including events and food delivery parcels. They take food donations from supermarkets, shops and restaurants and create delicious meals for people across Croydon including families in need during the school holidays.For more info about South Norwood Community Kitchen,CLICK HERE",
                "Spanish TownBased out of the Dog and Bull pub on Surrey Street, Chef Arron and the team will be offering free meals for kids during the holidays. Full details to be announced next week.For more info about Spanish Town,CLICK HERE",
                "Spice VillageThe award winning British Pakistani restaurant group (with a branch in Croydon) is offering free meals to all children who usually receive free school meals. Simply email them on cs@spicevillage.co.uk or call 020 8680 8844 to claim and collect your free meal.For more info on Spice Village,CLICK HERE",
                "The Little Coffee ShopBased on Sanderstead Road, The Little Coffee Shop is offering free school lunches to those who need them during the half term holidays. Simply text them on 07835024690, direct message them on socials or pop in after 11am on Tues to Saturday when there will be a few out for collection).For more info about The Little Coffee Shop,CLICK HERE",
                "Yoke EasyThis new brunch spot on Surrey Street Market is offering to pay for five famillies weekly food shop during half term. If you have children of school age and are worried about how you’ll feed them this week, DM them.For more info about Yoke Easy,CLICK HERE",
                "Yumn BrasserieDuring half term, this relaxed fine dining restaurant is offering free brunch and dinner for children when accompanied by a paying adult.For more info about Yumn Brasserie,CLICK HERE",
                "Also a shout out to:LaborjeeGrace is a Croydon based baker who is making a big batch of Banana Loaf cakes to deliver to old and vulnerable people in the local area over the coming months. Get in touch with her to nominate someone to give a loaf to.For more info on Laborjee,CLICK HERE",
                "Your CroydonCroydon Council have become one of 28 London boroughs defying the government by arranging for those children who normally receive free school meals to continue to be fed over the half-term holiday. No official statement has been made yet but a post on their Twitter feed on 24 October said:“If your family usually receives free school meals and you’re struggling during half-term, you can apply to our schools team for supermarket vouchers. Contact educationenquiries@croydon.gov.uk“."
            ],
            "Media": []
        },
        {
            "Title": "Project Three: The £1 Thumbs Up",
            "postTimeDate": "March 27, 2020",
            "Text": [
                "We are working onvarious projectsto help support the Croydon community at this time.",
                "The£1 Thumbs Upis a simple fundraising campaign to encourage East Croydon Cool Instagram followers (ideally all 6600 of them!) to donate £1 toNHS Croydon Health Services.",
                "“Croydon Health Services Charitable Fund(The Fund) was set up some years ago under the former name of Mayday Healthcare Charitable Funds to receive and administer donations and legacies generously given by patients, local residents and local groups.Our mission is to raise money to enable Croydon Health Services to provide world-class care for its patients and their families and to improve the care and facilities we offer by: contributing to the refurbishment of different areas in the hospital, funding the most up-to-date equipment, supporting research and providing the best possible services for our patients and families”",
                "We hope that by keeping it to just a £1 donation* ALL of our followers will be able to join this campaign to help NHS Croydon Health Services to fund“improvements in their care, specialist equipment and investments in cutting-edge technology and facilities to deliver the very best for people in Croydon”.",
                "If you can take part, it’s a simple 3 step process:",
                "Step One:CLICK HERE(to make the actual donation: you can donate money to a specific purpose, ward or department or simply the ‘General Amenities Fund’)",
                "Step Two:CLICK HEREto complete the Gift Aid form (to allow the Trust to claim an extra 25p from your donation)",
                "Step Three: Confirm you have donated (and help us track donations) by leaving a THUMBS UP emoji in the comments of the East Croydon Cool Instagram postHERE.",
                "(*obviously feel free to donate more if you wish!)"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…E-Bikes",
            "postTimeDate": "June 30, 2020",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. With social distancing set to be part of our new normal, the search for alternative travel solutions has resulted in a huge increase in sales for both electric and manual bikes. So this month, we chatted with the founder ofEnergise E-Bikes(a pioneer in electric bike retail who now offers the largest range of e-bikes in the country) and who started the business right here in Croydon!",
                "The moment founder, Ray Wookey, tried an electric bike for the first time, he realised just how transformative this new technology could be. Being able to set off from home and complete a journey in comfort without having to worry about traffic jams, train cancellations or parking problems was a revelation; not to mention enormous fun!",
                "He could see that commuters who had seen train ticket prices rise and rise over the years could use e-bikes to get to work cheaply and quickly. People who had long given up cycling could start riding again with confidence, knowing that the e-bike would help them throughout the ride. Leisure riders, tired of the same old cycle routes could expand their horizons and go further and do more.",
                "Ray was so inspired by the e-bikes that together with a business partner, he began selling electric bikes in 2012 via a small retail outlet in Coulsdon called Cycling Made Easy. The interest in electric bikes grew so much that the store soon had to expand; moving to a 2000 square foot, purpose-built showroom which happened to be on the London to Paris cycle route; a route that a team from Cycling Made Easy have completed using e-bikes!",
                "In 2019, Cycling Made Easy was renamed to Energise E-bikes to reflect the life-changing effect the products had on their customers. Today, Energise E-bikes has the widest range of electric bikes of any retailer in the UK from small, folding electric bikes, to Dutch-style stepthrough e-bikes, to full-suspension off-road e-bikes.",
                "What is an electric bike?Imagine going on a bike ride but no matter where you went you had a helpful tailwind pushing you forward. Imagine how much fun that journey would be. Imagine how much quicker you’d arrive somewhere. That’s what an electric bike ride feels like.",
                "Electric bikes (or ‘e-bikes’) are bicycles with an added motor which boosts your pedal power with lithium battery power. It’s a bit like a microphone for a singer. A singer sings loud, quiet, and everything in between, while the microphone amplifies the power of their sound. An electric bike is similar. The rider pedals hard, pedals soft, and everything in between, while the motor and battery amplifies the power of their pedalling. You can turn up and turn down this electrical assistance to the level that you want.",
                "If you’re riding uphill, you’ll be able to pedal up without putting a dangerous strain on your heart, muscles or joints. If you’ve got a long journey ahead, you can use that extra energy to make sure you get to your destination feeling fresh rather than becoming a sweaty mess. If you’re carrying shopping, the extra energy is there to help you haul the load back home.",
                "Essentially, you’re riding with the power of two people. An e-bike is not, however, a moped. If you want the extra power, you have to pedal. It’s not a free ride but it is certainly a fun ride.",
                "What makes Energise E-bikes different from the competition?I think people are reassured to have experts on their high street. Energise E-bikes is a specialist retailer with a bricks-and-mortar premises where people can test-ride the bikes and ask a human their questions.",
                "We also offer free lifetime servicing which no other bike retailer in the country offers. We know buying an electric bike is a big purchase. We can help people get a long life out of them with free annual maintenance.",
                "Not only that but we practice what we preach. Most of our staff ride an electric bike into work. It keeps us energised and our carbon footprint low. And it means we can advise people from personal experience.",
                "Most bike retailers would stock a couple of electric bikes but every single bike you see in our showroom is an e-bike. In fact our expertise was recognized by the bike industry as a whole when we were nominated for ‘Best Specialist Retailer’ in 2017 at the BikeBiz Awards and we are also one of only ten places in the country to be listed as a Bosch E-bike Expert.",
                "How did you get into the e-bike industry?The seeds of Energise E-bikes were planted when I was still running a former business. While exploring where my staff commuted from, I found many lived in hilly, traffic-choked areas. I looked at electric bikes, which presented the solution but back then, when e-bikes were simply watered-down mopeds, the quality disappointed me.",
                "However, when I sold my business in 2008, e-bike design and quality had vastly improved. They were lighter, quieter, smoother to ride and they looked great. The market on continental Europe was booming but had no strength here in the UK.",
                "I thought we could be pioneers in the market. So we took the plunge first with a small unit on Chipstead Valley Road in Coulsdon and called ourselves Cycling Made Easy. Now we have a 2,000 square foot showroom on Brighton Road and we’ve rebranded as Energise E-bikes to reflect how our products makes people feel: energised!",
                "What are the benefits of using an e-bike?E-bikes can go where cars aren’t allowed, where walking would take too long, and where a conventional bike would struggle. Most of all, they are incredibly fun to ride. Many people say it feels like the way cycling felt when they were a kid – a real sense of freedom and possibility.",
                "Most of our customers use their bikes for exercise and leisure, using the extra energy to help them do longer more ambitious rides, so they get to see so much more of the ‘hidden’ green spaces our country has to offer. For example, did you know that there is a National Nature Reserve here in the south of the borough? It’s perfect e-biking territory. There are so many natural beauty spots like that in this country and sometimes the only way to explore them is on an e-bike.",
                "The customers who commute on their e-bikes are able to get to work without needing to shower on arrival and they can usually guarantee their journey time as well.",
                "Are they expensive to buy/run?E-bikes are a long-term investment but incredibly cheap to run. Per year, we estimate it will be around £5.20 to keep the battery charged. You wouldn’t get much petrol for £5.20 these days! Plus of course Energise E-bikes give you an annual service for free.",
                "If anyone is thinking of buying an e-bike, please, please do not buy one which is similar in price to a conventional one. You will end up buying something which is mechanically compromised.",
                "People do raise an eyebrow when they see a £2000 price tag on our electric bikes, but they truly can replace your petrol-guzzling car, your annual travelcard and gym membership in one fell swoop.",
                "How do you charge them?In the same way as your mobile or laptop. You plug it in at the mains and top it up when you need to. You can take the battery off the bike so if you’ve stopped off at a café or pub, you can plug that in and get a quick top up.",
                "How fast do they go/can you ride them on pavement/road?E-bikes go as fast as you can pedal them but the motor is active at all speeds between 0 and 15.5mph. That’s the difficult bit for the human body – going from a stand still to cruising speed. Above 15.5mph, the bike is being powered by your leg power and momentum alone. In reality, you will find yourself cruising along at 12-15mph which is actually faster than the average speed of traffic in towns and cities.",
                "You should ride them on the road if you can. Since an e-bike’s average speed is so much faster than a conventional bike, you will be passed by fewer cars, so it’s a much nicer experience than you might be used to. If you feel like the road is becoming too dangerous when you’re out riding, guidance says you can go on to the pavement, but please go at a ‘pedestrian-friendly’ speed.",
                "It’s worth noting, that while e-bikes are completely road legal in this country, the increasingly common e-scooter are still actually illegal for public use. E-scooter trials are happening in a few areas, but for most people, e-scooters cannot legally be used in public.",
                "What is the future for the e-bike industry?Very often, someone who test-rides an electric bike with us will end the ride by saying, “That is the future!” I think with the pandemic, e-bikes are the vehicle for today. They create zero-emissions, they get people exercising, and can help keep people off public transport while the pandemic continues.",
                "There is no doubt that more commuters will switch to e-bikes and away from cars especially if more protected cycle lanes are created. The government has pledged millions to create these so fingers crossed this is done well.",
                "It’s great to see that there are temporary cycle lanes being created and hopefully this will make cycling in general much easier.",
                "For more information or to book in for a free Test Ride, visitwww.energiseebikes.co.uk."
            ],
            "Media": []
        },
        {
            "Title": "Croydon based, Black-Owned Business Directory",
            "postTimeDate": "June 22, 2020",
            "Text": [
                "Recent events have of course led to discussions about how East Croydon Cool could better support & show solidarity for the fight for racial equality.",
                "As a community marketing platform, East Croydon Cool highlights unique local businesses, events, people & positive news to Croydoners.",
                "Whilst the platform aims to showcase content that is representative of Croydon’s community, the global situation seems an opportune moment to work harder.",
                "We’ve been watching, reading & listening to see where we might be best placed to use the momentum to effect local change.",
                "A common theme, where we hope to make some impact, surrounds business & economics.",
                "As owners of all businesses will know; running a profitable company is no easy task. Whilst there are thousands of successful black-owned businesses across the UK, working in a country where racism exists, the journey to success is harder.",
                "So, we are supporting (at a local level)Swiss’s#BlackPoundDay (see@bpdofficial). His campaign encourages people to make a conscious effort to spend their money with black-owned*, UK businesses on one set day each month. The first date has been confirmed asSaturday 27th June 2020.",
                "As Swiss explains:“This is a solution based, community empowering campaign which will leave a better infrastructure for the next generation to walk into.”",
                "To tie in with this, East Croydon Cool is creating aDirectorythat details a variety ofCroydon based, black-owned businesses. We will be encouraging people to use this resource on #BlackPoundDay to actively support Croydon based, black-owned businesses.",
                "In the same way ‘Black Lives Matter’ does not translate to ‘Other Lives Don’t’; encouraging people to spend money at black owned businesses does not mean don’t spend elsewhere. This is simply a call to action to help level the playing field and acknowledge that black businesses need more support.",
                "The below Directory has been prepared ahead of the first #BlackPoundDay on Saturday 27th June. We will also use it as a basis to showcase individual businesses on our social media channels throughout the year.",
                "This is an ever-growing list, so if your business would like to be included, please drop us an email on info@eastcroydoncool.co.uk.",
                "ONE YEAR ON: The Black Pound Day movement has seen huge success across the UK and now aims “to be the biggest market place and directory to spend black in the UK and Europe, and the most influential socio-economic movement in the UK & Europe”. Hundreds of businesses have reported huge revenue increases as a result of the monthly event and Google and Soho House are now key partners. Learn more in this interview with Swiss byThe Guardian.",
                "*Whilst the original idea focused on supporting “Black-owned” businesses, this has now changed to “Black-led” which is defined as “anyone who identifies as black, including companies with non-black co-owners”.",
                "ARTISTS/ILLUSTRATORS/GRAPHIC DESIGNERS",
                "BarefaceArtist and PrintmakerInsta:@bareface_art",
                "Better SharedContemporary African Art SpecialistInsta:@bettershared",
                "Diana P-WIllustratorInsta:@diana_phiri_witty",
                "Esi JonesDigital DesignerInsta:@esijones.design",
                "Fabric of Africa FramesInnovative, handmade bespoke artInsta:@FabricOfAfricaArt",
                "Leanne Creative Cards and GiftsIllustrator and Graphic designer selling Afrocentric cards and giftsInsta:@Leanne_Creative",
                "Mould and Behold3D sculptures of your baby’s hands and feetInsta:@MouldAndBehold_",
                "SimOneArtistInsta:@sim_artnsoul",
                "StudioscampsDesigner and IllustratorInsta:@StudioScamps",
                "Wow WomenArt inspired by Women who WhoInsta:@Wowwomen2020",
                "EVENTS",
                "CocoBean GiftboxInclusive Giftbox ServiceInsta:@cocobean_gifts",
                "Floss N Pop UKEvent DecorationsInsta:@FlossnPopUK",
                "OhSo EventurousBalloon SpecialistInsta:@ohso_eventurous",
                "FASHION",
                "Aga DesignsFashion brandInsta:@Aga_designs",
                "Black Excellence GradsKente fabric graduation stolesInsta:@blackexcellencegrads",
                "CDN StoreCroydon clothing brandInsta:@cdn_store",
                "FMM Pop UpPlatform for independent designersInsta:@fmmpopup",
                "Freedom3 StoreCustom printed hoodies/teesInsta:@freedom3store",
                "Graceful HeritageAfro-Carribean family boutiqueInsta:@gracefulheritageuk",
                "Jacob’s by OabApparel and lifestyleInsta:@jacobsbyoab",
                "Kara KhumaJewellery DesignerInsta:@karakhuma",
                "KidspoEthical and Natural Clothing for ChildrenInsta:@kidspo.hq",
                "KitakisoStunning pieces dyed by handInsta:@Kitakiso",
                "Mula Cake ClothingFashion BrandInsta:@mulacakeclothing",
                "Ndeyla AccessoriesAfrican inspired accessories for him and for herInsta:@ndeylaaccessories",
                "Something About ElizabethFashion brandInsta:@hmtees",
                "StushleryHandcrafted jewellery for men and womenInsta:@stushlery",
                "Thea Smartt HenrySlow-made, small batch jewellery designerInsta:@theasmartthenry",
                "FITNESS",
                "Bump Dance FitnessFitness TrainerInsta:@bump_dancefitness",
                "Croydon Boxing AcademyBoxing classesInsta:@CroydonBoxingAcademy",
                "Holistic PT StudioPersonal TrainerInsta:@holisticptstudio",
                "Performance 360Strength and Conditioning GymInsta:@performance360uk",
                "Set Good FitnessPersonal TrainerInsta:@setgoodfitness1",
                "Snappz Masterclass FitnessPersonal TrainerInsta:@Snappz_masterclass_ftns",
                "ThaitanzMuay Thai classes in CroydonInsta:@thaitanzmuaythai",
                "FOOD AND DRINK",
                "868 Cocktail HousePop Up Cocktail BarInsta:@868CocktailHouse",
                "Africa’s Delicacy ResortAfrican delicacy pop up using Saladmaster healthy cooking systemInsta:@africas_delicacy_resort",
                "Bella Bells KitchenCatering service specialising in Caribbean foodInsta:@bellabellskitchen",
                "Big Mike’s Calypso KitchenA small taste of Barbados, a big taste of the CaribbeanInsta:@BigMikeCK",
                "Cake and Bake CroydonBakeryInsta:@CakeAndBakeCroydon",
                "Cake to DifferCake CompanyInsta:CakeToDiffer_",
                "Cocoa Jones Chocolate5 star vegan chocolates with exciting flavour combinationsInsta:@cocoajoneschoc",
                "Crepes and ConesDessert restaurantInsta:@crepesandcones",
                "Cricketers CroydonBar and Pop-Up KitchenInsta:@cricketerscroydon",
                "Crissy’s Sweet EscapeBespoke cakes and sweet treatsInsta:@crissyssweetescape",
                "Drinks On TapDrinks and Cigar delivery companyInsta:@drinksontaplondon",
                "Empress BakerSweet Treats CompanyInsta:@Empressbakerr",
                "EnishAward winning Nigerian restaurantInsta:@enish_restaurant",
                "Fruiture JuiceryThe Mobile Juice BarInsta:@fruiture_juicery",
                "Genny GrahamPepper Jellys’s made by Jenny Graham, a British-Bajan entrepreneur from CroydonInsta:@GennyGrahamPJ",
                "Heads N Tails CroydonCaribbean Fish and Chips TakeawayInsta:@headsntails_croydon",
                "Laagha’s WafflesWaffles and treatsInsta:@laaghas_waffles",
                "Livity Plant Based CuisineVegan market traders and delivery serviceInsta:@livityplantbasedcuisine",
                "McLeary’s KitchenCaterer and MixologistInsta:@mclearys_kitchen",
                "Original FlavaChefs/Food RetailersInsta:@originalflava",
                "PadnasRum based cocktails on-the-moveInsta:@Padnas",
                "Pressed JuiceFreshly made cold-pressed juicesInsta:@pressed_juice_",
                "River CuisinesCaribbean Catering CompanyInsta:@RiverCusines",
                "S Class KitchenSweet Treats and BakesInsta:@sclasskitchen",
                "Soul Vegan UKVegan Supper ClubsInsta:@SoulVeganUK",
                "Snake and MongooseA unique grill bar that takes influence from Jamaican and British rootsInsta:@SnakeAndMongooseGrillBar",
                "Tea and MeLoose leaf tea for the phases of your dayInsta:@_teaandme",
                "Temple of Strength FoodMeal prep and food deliveryInsta:@TempleofStrengthfood",
                "The Drinks ConnoisseurAlcohol Delivery ServiceInsta:@thedrinksconnoisseur",
                "The Gold Coast BarAfrican bar and eateryInsta:@thegoldcoastlondon",
                "The Incredible Twins Sweet BoxSweet delivery companyInsta:@theincredibletwinssweetbox",
                "Vegan ExpressHomemade vegan foodInsta:@vegan.express",
                "Vim PunchMixologist/Mobile BarInsta:@vimpunch",
                "Walnuts and HoneyMicro-bakeryInsta:@walnutsandhoney",
                "HEALTH & BEAUTY",
                "AA AestheticsAesthetics NurseInsta:@a.a_aesthetics",
                "AnneikiMobile Massage TherapistInsta:@Anneiki",
                "Afro ImpressionsHair SpecialistInsta:@afro_impressions",
                "Aga SalonCosmetologistInsta:@AgaSalon",
                "Angela AndrewsNatural Skincare ProviderInsta:@Brown_Angel_Naturals",
                "Beauty by CharCertified Beuatician/EstheticianInsta:@beautibychar",
                "DilaraMake Up ArtistInsta:@ddbmakeup",
                "Helena McRaeHair SalonInsta:@HelenaMcraeSalon",
                "HerbalmixHerb and Spice remediesInsta:@herbalmix1",
                "Love Leis Beauty BarBeauty bar offering lashes, nails, wigs, facials, make up and teeth whiteningInsta:@LoveLeisBeautyBar",
                "Love Lei LashesQualified lash technicianInsta:@LoveLeiLashes",
                "Morgan NailsNail TechnicianInsta:@_morgannails",
                "NailsRoseUKNail TechnicianInsta:@nailroseuk",
                "NY LashesLash SpecialistInsta:@ny_lashess",
                "Signature YouBeauty Event ServicesInsta:@signature_you_",
                "Shaylars WayCBT TherapistInsta:@shaylars_way",
                "The New CubNon-toxic skin, hair and health care for babies and mumsInsta:@TheNewCubCo",
                "Wigs by TeeCustom wigs, ready made wigs and hair extensionsInsta:@wigsbytee",
                "HOME AND INTERIORS",
                "Blooming DesiresTraditional and Bespoke floral arrangementsInsta:@bloomingdesires",
                "Dauley DesignInterior DesignerInsta:@DauleyDesign",
                "EmaySou Wicks CandlesLuxury hand poured soy wax candlesInsta: @emaysou.wicks.candles",
                "House of LilahArt inspired hand-crafted soy candles and herbal teasInsta:@HouseOfLilah_London",
                "Kindred EliteInterior Designer/Property DeveloperInsta:@kindredelite",
                "March MusesChristmas decorations of ColourInsta:@marchmuses",
                "Neuino MaisonInterior DesignerInsta:@NeuinoMaison",
                "Nina Knitted ThisHandmade blankets and bitsInsta:@NinaKnittedThis",
                "Nudest CollectionSoy wax candles of female torsosInsta:@NudestCollection",
                "Savour CandlesHomemade Home FragranceInsta:@SavourCandles",
                "PHOTOGRAPHERS",
                "BlaqpixPhotographerInsta:@blaqpix2016",
                "CDN CreativePhotographerInsta:@cdn_creative",
                "Ernest SimmonsPhotographerInsta:@ernestsimmons",
                "JDSK ProductionsVideographer/PhotographerInsta:@jdsk_productions",
                "Rhianne NewtonEvents PhotographyInsta:@rneventsphotography",
                "Tatenda Mbawa PhotographyPhotographerInsta:@Thancs3six",
                "OTHER",
                "Croydon FMCroydon’s first official community-led radio stationInsta:@CroydonFM",
                "Hello Nana DollsBlack African dollsInsta:@HelloNanaDolls",
                "InstaFemme Fatale TVFemale Music Talent PlatformInsta:@FemmeFataleTV",
                "I Am Echo Fashion ShowsRunway Trainers/Fashion show co-ordinatorsInsta:@IAmEchoFashionShows",
                "Lenses of CroydonNetwork of 600 photographersInsta:@lensesofcroydon",
                "Music Relief FoundationYouth CharityInsta:@music_relief",
                "Mr Bling Car CareCost effective car cleaning and detailing productsInsta:@MrBlingCarCare",
                "NEXUSCo-Working CommunityInsta:@NeuxusCreativeHQ",
                "Noel Drum N DrumAfrican Drum TeacherInsta:@Noel_drum_n_drum",
                "Playnation GamesRetro gaming store and events spaceInsta:@playnation_games",
                "SDS EntertainmentProviding creative spaces for young BAME CroydonersInsta:@SDSEntertainment",
                "Talawa Theatre CompanyTheatre CompanyInsta:@talawatc",
                "The Front RoomLive performance venue for music, theatre and comedyInsta:@frontroomspace",
                "Wrights AcademyDelivering the best in DJ education and sports servicesInsta:@wrightsacademy"
            ],
            "Media": []
        },
        {
            "Title": "East Croydon Cool talks…Coronavirus (and Community, Culture & Creativity)",
            "postTimeDate": "March 20, 2020",
            "Text": [
                "East Croydon Cool was set up to showcase all the great things about Croydon. As a community marketing platform (incorporating a website, social media channels, merchandise range, events programme and e-zine) it aims to inform people on what’s going on at local businesses, keep people updated on local events and foster a sense of local pride. During a period of regeneration, it helps forge relationships between Croydoners to ensure the community continues to shine as brightly as its new buildings do.",
                "Never did we imagine that we’d end up discussing a pandemic.",
                "And largely, we won’t be. We’ll leave that to the experts.",
                "But the coming weeks and months will highlight more than ever, the importance of community, culture and creativity. And that IS something we know a bit about.",
                "Whilst Community was traditionally always associated with people living, working and socialising together IRL, the internet changed things. Technology has enabled the strengthening of more obvious community groups and also helped develop virtual communities (by bringing people together not in person, but online via their common interests). A community (whether offline or online) is powerful and countless evidence reminds us we can achieve more collectively than we can individually. In a time when people are feeling out of control, community can provide a sense of support, of belonging and of influence. Croydon has always had a strong sense of community and at East Croydon Cool, we hope to leverage the online community we have built to help local residents, businesses, entrepreneurs and workers in as many ways as possible.",
                "In terms of Culture and Creativity, Croydon is ahead of the curve (we won Borough of Culture 2023 by demonstrating it!). Creativity is going to be a vital skill in these new times; both in terms of dealing with new problems and in keeping sane. People are going to need new types of cultural and creative activities to keep them entertained and we are confident Croydon’s people and organisations will find ways in which to provide it. East Croydon Cool aims to leverage our online community to showcase Croydon’s culture and creativity during this time.",
                "Whilst not wanting to trivialise the seriousness of the medical implications, we know the economic, social and mental health impacts of Coronavirus will also be huge.  We want to do as much as possible to support local businesses and residents. So in addition to our day-to-day role of promoting what’s going on in the local area, we will also be working on a range of community focused creative projects.",
                "Our current projects are detailed below.",
                "This is new territory, and perhaps not everything we do will help, but we’re going to give as much as we can a try.",
                "So if you’re working on a project which might benefit from our support or want to collaborate on something new, drop us an email on info@eastcroydoncool.co.uk and we’ll see what we can do.",
                "CURRENT PROJECTS",
                "Project One: #LocalsLoveLocally campaignThis is a social media campaign, backed by a dedicated page on our website. It encourages Croydon residents to support local businesses during the Coronavirus by highlighting specific ways in which they can help them. A listing on the East Croydon Cool website details the business’s special offers and activations and these are also shared on social media channels using the unique hashtag #LocalsLoveLocally. The campaign essentially offers Croydon businesses the opportunity to promote themselves to a wider audience for free. This campaign is being run in partnership with local community fundraiser,Hannah Sayers, who provides support to communities for projects that improve local heritage, leisure, culture and greenspaces. For more information on this project,CLICK HERE.",
                "Project Two: Self Isolation TipsLocal resident and graphic designer,Georgina Marmoy, has created a series of Self-Isolation templates that people can share to demonstrate how they can help others. We’ve taken herSelf-Isolation Tipstemplate and shared with a few creative locals to get their innovative ideas on what to do when stuck indoors. We are sharing these on ourInsta-Stories(and highlights) so if you’re looking for some indoor inspiration, check these out. Got a tip of your own? Complete the template, share on social and tag us in and we’ll help spread the word.",
                "Project Three: The £1 Thumbs UpThis is a simple fundraising project to encourage East Croydon Cool Instagram followers to donate £1 toNHS Croydon Health Services. To learn more about this campaign,click here.",
                "Project Four: The Fitness with Fernando TakeoverWe’re teaming up with local fitness expertFernando, to help cooped up Croydoners stretch their muscles at the end of another long week in lockdown. For more info,CLICK HERE",
                "Project Five: #CroydonMugs WFH Photo CompetitionRun in partnership with local Barista, Mr Tinto, this photo competition encourages locals to share a photo of their #CroydonMugs to show that whilst we might all be working from home, we’re not alone. Three winners will be selected based on artistic merit, creativity and amusement value and will receive a month’s worth of coffee each from Mr Tinto. For more info,CLICK HERE.",
                "Project Six: Croydon Style (with ASBO Magazine)Run in partnership with ASBO Magazine (the alternative style and culture magazine founded in Croydon) this competition encouraged locals to ditch their lockdown looks, open up their wardrobes and share photos of their #CroydonStyle. The best photos would be featured in the magazine later in the year. For more info,CLICK HERE.",
                "Project Seven: Indoor Plant competition (in partnership with Knttd)With the ongoing press attention about the mental health benefits of having (and looking after!) indoor plants during lockdown, we’ve partnered withKnttd, a handcrafted and eco-friendly knitted planters business based here in Croydon, to ask residents to show us their urban jungles (or beginnings of them!). The competition asks people to share photos on Instagram (using #LockdownPlanter and tagging in@Knttd_London) to win a beautiful knitted planter for one of their plant babies.  For more info,CLICK HERE.",
                "Project Eight: Croydon Yoga Hub TakeoverWith Lockdown 3 continuing to take its toll, we’re focusing Valentines weekend on Self-Love and Self-Care and have teamed up withCroydon Yoga Hubto offer a free live yoga session. For more info,CLICK HERE.",
                "Project Nine: Learn how to make the perfect Cup of Coffee (A Mr Tinto Takeover)As the WFH coffee break continues on, we’ve joined forces with specialist coffee roaster, Mr Tinto, to show Croydoners how to make the perfect cup at home. Participants of this free, interactive live takeover will receive a  packet of Mr Tinto coffee to use during the 20 minute session which will include an introduction to Columbian coffee beans, how to set up a coffee station at home and the different types of brewing. For more info,CLICK HERE.",
                "Project Ten: Table for Six!As lockdown starts to ease, we’re keen to help residents re-connect with other locals (IN REAL LIFE!) again. We also want to show support to the local hospitality venues who have lost out on trade during all of this. So we are arranging a series of ‘Table for Six’ meet ups – to bring together a group of six local residents who work in the creative disciplines. These small meet ups are being held in The Store, Basil & Grape and Matthew’s Yard. See the EVENTS page for more details."
            ],
            "Media": []
        },
        {
            "Title": "Project Five: #CroydonMugs WFH Photo Competition",
            "postTimeDate": "April 17, 2020",
            "Text": [
                "For ourfifth project, we’re encouraging a bit of photo fun whilst highlighting local Barista,Mr Tinto.",
                "Since our tea/coffee breaks are now largely being taken solo, we’re asking Croydoners to share a photo of themselves raising their #CroydonMugs to show that whilst we might all be WFH (working from home), we’re not alone.",
                "Don’t have anofficial Croydon Mug? Get creative and make your own by sticking a piece of paper with a relevant message over the top!",
                "Three prizes will be awarded for the Most Creative, Most Artistic and Most Amusing.",
                "A few demo shots from these early adopters:",
                "Winners will receive a month’s worth (3 x 200g bags) of Mr Tinto’s three best selling coffees: El Rosario, La Betulia and Gostoso delivered to their door.",
                "Mr Tinto is a much loved local Barista who has been serving up the finest of Colombian coffee blends from his ‘Bicycle Shop’ outside East Croydon station since January 2017. Named after the Colombian word for black filtered coffee, Mr Tinto cuts out the middle man by sourcing coffee beans direct from Colombian farmers. This allows him to give fair prices to the farmers and serve up great value quality coffee to Croydoners. Locals wanting to support this independent business in this current climate, can order coffee deliveries online (orders placed before 12pm, are dispatched that day with guaranteed same day delivery to CR, BR, SE and SW postcodes). Locals can also order coffee subscriptions (great for gifts!) and offices/businesses can order in bulk and benefit from wholesale prices.",
                "To enter the competition and win a month’s supply, simply share your photo on Instagram using#CroydonMugs and #MrTintosWayand tag in@Mr_Tintoand@EastCroydonCool.",
                "Winners will be announced nextFriday 24th April at 1pm."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/laura.png?w=150",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/sarah.png?w=125",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/giselle.png?w=150",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/willem.png?w=136",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/comp.png?w=740"
            ]
        },
        {
            "Title": "Project One: #LocalsLoveLocally",
            "postTimeDate": "March 20, 2020",
            "Text": [
                "As we wrote about in East Croydon Cool talks…Coronavirus (Community, Culture & Creativity), we know the economic, social and mental health impacts of Coronavirus will also be huge.  We want to do as much as possible to support local businesses and residents via a range of community focused creative projects.",
                "#LocalsLoveLocally is a social media campaign, backed up by this dedicated page on our website. It encourages Croydon residents to support local Croydon businesses by highlighting the different ways in which they can help.",
                "Hundreds of small businesses across Croydon are likely to suffer as a result of lost business during the virus. This campaign is a free opportunity for them to tell an online local community (of around 2k monthly website visitors and 8k social media followers) how they can show support and solidarity.",
                "A listing on the East Croydon Cool website details their activations which are also shared on social media channels using the unique hashtag #LocalsLoveLocally. This means others can also help spread the word, by re-sharing posts using this hashtag.",
                "This campaign is being run in partnership with local community fundraiser,Hannah Sayers, who provides support to communities for projects that improve local heritage, leisure, culture and greenspaces.",
                "Are you a local business and want to get listed? Send us your info on info@eastcroydoncool.co.uk or tag us in on socials and use #LocalsLoveLocally.",
                "General tips on how to support local businesses",
                "Order from them online",
                "Buy a voucher that can be used later",
                "Post about them on your social media channels (and like/comment on their posts)",
                "Write a review (via TripAdvisor, OpenTable, Facebook etc)",
                "Buy their merchandise",
                "Specific tips on how to support these local businesses",
                "*Please note, these offers were correct at the time of publishing but the situation is changing everyday so do check in with each business directly to confirm.",
                "Who:Mr Fox CroydonWhat: Surrey Street’s award -winning cocktail pubHow:* Buy a membership card. These gift cards can be topped up and used at a later date. The cards also include permanent benefits and discounts. To purchase, call 020 3970 9667.* Buy a freshly mixed cocktail bottle delivered to your door",
                "Who:Little Coffee ShopWhat: Coffee shop on Sanderstead road serving up great coffee, homemade cakes, savory options and moreHow:* Use their new free doorstop delivery service (for those within half a mile of the shop). £5 minimum spend.",
                "Who:Signal BeerWhat: An independent brewery based on Beddington Farm Road producing a diverse range of beers brimming with flavour.How:*Order a case of beers direct to your door",
                "Who:F45 Gym CroydonWhat: The world’s fastest growing functional training communityHow:* Members can login to join live daily workout sessions",
                "Who:The StoreWhat: Neighbourhood Bar specialising in cocktails, small plates, brunch and Sunday roastsHow:*Buy a gift voucher via the home page on their website*Write a TripAdvisor review*Order food via their new online delivery service (coming soon!)",
                "Who:The LudoquistWhat: South London’s biggest board games cafeHow:* Purchase a board game from their online shop",
                "Who:MyPTWhat: Group Personal Training and Boutique GymHow:*Join their FREE self care home programme designed specifically to help the Croydon community",
                "Who:Singing Out LoudWhat: Vocal CoachHow:*Book an online Skype singing session*Book a voucher for future use",
                "Who:Blooming DesiresWhat: FloristHow:*Sign up for their Flower Subscription Service*Order an online delivery of flowers*Buy a gift voucher",
                "Who:Ettie Bettie BabyWhat: Baby Sign ClassesHow:*Join a free virtual class every week day at 10.30am (viahttps://www.facebook.com/groups/571731613691444/?ref=share)*Buy items from the online shop",
                "Who:The LollipopsWhat: Vintage Band TrioHow:*Book a bespoke vintage video message and song for a special occassion*Follow them on socials for info about upcoming virtual gigs",
                "Who:This Parent CanWhat: Infant Sleep ConsultantHow:*Book a one-to-one phone session",
                "Who:Sara Does CurryWhat: Home cooked Friday night curry makerHow:*Order a contactless curry collection",
                "Who:MyPT CycleWhat: Boutique indoor cycle studioHow:*Rent a Spin bike on a month by month basis",
                "Who:The Oval TavernWhat: Cosy, family friendly pub with a real community atmosphereHow:*Order a take-away Roast Dinner",
                "Who:Crepes and ConesWhat: Savoury soul food and creative dessert restaurant owned by Krept & KonanHow:*Order using their online delivery service",
                "Who:Laithwaites Wine CroydonWhat: Family owned wine shop and delivery serviceHow:*Order 6 bottles of wine or more, and get free delivery to your door",
                "Who:The Winning MarginWhat: Boutique Franchised branch of Intersport offering personalised service from by local husband and wife team James and DaviniaHow:* Do a virtual in-store shop with James and Davinia or order online via their website",
                "Who:Coughlans BakeryWhat: Family run artisan bakery with a huge Vegan rangeHow:*Pre-order freshly made bread (and get it delivered via Uber Eats)*Order a family sized fruit and veg box (for next day collection)",
                "Who:Onenine5What: Unisex and Eco-Conscious Wash BagsHow:*Buy an online gift card that can be used for future purchases",
                "Who:Addiscombe Fruit & VegWhat: Fruit and Veg shop in Addiscombe (duh!)How:*Order a fruit or veg box for free delivery",
                "Who:Alluure BeautyWhat: Beauty services led by Zara Sophia (including facials, massage, manicures and waxing)How:*Buy a gift voucher for future treatments",
                "Who:Hollistic PT StudioWhat: Boutique Movement and Lifestyle Coaching Studio in East CroydonHow:* Join a live online stretch and strength session",
                "Who:LaborjeeWhat: Self-taught baker selling cakes and bakes (with Gluten Free and Vegan options)How:*Order a postal delivery treat box",
                "Who:The Cronx BreweryWhat: “Great Beer; Straight Outta Croydon”How:*Order a box of beers or your very own mini-keg to your door",
                "Who:Croydon Yoga HubWhat: Yoga and Pilates classes in the heart of CroydonHow:*Join one of their (growing number of!) online yoga or pilates classes (Intro offer of £25 for 2 weeks)",
                "Who:Maria Bello StylingWhat: Personal StylistHow:*Book an online Colour and Body Shape Analysis (reduced from £25 to £20 when quoting East Croydon Cool)",
                "Who:Mr TintoWhat: Mobile rostery serving up first class coffee for all taste budsHow:* Order coffee beans straight to your door. Orders placed before 12pm (noon) will be delivered the next day (to local postcodes)",
                "Who:The TMRW CollectiveWhat: A creative digital agency set up for a time of economic survivalHow:*Consider hiring this temporary agency made up of local independent creatives and freelancers for your marketing campaigns.",
                "Who:Poppet CreationsWhat: Cake topper business offering same day serviceHow:* Receive a free NHS cake topper for any cakes you are making and donating to NHS staff",
                "Who:Chloe ShirleyWhat: Local artist and teacherHow:*Print out her Cronx Poster Kit and place designs in your windows to show support and raise a smile",
                "Who:Amy Smith PhotosWhat: Local photographerHow:* Make the most of Amy’s new in-house studio by getting her to shoot your products for your website, brochure, social media channels etc",
                "Who:Day DotWhat: Local illustratorHow:* Keep kids occupied by printing out one of her free rainbow designs for them to paint/colour",
                "Who:Fitness with FernandoWhat: Personal Trainer specialising in Boot Camp sessionsHow:* Join one of his live classes online (or one the free30 min Pilates classeshe is doing in partnership with East Croydon Cool!)",
                "Who:Rosie GirlWhat: Doll maker and creatorHow:* Buy one of her NHS hero dolls (with 25% of every purchase going to the NHS)",
                "Who:Chatsworth BakehouseWhat: A nano bakery serving the local community (born out of the COVID-19 crisis)How:* Order one of their loaves in return for a donation to local food banks and charities (100% of donations go to charity).",
                "Who:Muddy TrowelWhat: Set up during COVID-19 by a diverse community with a passion for gardening to deliver plants (that might have been burnt or composted) direct to the door.How:*Follow their 4 step process to see what items are available at nearby garden centres then order a selection box and have it delivered direct to your door.",
                "Who:Art + Craft CR0What: Fully independent craft beer barHow:*Spend £25 or more on their wide range of craft beers and get it delivered (within a 5 mile radius) for free!",
                "Who:Upstream SeafoodsWhat: High quality fresh and frozen seafood providerHow:*Spend more than £25 to get fresh seafood delivered straight to your door for free (within 15 miles of Croydon)",
                "Who:Knttd LondonWhat: Handmade Macramé planter designerHow:*Mix up your interior design scheme during lockdown by ordering one of these beautiful creations online (delivered to your door)",
                "Who:The Incredible Twins Sweet BoxWhat: Teenage twin boys from Croydon set up this sweet box delivery company during lockdownHow:* Fix your lockdown sugar cravings by ordering a box of 750g sweets to your door."
            ],
            "Media": []
        },
        {
            "Title": "Project Seven: Indoor Plant competition with Knttd",
            "postTimeDate": "November 12, 2020",
            "Text": [
                "Welcome to Lockdown 2! We’ve picked up where we left off and have a new competition to help keep Croydon residents motivated during this latest incarceration!",
                "Recent years have seen a huge trend for indoor plants and an increased number of articles about their positive impact on mental health. FromViceandMetrotoPsychology TodayandStylist,EVERYONEis raving about greenery and it’s associated benefits.",
                "It’s a fact that Cronx resident, Carly, knows all too well. Having started her business (Knttd) in April whilst taking care of a toddler and being stuck indoors 24/7, she was full of emotions & at times pretty overwhelmed. But with Carly’s business revolving around plants, Lockdown gave her the opportunity to grow her plant collection whilst taking her mind off the pandemic.",
                "As theRHSexplains:“As well as looking good, houseplants support human health in homes, offices, school and hospitals. Research suggests that the greatest benefits of indoor plants are through wellbeing and productivity improvement.”",
                "Something we could probably all do some help with!",
                "So as we find ourselves in the midst of another Lockdown we have partnered up with Carly and Knttd to encourage you to embrace indoor planting and help spread the word about how your plant babies are helping you through this period.",
                "Show us your urban jungle (or your start of one!) and tell us what you love about your greenery for the chance to win a new home (for your plant 😉). Share a photo on Instagram of your plants using #LockdownPlanter and tag in@Knttd_londonto WIN a beautiful knitted planter!",
                "Want to grow your brood further? Check outthis videofrom House Beautiful which guides you through the simple process of propagating a plant.",
                "This photo competition closes at midnight on Thursday 26th November…giving you 2 weeks to get your plants photo ready for their close up!",
                "The winner will be announced on Friday 27th November. UK residents only. Plants not included. This giveaway is not endorsed by Instagram."
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: Loyle Carner works with Timberland to create community green space",
            "postTimeDate": "September 30, 2020",
            "Text": [
                "Great to have some positive news in the midst of all this!",
                "Today sees the completion of a project in which Croydon born music artist,Loyle Carner, global lifestyle brandTimberlandandLondon National Park Cityworked together to create a green community space in Thornton Heath.",
                "Re-greening a disused area not far from where he grew up, Loyle collaborated with Timberland to lead the regeneration alongside London National Park City in a movement to make the capital greener, healthier and wilder. Creating a greener city-scape for London, the new community square will act as a space for locals to access calm and peace and a place to be proud of, while also raising awareness about environmental issues.",
                "The local community took a leading role in bringing it together, adding their own finishing touches to the space to make it alive and welcoming. Residents were given a time slot, to comply with social distancing guidelines, and invited down to plant something beautiful, making their own contribution to the future of their community. Allowing the people of Thornton Heath to have an active role in this project was pivotal to creating a space they will actually use, a place which is inspiring and encourages creativity.",
                "Loyle said about the project:“Feels good to be home. I was lucky to grow up around green space, but in my area that’s not how it is for everyone. So I took a small but vital step in the right direction to bring more green space to the Croydon community. I’m still moved that Timberland would support such a grassroot initiative, and help us link up with London National Park City”.",
                "With the help of Timberland, LNPC, and support from Croydon Council, Loyle has brought to life this area of Thornton Heath as part of Timberland’s biggest campaign to date –Nature Needs Heroes. From pledging to plant 50M trees by 2025 to intending to create a net positive impact on the environment by 2030, Timberland believes a greener future is a better future.",
                "Learn more about the project here:"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/09/timberland-1.png?w=300&h=200",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/09/timberland-3.png?w=300&h=200",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/09/timberland.png?w=300&h=199"
            ]
        },
        {
            "Title": "East Croydon Cool talks…HOM[E]AGE Croydon",
            "postTimeDate": "May 1, 2020",
            "Text": [
                "East Croydon Cool talks…is a blog series that explores topics of cultural interest via local area experts. This month we caught up withSophia Carey, a freelance photographer and designer who grew up in Croydon, to talk about her latest projectHOM[E]AGE.",
                "HOM[E]AGE explores the themes of coming of age and of home; exploring the way that people interact with their environment and how the people and places that they engage with influence their person, their ideologies and their craft. Sophia has started the project in the town she grew up, with HOM[E]AGE Croydon focusing on the towns and places that make up the London Borough of Croydon, and the people that enrich it. It is a homage to the place and the people.",
                "Firstly, how did you get into photography and videography?My initial journey into photography was through studying graphic design and using a camera to capture photographs for my design work. From there, I started to attend music events around London (mostly South) with my camera and build up connections on the hip hop and grime scene.",
                "What was the inspiration behind the HOM[E]AGE project?HOM[E]AGE was initially inspired by a desire to re-write the narrative around Croydon. It’s no secret that the press around Croydon can be particularly negative, but my perception of Croydon – and especially the people I meet from Croydon – has starkly contrasted those negative connotations. Some of the most dedicated, hard-working and talented individuals I know have grown up in and around Croydon and I really wanted to create a project that showcased that.",
                "Why did you start in Croydon? What other areas do you plan to capture?I’ve started the project in Croydon because that’s where the initial idea was born. Croydon is a place that I attribute a lot of my growing up and coming of age too and has massively developed me into the person and the creative that I am today. Whilst I live in Manchester now, it was important to me to pay homage to the area that first formed me. Next on the cards for HOM[E]AGE is definitely going to be Manchester; which has been my home for the last three years since I moved here for uni. Croydon and Manchester together really tell the story of my coming of age.",
                "How did you go about choosing the people and places you featured?The places, so far, have just been areas that are important to me. Eventually, once I’ve covered all of those areas, I’ll be location scouting to develop the series further. In terms of the people, for the first series I incorporated a lot of people that I already know, as well as people that I see making positive changes within the community. Really, what I’m looking for is people with qualities that I want to showcase: hard work, dedication, talent, to name but a few.",
                "Did anything surprise you about the process?I wouldn’t say that anything surprised me, per se, but I did learn a lot about things that the people I interviewed had done or were contributing to the community that I wasn’t aware of before. That just really re-affirmed that they were the right choices to showcase in the project.",
                "Was there a common thread to how interviewees felt about their hometown?Overwhelmingly, people were proud to be from Croydon. All of the people I interviewed could recognise how the borough had shaped them or influenced them in their craft, which was really nice to hear.",
                "How has the project been received so far?So far the response has been great. I’ve been working on the project for a long while now, having started it back in 2019, and so it’s really great to see people take to the project so well. I’ve also had a lot more people from the borough get in touch and say they want to be involved, which I’m really excited to make happen as soon as possible.",
                "What’s next for the project…we hear there’s a book in the planning?!There’s a lot planned! We’ve got some more interviews yet to film, which have had to be postponed due to COVID-19, as well as a book on the way! I’m also planning an event, hosted in Croydon, to celebrate the project but that’s also dependent on the current pandemic. I’d definitely say keep your eyes peeled, though!",
                "Watch the trailer for the project here:",
                "Watch the first episode of the project here:",
                "Watch the second episode here:",
                "Watch the third episode here:",
                "Watch the fourth episode here:",
                "Watch the fifth episode here:",
                "Watch the final episode here:",
                "To keep up to date on future episodes of HOM[E]AGE Croydon, subscribe to Sophia’s You TubeHERE."
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: Innovative new digital agency, the TMRW Collective, launches in Croydon",
            "postTimeDate": "April 8, 2020",
            "Text": [
                "In this new climate, much has been spoken of the importance of community; something intrinsically linked with co-working. This week’s launch of theTMRW Collective, a digital and creative agency built specifically for a time of economic survival, is the perfect example of co-working and community in action.",
                "A selection of members fromTMRW, South London’s number one digital and tech co-working community, have banded together during the COVID-19 crisis to be able to offer an agency service like no-other. These independent digital and creative experts have formed the TMRW Collective to combine their respective strengths and skill sets and ultimately, to ensure their collective survival.",
                "With such a unique set up, the TMRW Collective offers clients several distinctive benefits. First and foremost is the fact that its very survival depends entirely on thequality of workit delivers. The survival instinct is a powerful one which ensurescreative thinkingand theexceeding of expectations. Secondly, the unusual set up means a diverse mix ofexperienced expertsare brought on to each project to fully utilise theircombined skill sets. Thirdly, having set up specifically in a time of crisis, the TMRW Collective is acutely aware of the pressures on businesses and is able to deliveroutstanding value for money. It offers afull-service deliverywithout an expensive retainer, anagile teamwho are alreadyoptimised for remote working,rapid project turnaroundandflexibility to work with all budgets.",
                "Another distinguishing characteristic of this agency is theCorporate Social Responsibility opportunityit provides clients. By hiring a collective of creative independents who have lost work due to the crisis, organisations who opt to work with the TMRW Collective are doing their part in supporting the small business community. We can’t all work on the front-line, but we can all do our bit because; “It’s on all of us”.",
                "The TMRW Collective includes:Dazzle Communications(Communications Consultant),Entente Process(Business Development and Project Management),Fifty Fathoms(Design Illustration & Branding Consultancy,Jamie Pitt(Video Producer and Director),Laura Sawyer(Stylist, Art Director and Creative Consultant),Minno(Full Service Marketing for Start Ups and SMEs),Rise Media(All Inclusive Video Production),Vie Digital(Business Growth for Start Ups and SMEs),Winwood Haines(Creative Design Studio) andSketchology(Graphic Recording and Facilitation).",
                "Social distancing and self-isolation mean businesses need to embrace digital more than ever before. The TMRW Collective works with organisations so they can successfully operate in the digital sphere, keep customers engaged in an overcrowded digital space and use creative marketing that resonates with the current landscape, is sympathetic to the collective situation and which creates a positive brand perception.",
                "Francois Mazoudier, Founder of TMRW, explains:“We’ve always said TMRW isn’t just a place where you can get a desk and wifi. We’ve consistently helped businesses during their exciting growth phase; with funding, staffing and commercial expansion but we have also provided support during the hard times. We’re proud to have instigated this new project which is now being self-managed by community members and to be able to open up our contact network to help them with this innovative agency concept.”",
                "So if your business needs some digital support during this time, contact them onhello@tmrw-collective.com."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/tmrw-collective_type-only-logo.jpg?w=300&h=129",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/04/tmrw-collective_the-experts.jpg?w=338&h=284"
            ]
        },
        {
            "Title": "Countdown to Christmas with #TheCronxCalendar",
            "postTimeDate": "November 30, 2020",
            "Text": [
                "Wow. What a year!",
                "But instead of reeling off the hundreds of things that have impacted us as a result of the c-word, we’re going to focus on a different set of numbers and a different c-word (no, no that one: CHRISTMAS!)",
                "This year, we’ve partnered withNo.26 Croydonto create an online Instagram calendar that gives 26 unique gift suggestions from creative entrepreneurs across the Borough.",
                "As thousands of press reports will attest to, supporting local is more important than ever. Small businesses are the life and soul of our Croydon neighbourhood and we want to do as much as we can to help them thrive at the end of a very tough year.",
                "No. 26 Croydon is a residential building which offers “urban living with community built right in” and so were equally as motivated in wanting to raise more awareness of local creative entrepreneurs.",
                "The calendar will feature on both theNo.26 Instagram account(to help give their residents some inspiration over the festive shopping season) and also onEast Croydon Cool’s feed(to spread the word amongst the wider community).",
                "In addition to highlighting specific gifts, the calendar entry featured on the No.26 feed will include a short video from the seller themselves, giving people a chance to learn a little more about the person behind the brand.",
                "From artwork and apparel to homeware and accessories, there’s plenty of ideas that will put smiles on the faces of even the trickiest person to buy for!",
                "So if you’re looking for gift ideas (or inspiration on what to treat yourself to in the New Year!) and want to support local, make sure you check in on the East Croydon Cool and No.26 Instagram accounts every day from 1stDecember in the lead up to Christmas."
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: Croydon Composers launch a collaborative album in response to closure of music venues",
            "postTimeDate": "November 12, 2020",
            "Text": [
                "With the music and live entertainment industries having taken a particularly hard hit this year, due to the closure of venues and cancellations of events, we’re delighted to hear about this new project fromCroydon Composers.",
                "Croydon Composers was set up in November 2017 by the dynamic (and Croydon based!) production company,Drum The Bass.",
                "Drum The Bass is run by Artistic Director (and award winning composer, producer and bassist)Shri Siram,DirectorShirin Sriram, and music business consultantMichael Fuller.",
                "Drum The Bass set up Croydon Composers to bring together aspiring and established musicians. Their debut at the 2017Croydon Mela, saw them perform at Boxpark to over 1000 people.",
                "In response to the current climate, this year the format went virtual with the‘Croydon Composers Online’project. This brought together a team of 25 outstanding musicians, composers and producers (from Croydon and around the UK) to work together remotely (as duos and trios) to riff together and learn about each other’s styles and cultural musical roots. The end result is an 11 track album, entitled‘Croydon Composers Vol. 3’.",
                "This ground-breaking, cross-genre musical collaboration reflects a huge range of influences including rap, reggae, jazz, Indian classical music and rock.",
                "Collaborators include: producerShri Sriram, award-winning trombonistDennis Rollins, pianist and composerRoland Perrin, Heaven 17’s keyboardistFlorence Sabeva, singer/songwriter and beatboxerBellatrix, award-winning rapperTubby Boy, global DJ and producerAdam Scrimshire, singer songwriterLucinda Drayton, Syrian oud playerRihab Azar, MOBO-nominee and Afrobeats performerSilvastone, spoken-word artistAmen Noir, former Notting Hillbillies bassistMarcus Cliffe, digital roots producerAdam Prescott, former percussionist with Youssou N’Dour,Ndiaga Issa Mbaye…and more!",
                "Croydon Composers Vol 3 is available to buy, download or stream for FREE from20th November.You can pre-order or pre-save on Spotify byCLICKING HERE.",
                "As Shri explains:“We didn’t want to wait for venues to open up again before we got our next project off the ground. Croydon Composers Online features a host of talented musicians from Croydon and a team of top musicians and composers from around the UK.  I’m super excited that we’ve got local artists featuring alongside very experienced practitioners; it means we can expand the reach and connectivity of Croydon musicians and composers.”",
                "Global DJ and Producer,Adam Scrimshire, says:“It’s an inspiring idea and it’s very special to make connections outside my normal circle of collaborators, thanks to Shirin and Shri!  I’ve been working with the virtuoso sitar player Sheema Mukherjee and the brilliant rapper, Tubby Boy and I’m really proud of our end product – the track Breathe.”",
                "DJ, Producer and Writer,Adam Prescottsays:It’s challenged my music writing process (in a good way!) and I’m really pleased with how our track, I Dream, worked out. I’ve been working with Prachi, who’s a classically trained Indian vocalist, and Shri Sriram who’s a very talented flautist – among many other things!",
                "With every Croydon Composers project Shirin, Shri and Michael have taken on the challenge of getting bigger and better. We offer them our huge congratulations for using lockdown to deliver this innovative and creative new album….and can’t wait to see what they do next!"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/11/albulm-cover.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/11/composers.png?w=300&h=300"
            ]
        },
        {
            "Title": "Project Four: Fitness with Fernando Takeover",
            "postTimeDate": "April 15, 2020",
            "Text": [
                "About Fitness with Fernando“Exercise Is Medicine” is Fernando’s life motto. Having turned to fitness to escape his daily routine as a teenager, he soon found it built his confidence, strength and improved his health and so went on to pursue a career in fitness. After working for many major gym chains in London for years, Fernando decided to go solo and launched his own fitness company running outdoor fitness bootcamps which he has been doing for over 15 years now. His ability to get people moving so they see real results has enabled him to build a loyal clientele.  In these testing times, his journey has now evolved to offer a wide range of fun and relatable live-stream fitness classes. Drawing on his years of experience as a fitness professional, Fernando now puts clients through their paces within the comfort of their own homes. Classes are designed to be accessible for a variety of levels and require minimal equipment (with a focus on using bodyweight, hand weights, kettlebells and resistance bands)."
            ],
            "Media": []
        },
        {
            "Title": "Newsflash: Winner of the Brick by Brick  ‘Housing for a Better World’ competition announced",
            "postTimeDate": "August 29, 2020",
            "Text": [
                "Last month,Brick By Brick, the housing development company set up by Croydon Council to improve access to high quality and affordable housing in the borough, launched a design competition in partnership with theStephen Lawrence Charitable Trust.",
                "Prompted by the coronavirus pandemic, which has brought many issues across UK society into sharper focus (from the climate emergency to widespread inequality) the design competition was focused on creating housing for a better world.",
                "During lockdown, our homes have become increasingly central to our daily lives. This ‘Housing for a Better World’ competition was created to seek out bold and thought-provoking ideas for how our homes can improve the urgent issues of health, sustainability and an inequality for residents and wider communities.",
                "The competition set out to find practices with diverse talent, bring forward positive change within the architectural profession and better reflect the diversity of the neighbourhoods in which they work.",
                "Entrants were asked to demonstrate their commitment to diversity through existing staff or planned action as part of the competition process. As Croydon is one of the most diverse boroughs in London, the winning practice needed to field a diverse team and show how they could respond to local issues to best meet the needs of the local community.",
                "The shortlisted teams presented their ideas as part of the Architecture Foundation’s 100 Day Studio programme (available to watch here), with the judging panel tuning in live before meeting virtually to decide the winner.",
                "Yesterday, the winner of competition was announced…",
                "Jas Bhalla Architectswon on the strength of their ‘Parade Living’ concept, which seeks to improve poor quality housing above linear retail parades by providing alternative models of housing. The Practice beat the five other teams to win a commission to design one of the schemes on Brick By Brick’s next small sites programme, which is due to start in the autumn.",
                "The linear shopping parade at the heart of their concept is prevalent across Croydon, with associated housing disproportionately used by minority ethnic groups. These homes rarely meet space standards and are often accessed via undesirable services yards. Through targeted intensification, Parade Living seeks to demonstrate that these locations can provide homes that are generous, flexible and commercially viable.",
                "This concept aligns with Brick By Brick’s ethos of addressing the housing crisis through creating high quality homes on piecemeal infill sites throughout the borough.",
                "The proposals are characterised by dual aspect units designed to work with long and narrow plots. New accommodation will exceed national space standards, providing additional storage and external amenity. Homes are designed to utilise volumetric and/or panelised modular construction to deliver several benefits, including lowering embodied carbon, maintaining high quality and improving viability. Preliminary plans illustrate how offsite manufacturing can be used without creating overly cellurised, deep single aspect units.",
                "The competition represents the first step for Brick By Brick in redefining how consultancy services are procured to ensure that their homes are designed and built by people who are more representative of the wider population in Croydon and London. The initiative is intended to enable the developer to widen its network of designers and start to build relationships with a range of talented practices that have been under-represented in commissioning to date.",
                "Chloe Phelps, Head of Design and Commercial at Brick By Brick / Common Ground Architecture, said:“We’re really excited to start working with Jas Bhalla Architects. Their competition entry demonstrated an in depth understanding of the challenges facing Croydon in terms of housing quality and high streets, with a clear and intelligent concept. Although we had to name one winner, this process has opened up a new network for us and we will seek opportunities to work with the shortlisted practices in the future. This competition has shown how, with the right process, you can identify talented and exciting practices and architects from all backgrounds. We’ve learnt that by integrating the thinking into the process, the result is a more diverse field – and we hope the wider industry will start to take this approach.”",
                "Pragga Saha, judge and alumna, Stephen Lawrence Trust, said:“The competition has been engaging at each stage and choosing a winner was so challenging as the shortlisted entries all had different strengths. Jas Bhalla Architects had a strong clarity of concept and their research was fantastic. I’ve really enjoyed being part of this process, and it is a testament to what can be achieved by community driven and diverse practices when given the chance!”",
                "Jas Bhalla, Principal, Jas Bhalla Architects, said:“We are really excited to have been selected by Brick By Brick, especially given the rich ideas and extremely high standard of presentations given by all finalists. The competition has been a great opportunity to explore new concepts of collective living and discuss ideas in the context of issues such as viability and delivery, ensuring proposals focus on improving housing for under-represented groups.At the heart of our concept is the idea that if we are serious about tackling race-based inequality, it’s important to develop a nuanced understanding how and why different cultures live a certain way. If we can do this, there’s a huge opportunity to not only deliver much need housing numbers, but also bring material change to some of the most disadvantaged groups across the borough.”",
                "For more information,CLICK HERE."
            ],
            "Media": []
        },
        {
            "Title": "INCOMING: March Events",
            "postTimeDate": "March 2, 2020",
            "Text": [
                "Introducing INCOMING; a new monthly blog post that provides a hand-picked selection of the events we’re most looking forward to over the following weeks.  Here are our top picks for March 2020:",
                "8th March: International Women’s Day Free classes at MyPTIn celebration of International Women’s Day, MyPT Croydon is hosting a series of free women’s-only workshops and seminars. Available to members and non-members, classes include weight training, ab training, glutes and more. So, book your spot before they are snapped up! If you’re not a member, simply drop them a message via Instagram (@myptcroydon) for more information on each of the classes and how to book. Then make sure to arrive at reception 10 minutes before your session starts and the team will get you settled in. You will also receive complimentary use of the new gym for the day too – win win! Just bring along a padlock, towel and comfortable clothing. The sessions will be suitable for all abilities.To visit their website,CLICK HERE.",
                "14th March: St Patrick’s Day Massaoke at BoxparkWe love Boxpark for bringing a regular programme of great events to our East Croydon doorstep. March brings a number of nights to warm up the vocal chords including Hip Hop Karaoke, a Jukebox headphone party AND the ultimate group sing-a-long: aSt Patrick’s Day Massaoke.To visit Boxpark’s website,CLICK HERE.",
                "14th and 15th March: So Last Century Vintage and Retro Fair at Fairfield HallsOne of South London’s best vintage and retro fairs, here you can find mid-20th century lighting, furniture, décor, homeware, ceramics, illustrations and prints, posters, vintage clothes, accessories, jewellery, records and much more. There are a small selection of designer-makers, and a guest artist displaying and selling their work. All from 40 hand-picked vintage traders, this is the perfect place to get a one of a kind gift or artwork for your home. Entry is £3 (and only £2 if you follow @solastc onInstagram!)To visit So Last Century’s website,CLICK HERE.",
                "21st March: Mothers Day Vase Arrangement workshop at The StoreSouth Croydon’s prettiest restaurant, The Store, is bringing back Cosmos & Plums for a Mother’s Day flower arranging special. For £55 you will enjoy a two-hour flower arranging course, a glass of prosecco and, of course, you can then take your beautiful flower arrangement home with you. Led by the amazingly talented floral stylist Kasia, you can email her oncosmosandplums@gmail.comor DM her Instagram @cosmosandplumsto secure your spot.To visit The Store’s website,CLICK HERE.",
                "26th to 29th March: Croydonites FestivalCroydonites Festival returns for it’s fifth year! Performing at a range of Croydon locations (including the newly refurbished Fairfield Halls, The Front Room, The Spread Eagle Pub Theatre and Stanley Halls) the impressive line-up of film, theatre, performance, dance and storytellers incorporates a mix of artists from Croydon and around the UK. There’s loads to choose from over the 4 day festival but we’re especially keen to catchInstagramming the ApocalypseandCroytopia.To visit the Croydonites website,CLICK HERE."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/03/img_8883.jpg?w=150",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/03/img_8884.jpg?w=150",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/03/img_8882.jpg?w=150",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/03/img_8880.jpg?w=147",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/03/img_8881.jpg?w=150"
            ]
        },
        {
            "Title": "The Cronx Lucky DIP",
            "postTimeDate": "August 11, 2020",
            "Text": [
                "Hi East Croydon Cool followers,",
                "When I set up this platform it was purely to promote all the great things going on in Croydon. It was not for personal posts like this BUT my various attempts at fundraising for this incredible charity have all taken a hit due to Corona so I’m hoping you’ll let me off this once?! (especially as I found a way to tie it in to Croydon!)",
                "In a couple of weeks, I’ll be attempting to swim the Channel as part of a 6 person relay.",
                "I’m not an especially sporty person (!) so this 22 mile swim across the world’s busiest shipping lane (minus a wetsuit) is set to be quite the challenge.",
                "Our team will be raising money forAspire, a charity that provides practical help to people who have been paralysed by spinal chord injury; supporting them from injury to independence.",
                "Whilst training has been difficult due to pool closures, organising fundraising events (during lockdown and social distancing) has been just as tricky.",
                "So I’m hoping to get a bit closer to my target by holding ‘The Cronx Lucky DIP’. Dip: see what we did there 😉",
                "Simply donate £5 tomy Just Giving pageand leave the comment‘The Cronx Lucky Dip’to be entered into a prize draw to win a range of treats from some brilliant businesses across Croydon!",
                "Prizes include:*3 yoga classes atCroydon Yoga Hub*A set of 3 mugs fromEast Croydon Cool*A cocktail experience for two atMr Fox*A bundle of 3 bags of coffee fromMr Tinto*A packet of Croydon postcards fromScene in Croydon*A Brunch voucher for two atThe Store*A pair of Stance socks fromThe Winning Margin*An eco-friendly stylish wash bag fromOne Nine 5*A £15 nail voucher fromAtara Nail Bar*A custom t-shirt fromFreedom 3 Store*A pair of earrings and necklace fromRamola London*An original piece of artwork and a goody bag fromAlec LDN*A pair of sunglasses fromToyshades",
                "Winners will be drawn onMonday 24th August.",
                "As with most organisations, charities have been hit hard by the economic impact of Coronavirus so thank you in advance for (pun alert) ‘getting on board’ with this prize draw (and a huge thank you to the businesses who have generously supplied these prizes!)",
                "Maddy x"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/08/me-and-cup.jpg?w=225&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/08/the-cronx-lucky-dip.jpg?w=204&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/08/prizes.png?w=300&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/08/prizes-2.png?w=300&h=300"
            ]
        },
        {
            "Title": "Project Two: Self Isolation Inspiration",
            "postTimeDate": "March 26, 2020",
            "Text": [
                "For our second community project, we’ve worked with local graphic designerGeorgina Marmoy, to create a Self Isolation Tips template.",
                "We’re encouraging locals to complete them with recommendations of things to do whilst at home. From Netflix and Podcast suggestions to Creative project ideas and working from home tips, we hope that by sharing what local residents are up to, we will all feel a little more connected. 🙂"
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/isolation.png?w=182&h=300"
            ]
        },
        {
            "Title": "Newsflash: Croydon’s first Poet Laureate announced",
            "postTimeDate": "October 2, 2020",
            "Text": [
                "Yesterday was National Poetry Day and so the perfect occasion to announce Croydon’s first ever Poet Laureate!",
                "We’re delighted to see the cover star ofThe Cronx Effect(the e-zine we created with other locals),Shaniqua Benjamin, receive this prestigious title. Shaniqua is a spoken word poet, writer and creative workshop facilitator who has used her passion for making a difference to foundYoung People Insight CIC,a platform that inspires young people through creativity, conversation and writing. A former pupil at Winterbourne Primary School and Norbury Manor Secondary School, she was born and raised in Thornton Heath, and has previously written and performed poems to mark occasions of cultural significance for Croydon, including the reopening of Fairfield Halls in September 2019.",
                "On Sunday 27 September, Shaniqua was joined by other local artists who have inspired her and been part of her journey, to celebrate her laureateship with an afternoon of poetry and spoken word. She performed her first commission as Poet Laureate for Croydon,Come Together, which explores how the borough has united during the pandemic. You canwatch it here.",
                "Shaniqua will hold her laureateship until October 2023, when she will lead in the selection of the new laureate. Shaniqua’s journey to 2023 will see her undertake a number of residences with organisations and community groups to delve into the Croydon experience and identity, empowering others to find their voices through poetry.",
                "She said of her new title:“I love my home of Croydon and poetry is one of my great loves, so becoming Croydon’s first Poet Laureate means more than words can describe. I’m looking forward to hearing the voices of the beautiful people all over Croydon and making poetry more accessible.”",
                "Councillor Oliver Lewis, cabinet member for culture, leisure and sport added“The appointment of our first Poet Laureate is a significant milestone for Croydon. We are incredibly proud of our borough’s thriving spoken word and poetry scene and Shaniqua has been a true champion for these art forms. She has been instrumental in telling Croydon’s story and importantly, she inspires and empowers our residents to raise their voices and tell theirs – something which has never felt more important in these challenging times.”",
                "We loved working with Shaniqua on theThe Cronx Effect; an e-zine that celebrates the people and places of Croydon. The first issue (launched on International Women’s Day, was entitled#CroydonGirland celebrated local women who are doing amazing things to inspire creativity, develop young talent, empower others and effect social change both within the Borough and beyond. To read the e-zine,click here."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/10/shaniqua_main-09.jpg?w=683"
            ]
        },
        {
            "Title": "Project Six: Croydon Style (in partnership with ASBO magazine)",
            "postTimeDate": "May 11, 2020",
            "Text": [
                "Our next project during these “unprecedented times” is in partnership withASBOmagazine.",
                "“Launched in 2017 as an alternative style and culture magazine, ASBO is the voice of frustrated youth world-wide. ASBO brings the underground, overground, from what is happening on the streets of India to the council estates of the UK. ASBO is a provocative. original, definitive style magazine that interacts with its readership on many different levels. From the beginning it was a cultural trailblazer; covering music, fashion, film, TV, society, politics and global current affairs from a fresh youth prospective that is not too frightened to stick it’s two fingers up to society. Championing under-represented, creative, young talent; ASBO has quickly become a bible for those in the know.”",
                "Whilst working from home in joggers and hoodies has been great, we know a lot of you are starting to tire of your “lockdown look”. So we’re working with ASBO to encourage Croydoners to open up their wardrobes and show off their Croydon Style.",
                "Post a photo on Insta using #CroydonStyle and tag in @EastCroydonCool and @Asbomagazine and the most stylish looks will be featured in the magazine later in the year.",
                "So if you need an excuse to make a new online purchase, want a reason to dress to impress, are looking for motivation to get creative with the sewing machine or simply need to switch things up between your day and night pyjamas; get involved!",
                "The project will be running until end of June (when we’ll hopefully be able to start dressing up again to go out out and maybe even OUT OUT)."
            ],
            "Media": [
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0526.jpg?w=266&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0527.jpg?w=281&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0528.jpg?w=300&h=291",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0529.jpg?w=283&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0530.jpg?w=270&h=300",
                "https://eastcroydoncool.co.uk/wp-content/uploads/2020/05/img_0531.jpg?w=246&h=300"
            ]
        }
    ]
}