{
    "site_url": "https://eastcroydoncool.co.uk/",
    "site_title": "EAST CROYDON COOL",
    "site_description": "A Curated Guide to all things Cool in The Cronx",
    "blogs": [
        {
            "title": "Welcome",
            "content": "Croydon and Cool? Say wuuut?! It’s fair to say Croydon isn’t generally considered the epitome of cool. But like all underdogs – there’s way more to it than it’s given credit for.  This big (Brutalist) slab of concrete (surrounded by acres of countryside) has seen a lot of changes in recent years. In East Croydon, there are more entertainment options thanks to the arrival of Boxpark and the refurbishment of Fairfield Halls. There are increased education opportunities courtesy of a new London South Bank University campus and a partnership between Croydon College and the University of Roehampton. There are more enterprise possibilities due to a start-up culture fostered by the likes of Sussex Innovation Centre and Start Up Croydon. The restaurant and bar scene (celebrated at the annual Croydon Food Festival) is attracting foodies from across London and the long-awaited “Westfield” project is now underway again. All this in addition to what already made Croydon a great place to be: a thriving creative arts scene (showcased by it’s London Borough of Culture 2023 programme), a vibrant community (based across a network of unique neighbourhoods – from Coulsdon, Purley and Sanderstead in the south to Norbury, Crystal Palace and Upper Norwood in the north) and excellent transport connections (including trains that get you to Central London in 14 mins, Gatwick Airport in 15 mins and Brighton in 45 mins). As a Borough, Croydon has always bred talent – nurturing top international stars on football fields at CPFC and in studios at The Brit School. Well known for being the birthplace of Dubstep, Croydon’s wider music credentials are unrivalled. The Borough boasts a roll-call of iconic artists spanning all genres – from Samuel Coleridge Taylor, Captain Sensible and Desmond Dekker to Skream & Benga, Stormzy and Raye. A new wave of Creatives (supported and celebrated through the Borough’s Creative Enterprise Zone) have made Croydon home – drawn to studios and workspaces like Matthews Yard, Turf, Conditions, Stanley Arts, ASC and Pirate. Croydon now has a record number of new developments and a growing population of workers, students and residents – who are attracted to all the other great things about the area. After a global pandemic, supporting local and investing in community has never been more important. CLICK HERE to learn how East Croydon Cool helps to celebrate and champion people and places across the Borough."
        }
    ]
}